{"name":"Microsoft's New Policy","description":"Microsoft is “forcing” Outlook and Teams users to open links in Edge browser","date":"June 8, 2023","keywords":"microsfts new policy,electrical era","productsearch":false,"quantity":0,"text":"<h1>Microsoft's New Policy</h1><b>Microsoft is “forcing” Outlook and Teams users to open links in Edge browser.</b><p>Microsoft has recently made a change that is causing some frustration among Outlook and Teams users. The company is now “forcing” users to open links in the Edge browser, even if they have set a different default browser.</p><p>This change is essential for Microsoft\"s continuous endeavors to work on the security and execution of its applications. By opening connections in Edge, Microsoft can guarantee that clients are safeguarded from potential security dangers and that they have the most ideal experience while utilizing its applications.</p><p>Be that as it may, a few clients are not content with this change. They feel that Microsoft is limiting their ability to pick which program they use and that this change is superfluous.</p><p>All in all, how might this change affect Standpoint and Groups clients?</p><a target=\"_blank\" href=\"/images/news/microsofts-new-policy/1.jpg\"><img class=\"singleImg\" src=\"/images/news/microsofts-new-policy/1.jpg\" alt=\"Microsoft's New Policy\"></a><h2 id=\"what-has-changed\">What has Changed?</h2><p>Beforehand, clients could set a default program for their PC, and all connections would open in that program, no matter what the application they were utilizing. Be that as it may, with this change, Standpoint and Groups will currently open connections in the Edge program, regardless of whether an alternate default program is set.</p><p>This change is at present carrying out to clients and is supposed to be completely carried out before very long.</p><h2 id=\"why-has-microsoft-made-this-change\">Why has Microsoft made this change?</h2><p>Microsoft has made this change to improve the security and performance of its applications. By opening links in Edge, Microsoft can ensure that users are protected from potential security threats and that they have the best possible experience when using its applications.</p><p>Edge has a few implicit security highlights, for example, hostile to phishing insurance and Microsoft Safeguard Smart Screen, which can assist with shielding clients from malevolent sites and downloads. By opening connections in Edge, Microsoft can guarantee that clients are safeguarded by these highlights.</p><p>Furthermore, Microsoft has made huge enhancements to the exhibition of Edge lately, making it a quicker and more dependable program for clients.</p><h2 id=\"what-can-users-do\">What can users do?</h2><p>While certain clients may not be content with this change, there are a few things they can do to moderate its effect.</p><p>Clients, right off the bat, can in any case decide to involve an alternate program for their other web perusing needs. This change just applies to joins opened in Viewpoint and Groups, so clients can in any case involve their favored program for different errands.</p><p>Also, clients can decide to reorder joins into their favored program as opposed to tapping on them straightforwardly. This might be an additional tedious interaction, yet it will permit clients to utilize their favored program. </p><p>At last, clients can give criticism to Microsoft about this change. Microsoft is continuously searching for ways of working on its applications, and client criticism can assist with molding future updates and changes. </p><p>All in all, while this change might be disappointing for certain clients, working on the security and execution of Microsoft\"s applications is at last planned. By opening connections in Edge, Microsoft can guarantee that clients are shielded from potential security dangers and that they have the most ideal experience while utilizing its applications.</p>","Ads":[],"necessary":[""]}