{"name":"Apple Devices & Accessories","url":"apple-devices-amp-accessories","category":"cell-phones-tablets-laptops-tvs-amp-accessories","necessary":["apple","iphone","ipad","macbook"],"description":"Shop for Apple products, including iPhones, iPads, MacBooks, and more.","keywords":"apple,iphone,ipad,macbook,macbook case,iphone cover","content":[{"name":"iPhones","url":"iphones","dontInclude":[""],"keyword":["iphone 11","iphone 12","iphone 13","iphone 14","iphone 15","unlocked"],"category":"apple-devices-amp-accessories","description":"Get your hands on the latest iPhones with the best prices.","content":[]},{"name":"iPads, MacBooks & Apple TVs","url":"ipads-macbooks-amp-apple-tvs","dontInclude":[""],"keyword":["ipad","macbook","apple tv"],"category":"apple-devices-amp-accessories","description":"Get your hands on the latest iPhones with the best prices.","content":[{"asin":"B08J5Q255V","title":"Apple 2020 iPad (10.2-inch, Wi-Fi, 32GB) - Silver (8th Generation)","price":"$326.00","saving":"-6%","rating":"4.9","reviews":"64,226 ratings","image":"https://m.media-amazon.com/images/I/71GsWDM8sPL.__AC_SY445_SX342_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"About this item                   Gorgeous 10.2-inch Retina display     A12 Bionic chip with Neural Engine     Support for Apple Pencil (1st generation) and Smart Keyboard     8MP back camera, 1.2MP FaceTime HD front camera     Stereo speakers     802.11ac Wi-Fi and Gigabit-class LTE cellular data     Up to 10 hours of battery life       \n                           Lightning connector for charging and accessories  Touch ID for secure authentication and Apple Pay  iPadOS 14 brings new capabilities designed specifically for iPad      Show more"},{"asin":"B0B3C8XMXM","title":"Apple 2022 MacBook Pro Laptop with M2 chip: 13-inch Retina Display, 8GB RAM, 512GB ​​​​​​​SSD ​​​​​​​Storage, Touch Bar, Backlit Keyboard, FaceTime HD Camera. Works with iPhone and iPad; Silver","price":"$1,458.50","saving":"-17%","rating":"4.7","reviews":"1,228 ratings","image":"https://m.media-amazon.com/images/I/61bX2AoGj2L.__AC_SY445_SX342_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"About this item                   SUPERCHARGED BY M2 — The 13-inch MacBook Pro laptop is a portable powerhouse. Get more done faster with a next-generation 8-core CPU, 10-core GPU and up to 24GB of unified memory.     UP TO 20 HOURS OF BATTERY LIFE — Go all day and into the night, thanks to the power-efficient performance of the Apple M2 chip.     SUSTAINED PERFORMANCE — Thanks to its active cooling system, the 13-inch MacBook Pro can sustain pro levels of performance, so you can run CPU- and GPU-intensive tasks for hours on end.     BRILLIANT DISPLAY — The 13.3-inch Retina display features 500 nits of brightness and P3 wide colour for vibrant images and incredible detail.     HD CAMERA AND STUDIO-QUALITY MICS — Look sharp and sound great with a FaceTime HD camera and three-mic array.     VERSATILE CONNECTIVITY — Two Thunderbolt ports let you connect and power high-speed accessories.     EASY TO USE — Your Mac feels familiar from the moment you turn it on, and it works seamlessly with all your Apple devices.       \n                           SIMPLY COMPATIBLE — All your go-to apps run lightning-fast — including Microsoft 365, Zoom, and many of your favourite iPhone and iPad apps.  COMES WITH APPLECARE WARRANTY – Every Mac comes with a one-year limited warranty and up to 90 days of complimentary technical support. Get AppleCare+ to extend your coverage.      Show more"},{"asin":"B0BJLC6Y62","title":"Apple iPad Pro 11-inch (4th Generation): with M2 chip, Liquid Retina Display, 512GB, Wi-Fi 6E + 5G Cellular, 12MP front/12MP and 10MP Back Cameras, Face ID, All-Day Battery Life – Space Gray","price":"$1,294.00","saving":"","rating":"4.8","reviews":"1,529 ratings","image":"https://m.media-amazon.com/images/I/81WWJj1RedL.__AC_SY445_SX342_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"About this item                   WHY IPAD PRO — iPad Pro is the ultimate iPad experience, with the astonishing performance of the M2 chip, superfast Wi-Fi and 5G, and next-generation Apple Pencil experience. Plus powerful productivity features in iPadOS.     IPADOS + APPS — iPadOS makes iPad more productive, intuitive, and versatile. With iPadOS, run multiple apps at once, use Apple Pencil to write in any text field with Scribble, and edit and share photos. Stage Manager makes multitasking easy with resizable, overlapping apps and external display support. iPad Pro comes with essential apps like Safari, Messages, and Keynote, with over a million more apps available on the App Store.     FAST WI-FI AND 5G CELLULAR CONNECTIVITY — Wi-Fi 6E gives you fast wireless connections for quick transfers of photos, documents, and large video files. And when you’re away from Wi-Fi, superfast 5G gives you the flexibility to stay connected in more places.     PERFORMANCE AND STORAGE — The 8-core CPU in the M2 chip delivers powerful performance, while the 10‑core GPU provides blazing-fast graphics. Add all-day battery life, and you can do everything you can imagine on iPad Pro. Up to 2 terabytes of storage means you can store everything from apps to large files like 4K video.     APPLE PENCIL AND MAGIC KEYBOARD — Apple Pencil (2nd generation) transforms iPad Pro into an immersive drawing canvas and the world’s best note‑taking device. Magic Keyboard features a great typing experience and a built‑in trackpad, while doubling as a protective cover for iPad. Accessories sold separately.     11-INCH LIQUID RETINA DISPLAY — The gorgeous Liquid Retina display features advanced technologies like ProMotion, True Tone, P3 wide color, and ultralow reflectivity, which make everything feel responsive and look stunning.     UNLOCK AND PAY WITH FACE ID — Unlock your iPad Pro, securely authenticate purchases, sign in to apps, and more — all with just a glance.       \n                           ADVANCED CAMERAS — iPad Pro features a 12MP Ultra Wide front camera that supports Center Stage for videoconferencing and selfies. The 12MP Wide and 10MP Ultra Wide back cameras with True Tone flash are great for capturing photos or 4K video with ProRes support. And AR experiences are enhanced with the LiDAR Scanner to capture a depth map of any space.  LEGAL DISCLAIMERS — This is a summary of the main product features.      Show more"},{"asin":"B0BJLDJZPR","title":"Apple iPad Pro 12.9-inch (6th Generation): with M2 chip, Liquid Retina XDR Display, 1TB, Wi-Fi 6E + 5G Cellular, 12MP front/12MP and 10MP Back Cameras, Face ID, All-Day Battery Life – Silver","price":"$1,985.95","saving":"","rating":"4.7","reviews":"1,766 ratings","image":"https://m.media-amazon.com/images/I/814P0ojHArL.__AC_SY445_SX342_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"About this item                   WHY IPAD PRO — iPad Pro is the ultimate iPad experience, with the astonishing performance of the M2 chip, superfast Wi-Fi and 5G, and next-generation Apple Pencil experience. Plus powerful productivity features in iPadOS.     IPADOS + APPS — iPadOS makes iPad more productive, intuitive, and versatile. With iPadOS, run multiple apps at once, use Apple Pencil to write in any text field with Scribble, and edit and share photos. Stage Manager makes multitasking easy with resizable, overlapping apps and external display support. iPad Pro comes with essential apps like Safari, Messages, and Keynote, with over a million more apps available on the App Store.     FAST WI-FI AND 5G CELLULAR CONNECTIVITY — Wi-Fi 6E gives you fast wireless connections for quick transfers of photos, documents, and large video files. And when you’re away from Wi-Fi, superfast 5G gives you the flexibility to stay connected in more places.     PERFORMANCE AND STORAGE — The 8-core CPU in the M2 chip delivers powerful performance, while the 10‑core GPU provides blazing-fast graphics. Add all-day battery life, and you can do everything you can imagine on iPad Pro. Up to 2 terabytes of storage means you can store everything from apps to large files like 4K video.     APPLE PENCIL AND MAGIC KEYBOARD — Apple Pencil (2nd generation) transforms iPad Pro into an immersive drawing canvas and the world’s best note‑taking device. Magic Keyboard features a great typing experience and a built‑in trackpad, while doubling as a protective cover for iPad. Accessories sold separately.     12.9-INCH LIQUID RETINA XDR DISPLAY — Get 1000 nits of full‑screen brightness and 1600 nits of peak brightness, a 1,000,000:1 contrast ratio, Reference Mode for a more color-accurate workflow, and advanced display technologies like ProMotion, True Tone, and P3 wide color. The Liquid Retina XDR display is perfect for viewing and editing HDR photos and video, enjoying your favorite shows, or even playing games.     UNLOCK AND PAY WITH FACE ID — Unlock your iPad Pro, securely authenticate purchases, sign in to apps, and more — all with just a glance.       \n                           ADVANCED CAMERAS — iPad Pro features a 12MP Ultra Wide front camera that supports Center Stage for videoconferencing and selfies. The 12MP Wide and 10MP Ultra Wide back cameras with True Tone flash are great for capturing photos or 4K video with ProRes support. And AR experiences are enhanced with the LiDAR Scanner to capture a depth map of any space.  LEGAL DISCLAIMERS — This is a summary of the main product features.      Show more"},{"asin":"B083TD3V4J","title":"RCA Roku Smart Home Theater Projector - Stream Netflix, Prime Video, Hulu, Disney+, Apple TV+ and more - Portable Projector Compatible with TV, PC, HDMI, USB, VGA - Living room/Backyard Projector","price":"$138.92","saving":"","rating":"4.1","reviews":"437 ratings","image":"https://m.media-amazon.com/images/I/71b2yDQ2pML.__AC_SY300_SX300_QL70_ML2_.jpg","availability":"Only 4 left in stock - order soon.","tag":"","description":"RCA 720p Home Theater Projector (Includes Roku Streaming Stick)"}]},{"name":"Apple Watch","url":"apple-watch","dontInclude":[""],"keyword":["watch"],"category":"apple-devices-amp-accessories","description":"Make your wrist look stylish with an Apple smartwatch.","content":[]},{"name":"Airpods & Headphones","url":"airpods-amp-headphones","dontInclude":[""],"keyword":["pods","headphone","buds","headset"],"category":"apple-devices-amp-accessories","description":"Buy the best Apple airpods and headphones and enjoy your music.","content":[{"asin":"B0CQ48Z3BB","title":"2 Pack-Apple Earbuds/iPhone Headphones/Lightning [Apple MFi Certified] Wired Earphones Built-in Microphone & Volume Control Compatible with iPhone 14/13/12/11/8/Pro Max/X/7, Support All iOS System","price":"$16.98","saving":"","rating":"4.2","reviews":"1,059 ratings","image":"https://m.media-amazon.com/images/I/61Sx1phHpGL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"About this item                   【Compatibility】Ideal for iPhone devices, including compatible with iPhone 14/14 Pro Mxa/14 Pro/13/13 Pro Mxa/13 Pro/12/12 Pro Mxa/12 Pro/11/11 Pro Mxa/11 Pro/iPhone X/XS/XS Max/XR, iPhone 8 & 8 Plus/7 & 7 Plus, iPad Pro/Mini 4/Air 2, Support All iOS System.     【Remote and Microphone】The remote lets you adjust the volume, control the playback, and answer or end calls with a pinch of the cord. The speakers inside maximize sound output and minimize sound loss, provide you high-quality audio.     【Perfect Stereo Sound】Ergonomic and ultra-lightweight in-ear designed with solid sound-insulating material, reduces external noise while minimizing the sound leakage, giving you clear sound.     【Excellent Materials】Each accessory is made of high-quality materials, whether the speakers, buttons, headphone cable, or connection port, durable, not easily damaged, and cost-effective.     【2023 New Pop-Up Headphones】You need to first open Blue t00th on your phone, then insert the headset into the Phone, a pop-up window will appear in a few seconds, you need to click \"Connect with iCloud\". (The second or later insertion of the phone will automatically connect)"},{"asin":"B0CNCV8THH","title":"2-Pack Apple Earbuds [Apple MFi Certified] Earphones Wired with Microphone for 3.5mm iPhone Headphones (Built-in Microphone & Volume Control) Compatible with iPhone/iPad/iPod/Computer/MP3/4,Android","price":"$13.85","saving":"-27%","rating":"4.4","reviews":"1,048 ratings","image":"https://m.media-amazon.com/images/I/61MZzWt6SJL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"About this item                   【Headphones Excellent Compatibility】Compatible with all lightning connector devices, tablet, Compatible with iOS and Android System:Compatible with iPhone 6s Plus / 6s / 6 Plus / 6 / 5s / 5c / 5 / SE/ iPad Pro / iPad Air / Air 2 / iPad mini / mini 2 / mini 4 / iPad 4 / iPod Touch 5 / iPod nano 7 /Tablet/ PCPC, MP4 / MP3, laptop and other devices that are compatible with 3.5mm headphones.     【Ergonomic Design】Combining classic design noise reduction, give you premium sound quality and maximum comfort. It produce exceptional frequency response for an enhanced listening experience and creates a better sound isolation and minimizes external sound interference.Earphones with ergonomic angular design and soft & premium eartips not only give you a comfortable listening experience but also less likely to fall out even when you are running, hiking or jogging.     【High-Quality Sound】The iPhone Earbuds uses 100% copper core to provide lossless digital sound quality, supports 48KHz and 24-bit audio output, Built-in premium-shockproof membrane and sound devices with better sensitivity and noise reduction than conventional headphones can achieve good sound quality even with normal devices.     【Connection Method】You need to first open blue-t00th on your phone, then insert the headset into the iPhone, a pop-up window will appear in a few seconds, you need to click \"Connect with iCloud\". (The second or later insertion of the phone will automatically connect)     【Enjoy The Service】we are committed to providing satisfactory service to all our customers, uarantee to make sure every order you place is a great experience and that, Any questions heisted to contact us. we quickly resolve any concerns you might have."},{"asin":"B06X16Z7DZ","title":"Apple EarPods Headphones with 3.5mm Plug, Wired Ear Buds with Built-in Remote to Control Music, Phone Calls, and Volume","price":"$18.79","saving":"","rating":"4.6","reviews":"276,390 ratings","image":"https://m.media-amazon.com/images/I/410eivKV4DL.__AC_SY445_SX342_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"About this item                   SUPERIOR COMFORT — Unlike traditional circular ear buds, the design of EarPods is defined by the geometry of the ear. Which makes them more comfortable for more people than any other ear bud–style headphones.     HIGH-QUALITY AUDIO — The speakers inside EarPods have been engineered to maximize sound output and minimize sound loss, which means you get high-quality audio.     BUILT-IN REMOTE — EarPods with 3.5mm Headphone Plug also include a built-in remote that lets you adjust the volume, control the playback of music and video, and answer or end calls with a pinch of the cord.     COMPATIBILITY — Works with all devices that have a 3.5mm headphone jack.     INTEGRATED MICROPHONE — A built-in microphone precisely captures your voice while you’re on the phone, taking a FaceTime call, or summoning Siri — so you’re always heard loud and clear."},{"asin":"B09VM2TBZF","title":"Skullcandy Jib True 2 In-Ear Wireless Earbuds, 32 Hr Battery, Microphone, Works with iPhone Android and Bluetooth Devices - Black","price":"$30.49","saving":"-24%","rating":"4.3","reviews":"3,553 ratings","image":"https://m.media-amazon.com/images/I/61h5ALBhEtL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"Jib True is the true wireless earbuds that made simple sexy. Jib True 2 is all that plus 50% more battery life and the peace of mind that Tile finding technology provides."},{"asin":"B0B75MQJQR","title":"Skullcandy Riff 2 On-Ear Wireless Headphones, 34 Hr Battery, Microphone, Works with iPhone Android and Bluetooth Devices - Black","price":"$39.88","saving":"-20%","rating":"4.4","reviews":"7,643 ratings","image":"https://m.media-amazon.com/images/I/71BNwI6tPDL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"Riff Wireless 2 delivers the goods with unparalleled comfort, and they’re built to stand up to years of everyday use. Plus, an included backup aux cable gives you the option of plugging in if wired is your thing. Multipoint Paring makes it possible to pair your earbuds or headphones to two devices at once. If your phone rings while you’re watching a video on your laptop, your connection will switch automatically so you can take the call."}]},{"name":"iPhone, iPad & MacBook Cases","url":"iphone-ipad-amp-macbook-cases","dontInclude":[""],"keyword":["case","cover"],"category":"apple-devices-amp-accessories","description":"Protect and make your iPhone, iPad or MacBook look stylish with a case.","content":[{"asin":"B0CHX2RMZT","title":"Apple iPhone 15 Pro Max Clear Case with MagSafe ​​​​​​​","price":"$49.00","saving":"","rating":"4.4","reviews":"462 ratings","image":"https://m.media-amazon.com/images/I/410gWbZgGcL.__AC_SY445_SX342_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"About this item                   Crafted with a blend of optically clear polycarbonate and flexible materials, the case fits right over the buttons for easy use. On the surface, a scratch-resistant coating has been applied to both the interior and exterior. And all materials and coatings are optimized to prevent yellowing over time.     With built-in magnets that align perfectly with iPhone 15 Pro Max, this case offers a magical attach experience and faster wireless charging, every time. When it’s time to charge, just leave the case on your iPhone and snap on your MagSafe charger, or set it on your Qi-certified charger.     Like every Apple-designed case, it undergoes thousands of hours of testing throughout the design and manufacturing process. So not only does it look great, it’s built to protect your iPhone from scratches and drops.     Compatible with iPhone 15 Pro Max"},{"asin":"B0CHX149WM","title":"Apple iPhone 15 Pro Max Silicone Case with MagSafe - Clay ​​​​​​​","price":"$49.00","saving":"","rating":"4.3","reviews":"868 ratings","image":"https://m.media-amazon.com/images/I/41IuChPSc6L.__AC_SY445_SX342_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"About this item                   The silky, soft-touch finish of the silicone exterior feels great in your hand. And on the inside, there’s a soft microfiber lining for even more protection.     With built-in magnets that align perfectly with iPhone 15 Pro Max, this case offers a magical attach experience and faster wireless charging, every time. When it’s time to charge, just leave the case on your iPhone and snap on your MagSafe charger, or set it on your Qi-certified charger.     Like every Apple-designed case, it undergoes thousands of hours of testing throughout the design and manufacturing process. So not only does it look great, it’s built to protect your iPhone from scratches and drops.     Compatible with iPhone 15 Pro Max"},{"asin":"B0CC6QD33N","title":"Case-Mate iPhone 15 Pro Max Case - Twinkle Disco [12ft Drop Protection] [Compatible with MagSafe] Magnetic Cover with Cute Bling Sparkle for iPhone 15 Pro Max 6.7&quot;, Anti-Scratch, Shockproof, Slim","price":"$49.99","saving":"","rating":"4.4","reviews":"2,067 ratings","image":"https://m.media-amazon.com/images/I/71vtaqDqkmL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"A fun twist on our classic Karat case! The twinkle design with rose-tinted clear iridescent glitter foil changes at every angle, sure to catch everyone’s eye. All the glitters are embedded inside a clear resin cover so that they never chip or fade away with use, making it easy to carry and a flat surface for other phone accessories. It also comes with benefits like 12ft drop protection, raised bezels, and cushioned corners to protect your phone from any accidental drop, bumps, or impacts and anti-scratch technology makes sure it looks newer for longer. Furthermore, It features a built-in strong magnet for making wireless/magnetic charging fast and easy and syncs with all MagSafe accessories, and has precise cutouts for easy access to all functionsCase-Mate iPhone 15 Pro Max Case Features:12ft Drop ProtectionCompatible with MagSafeMade with Recycled MaterialsAnti-Scratch CoatingFlexible Sides for Enhanced GripPrecise Cut-OutsSleek ProfileRaised Edges for Extra ProtectionCushioned CornersLifetime WarrantyWho are we: We at Case-Mate ensure to provide stylish yet thoughtful phone cases and mobile accessories to our shoppers. All of our designs are not only built to look good but also to protect your phone. Whether it comes with military-grade shock-absorbing layers or provides 12 feet of drop protection, our products are built to withstand drops from varying heights.We have a variety of case designs for the newest flagship smartphones such as iPhone 15 Pro Max, iPhone 15 Pro, iPhone 15 Plus, iPhone 15, Samsung S23 series, and more."},{"asin":"B08S374BVG","title":"ESR for iPad Pro 12.9 Case, iPad Pro 12.9 Inch Folio Case (2022/2021/2020, 6th/5th/4th Gen), Convenient Magnetic Attachment, 2-Way Stand, Full Pencil 2 Support, Rebound Magnetic Case, Black","price":"$19.54","saving":"","rating":"4.7","reviews":"4,312 ratings","image":"https://m.media-amazon.com/images/I/71k8TwObfmL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"About this item                   Compatibility: only compatible with iPad Pro 12.9 inch (2022, 6th Generation), iPad Pro 12.9 inch (2021, 5th Generation), and iPad Pro 12.9 inch (2020, 4th Generation); models A2764, A2437, A2378, A2461, A2379, A2229, A2069, A2232     Secure Magnetic Attachment: powerful magnets ensure a strong lock between case and tablet     Lightweight Protection: protect every inch of your tablet from drops and bumps while maintaining its sleek profile and convenient portability     Two-Way Stand: magnetic trifold cover easily folds into a stable stand for viewing or writing to ensure a comfortable angle for catching up on your favorite shows or taking notes with your Pencil     Ultra-durable: advanced material provides powerful scratch resistance that keeps your case looking like new for years"},{"asin":"B00QWRISTA","title":"JETech Case for iPad Air 2 (2nd Generation), Smart Cover Auto Wake/Sleep (Black)","price":"$9.99","saving":"-38%","rating":"4.5","reviews":"52,015 ratings","image":"https://m.media-amazon.com/images/I/61EsFxX+VsL._AC_SY300_SX300_.jpg","availability":"Only 1 left in stock - order soon.","tag":"","description":"About this item                   (NOTE: NOT compatible with iPad Air 1st Edition, iPad 6th/5th Generation, iPad Pro 9.7); Designed for iPad Air 2 Second Edition with Touch ID technology. Fit iPad Models: A1566/A1567. Please check back bottom of your iPad to find the model number     Made with PU+PC. Slim/light design. Synthetic exterior and smooth interior provide comprehensive protection for your iPad     Magnetic smart cover supports automatic sleep/wake function.The tri-fold front cover can support iPad in two standing position for viewing and typing     Easy access to all the controls and features; Perfect cutouts for speakers, camera and other ports     Package includes: iPad Air 2 case, customer service card"},{"asin":"B07175N8XP","title":"JETech Case for iPad Pro 10.5-Inch and iPad Air 3 (10.5-Inch 2019, 3rd Generation), Smart Cover Auto Wake/Sleep Cover (Black)","price":"$14.99","saving":"","rating":"4.5","reviews":"29,235 ratings","image":"https://m.media-amazon.com/images/I/61p-LLxHZsL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"Only 4 left in stock - order soon.","tag":"Amazon's  Choice","description":"Designed for iPad Air 3rd generation 10.5 (2019) and iPad Pro 10.5 (2017). NOT compatible with any other iPad models. Fit iPad Models: A1701/A1709/A2152/A2123/A2153. Please check back bottom of your iPad to find the model number."},{"asin":"B0CRDG9NP6","title":"May Chen Case for M2 MacBook Air 13.6 inch 2022 Release Model A2681, Plastic Hard Shell case with Screen Protector & Keyboard Cover for Mac Air 13.6 with Touch ID, Elephant","price":"$26.99","saving":"","rating":"4.6","reviews":"633 ratings","image":"https://m.media-amazon.com/images/I/81G9GvoqNuL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"May Chen Plastic Hard Shell Case & Keyboard Cover Skin & Screen Protector & Dust plug Series  Case Compatible with:   For MacBook Air 13.6 inch Model A2681 Apple M2 Chip with Liquid Retina display and Touch ID ( 2022 Release ) Case Note Compatible with:   x Not fit for Macbook Air 13 inch with Retina Display & Touch ID 2020-2018 Release (A2337 M1/A2179/A1932) Plastic Hard Shell Case The May Chen case is made from sturdy polycarbonate material, slim, lightweight and seamless, which is very flexible and durable, not esaily broken. Exquisite finish plastic hard shell case protects your For MacBook from scrapes and scratches. The case is designed with two rows of bottom ventilation, allowing safe heat disbursement, help your MacBook ventilate, keeping cool. Fully access to all buttons and features. Totally removable, easy to put on and take off that can protect your For MacBook from scrapes and scratches. Colorful Exclusive design pattern protective case to your computer to bring visual impact, you can easily choose the color you like Package including:  1x Hard shell case + 1x Screen protector + 1x Keyboard cover + 1x USB dust plug"},{"asin":"B07PHYTZVN","title":"MoKo Case Fit New iPad Mini 5 2019/Mini 4 2015 (5th/4th Generation 7.9 inch), Slim Lightweight Smart Shell Stand Cover with Translucent Frosted Back Protector, with Auto Wake/Sleep,Rose Gold","price":"$9.99","saving":"","rating":"4.6","reviews":"12,909 ratings","image":"https://m.media-amazon.com/images/I/612jZABXKSL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"Only 1 left in stock - order soon.","tag":"Amazon's  Choice","description":"About this item                   Compatibility - Designed exclusively for iPad Mini 5th Generation 7.9\" 2019 (Model Number: A2133 / A2124 / A2126 / A2125) & iPad Mini 4 2015 (Model Number: A1538 / A1550) tablet Only. Note: DO NOT fit other Tablet, please check the tablet back number before purchasing. Access to all features and controls.     Adjustable Angles - Strong magnetic connection to create a stable viewing stand for your tablet. Two angles are provided for satisfying your viewing and typing needs. Avoid any joint pain, and free your hands for other entertainments.     Auto Wake/Sleep - Built-in magnetic strip, automatically wakes or puts your tablet to sleep when the lid is opened and closed. Protects and extends battery life.     Excellent Quality - Made of durable PU leather exterior, soft microfiber lining and coverage with translucent PC back shell, this case provides total full body protection against fingerprints, shocks, scratches and dust.     Simple Fashion Design – Slim and lightweight hard back design adds minimal bulk while protecting your precious device. The translucent frosted back cover allows you to see the icon through your favorite color. A variety of colors and designs fashions your life. If you have any quality problems, you can contact us at any time."},{"asin":"B01A6EO0N2","title":"MOSISO Laptop Sleeve Compatible with MacBook Air/Pro, 13-13.3 inch Notebook, Compatible with MacBook Pro 14 inch M3 M2 M1 Chip Pro Max 2023-2021, Neoprene Bag with Small Case, Black","price":"$14.38","saving":"-10%","rating":"4.6","reviews":"44,825 ratings","image":"https://m.media-amazon.com/images/I/6185myKan4L.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"Only 10 left in stock - order soon.","tag":"Amazon's  Choice","description":"About this item                   The big bag internal dimension is: 13.58 x 0.79 x 9.64 inch (L x W x H); external dimension is: 13.97 x 0.79 x 10.04 inch (L x W x H). The additional small pouch bag internal dimension is: 5.71 x 0.59 x 5.12 inch (L x W x H); external dimension is: 6.3 x 0.59 x 5.31 inch (L x W x H).     Features a neoprene foam padding layer and fluffy fleece fabric lining for bump and shock absorption and protection of your computer from accidental scratches.     Additional small storage pouch bag for you to storage laptop mouse and earphone. Same color as the big sleeve bag, harmony and stylish. This protective carrying sleeve case cover bag with small pouch is ideal for you to take your laptop out.     Slim and lightweight; does not bulk your laptop up and can easily slide into your briefcase, backpack or other bag. Top-loading zipper on the sleeve glides smoothly and allows convenient access to your laptop computer.     Compatible with MacBook Pro 14 inch 2023-2021 M3 A2918 A2992 M2 A2779 M1 A2442 Pro Max with Touch ID, compatible with MacBook Air 13 inch A1369 A1466 2010-2017, compatible with MacBook Pro 13 inch A1425 A1502 A1278 2008-2015; Compatible with Surface Book 3/2/1 13.5, compatible with Surface Laptop 4/3/2/1 13.5; Compatible with Dell Latitude 14; Compatible with HP Elitebook 13.3/Spectre X360 13.3/Envy 13/Stream 13/Stream 14/Pavilion 14; compatible with Lenovo IdeaPad 13/14."},{"asin":"B09HWSSQYN","title":"NTG Military Shockproof iPhone 12 Case [2 Layer Structure][Military Grade Anti-Drop] Hard Slim iPhone 12 Phone Case, Shockproof Protective Phone Case for iPhone 12 (6.1 inch), Black","price":"$12.99","saving":"-7%","rating":"4.6","reviews":"10,932 ratings","image":"https://m.media-amazon.com/images/I/710gWblhaoL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"About this item                   [NTG - Next Tough Gear]: We are committed to providing users with unique tough phone cases, providing you a brand-new experience of iPhone 12/pro case.     [Slender Design]: Ultra thin and slim design makes it slips in pockets easily and pocket-friendly.     [High Quality]: For iPhone 12/pro cover, Certified MIL-STD drop test, and cushioned corners can prevent your iPhone 12 from accidental drops, bumps, dust and scratches.     [2-LAYER PROTECTION]: Flexible TPU + Hard PC with 4 cushioned corner bumpers and raised lips camera protection bumper, this iPhone 12/pro case guaranteed to withstand shocks and scratches.     [Compatible Model]: Wireless charging compatible and ONLY Compatible with iPhone 12/pro 6.1 inch, NOT fit for iPhone 12 pro max and iPhone 12 mini."},{"asin":"B086C8GBBV","title":"ORIbox Case Compatible with iPhone 11 , Heavy Duty Shockproof Anti-Fall Clear","price":"$8.44","saving":"-11%","rating":"4.3","reviews":"19,342 ratings","image":"https://m.media-amazon.com/images/I/81O9IolbBzL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"The picture is for reference only, please check the style and color suitable for your iPhone model.Grab the bottom piece from dust proof plug on charge jack or ring/vibrate button, Pull out the soft cover from the slot on hard bumper, Carefully peel it off, Find the openings on 2 sides, Carefully separate the hard bumper, Insert your phone, Make sure every button right on their position then snap on, Put on the soft layer, Finish off"},{"asin":"B085FDS5FJ","title":"ORIbox Case for iPad 7th and iPad 8th and iPad 9th Gen [10.2 Inch] Clear,with 4 Corners Shockproof Protection, TPU Back Cover for iPad, Clear","price":"$7.65","saving":"-10%","rating":"4.3","reviews":"1,940 ratings","image":"https://m.media-amazon.com/images/I/71SEjT2XkCL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Welcome to buy ORIbox products, We have multiple well-designed product series. Contracted design style, with your life, contracted and not simple. Exclusively designed for iPad 9th 10.2''(2021),Model: (A2602, A2603, A2604, A2605).iPad 8th 10.2''(2020),Model: (A2270/ A2428/ A2429/A2430).iPad 7th 10.2''(2019),Model:A2197/A2198/A2200).NOT compatible with any other iPad models. Please check the model number on the back of your iPad."},{"asin":"B09DPPFMKM","title":"ORIbox for iPhone 14 Case for iPhone 13 Case Clear,with 4 Corners Shockproof Protection,iPhone 14/13 Clear Case for Women Men Girls Boys Kids,Case for iPhone 14/13 Phone Clear","price":"$6.23","saving":"-11%","rating":"4.5","reviews":"2,228 ratings","image":"https://m.media-amazon.com/images/I/71IM5fWQoGL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"The picture is for reference only, please check the style and color suitable for your iPhone model.How to install this case?1.Grab the bottom piece from dust proof plug on charge jack or ring/ vibrate button2.Pull out the soft cover from the slot on hard bumper3.Carefully peel it off4.Find the openings on 2 sides5.Carefully separate the hard bumper6.Insert your phone7.Make sure every button right on their position then snap on8.Put on the soft layer9.Finish off"},{"asin":"B09D51Z5TR","title":"OtterBox Commuter Series iPhone 13 Case - Black, Dual Layer, Antimicrobial, Wireless Charging Compatible","price":"$26.55","saving":"-34%","rating":"4.7","reviews":"8,000 ratings","image":"https://m.media-amazon.com/images/I/71o-GDx1vcL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Get moving with Commuter Series, the slim, protective case that keeps your phone safe from drops and bumps. A silver-based antimicrobial additive is integrated into the case that helps inhibit microbial growth and defends the case exterior against many common bacteria. Built to beat the daily grind, Commuter Series combines a pocket-friendly profile with robust defense and added grip to ensure you keep going mile after mile."},{"asin":"B09QT66TB6","title":"OtterBox Defender Series Case for iPad Mini (6TH GEN) - BLACK","price":"$53.99","saving":"-23%","rating":"4.4","reviews":"759 ratings","image":"https://m.media-amazon.com/images/I/61uRlFzRL8L.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Defend your iPad mini (5th Gen) against drops, dirt and scrapes with Defender Series. Combining a hard internal shell, a soft outer slipcover and a built-in screen protector, Defender Series deflects the action and accidents that come your way every day. Plus, the included shield stand sets up quick for hands-free viewing and comfortable typing."},{"asin":"B00Z7T6F4Y","title":"OtterBox Defender Series Case for iPad Pro 10.5&quot; & iPad Air (3rd Generation) - Retail Packaging - BLACK","price":"$39.05","saving":"-15%","rating":"4.7","reviews":"4,496 ratings","image":"https://m.media-amazon.com/images/I/61zUO1yslTL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"Worry less while you're on the job. Defender Series for iPad Pro (10.5-inch) combines three ultra-tough layers to guard your device against serious drops, dirt, scrapes and bumps. The built-in screen film stops display scratches, plus the included shield stand gives you hands-free viewing convenience. Defender Series works hard to protect your device every day."},{"asin":"B08XZXC42M","title":"OtterBox Defender Series Case for iPad Pro 11-inch (3rd, 2nd, & 1st Gen) - BLACK","price":"$60.93","saving":"-32%","rating":"4.6","reviews":"1,761 ratings","image":"https://m.media-amazon.com/images/I/417N0zFai6L.__AC_SY300_SX300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Defender Series is the protective case that guards your device against drops, dirt and scrapes. The hard internal shell, soft outer slipcover and built-in screen protector deflect everyday action and accidents. And, the included shield stand enables hands-free viewing and comfortable typing."},{"asin":"B07W7F4P63","title":"OtterBox IPhone 11 Commuter Series Case - BESPOKE WAY (BLAZER BLUE/STORMY SEAS BLUE), Slim & Tough, Pocket-Friendly, with Port Protection","price":"$24.95","saving":"-38%","rating":"4.7","reviews":"47,724 ratings","image":"https://m.media-amazon.com/images/I/51xfmD6D3vL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Commuter Series is the compact case that keeps your phone safe while you live life on the go. Its two tough layers come together to protect your iPhone 11 against drops, bumps, dust and fumbles. Slip Commuter Series into your pocket and never miss a call, tweet or text."},{"asin":"B07W45LXNX","title":"OtterBox iPhone 11 Symmetry Series Case - CLEAR, Ultra-sleek, Wireless Charging Compatible, Raised Edges Protect Camera & Screen","price":"$28.42","saving":"-43%","rating":"4.7","reviews":"9,201 ratings","image":"https://m.media-amazon.com/images/I/41UcBABOb0L.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Ultra-slim, ultra-protective Symmetry Series Clear expresses your personality. Not seeing is believing with a clear design that shows off your device and your style."},{"asin":"B08DY7D8WZ","title":"OtterBox IPhone 12 & IPhone 12 Pro Commuter Series Case - BESPOKE WAY (BLAZER BLUE/STORMY SEAS BLUE), Slim & Tough, Pocket-Friendly, with Port Protection","price":"$24.71","saving":"-38%","rating":"4.6","reviews":"9,869 ratings","image":"https://m.media-amazon.com/images/I/51IHZcqmMhL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"Life on the go just got a lot easier with Commuter Series. From professional to casual, Commuter Series is a trusted favorite. Featuring a soft internal slipcover and a rigid external shell, Commuter Series keeps your phone safe from day-to-day drops and scrapes. Additionally, a silver-based antimicrobial additive is integrated into the case that helps inhibit microbial growth and defends the case exterior against many common bacteria. Weaving the additive into the case materials ensures it keeps protecting your case 24/7/365 and outlasts heavy use. Commuter Series equips your phone with a sleek exterior that slips in and out of pockets and added grip for confident handling. Go about your life with confidence, your case is protected against bacteria and your phone is protected against drops."},{"asin":"B08DY77FYW","title":"OtterBox iPhone 12 & iPhone 12 Pro Defender Series Case - BLACK, rugged & durable, with port protection, includes holster clip kickstand","price":"$34.95","saving":"","rating":"4.7","reviews":"17,767 ratings","image":"https://m.media-amazon.com/images/I/51u38N2cZwL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Worry less while you’re working, adventuring and living when you defend your device against drops, dirt and scrapes. Combining a solid internal shell with a resilient outer slipcover, Defender Series SCREENLESS Case deflects the action and accidents that come your way every day. Plus, the included holster doubles as a kickstand for hands-free viewing. Defender Series SCREENLESS Case — because life happens!Specifications:Compatible With:iPhone 12iPhone 12 ProDrop Height:DROP+ | 4X as many drops as military standard (MIL-STD-810G 516.6)Dimensions:6.38 in x 3.58 in x 1.3 in / 162.05 mm x 90.93 mm x 33.02 mmWeight:0.28 lbs | 127.00 gMaterials:Polycarbonate shellSynthetic rubber slipcoverPolycarbonate holsterCase Features:Updated slimmer design, same rugged protection and drop performanceMulti-layer defense from the solid inner shell and resilient outer slipcoverPort covers prevent dirt, dust and lint from clogging jacks and portsScreenless design provides flawless touch responseHolster works as a belt clip and a hands-free kickstandRaised edges protect camera and screenWorks with 5G, 4G and all other standard networksWorks with Qi wireless charging (We recommned OtterBox Power accessories for best Qi wireless experience)Limited lifetime warranty supported by hassle-free customer service"},{"asin":"B09D52CVKV","title":"OtterBox iPhone 13 (ONLY) Symmetry Series Case - Stardust, Ultra-Sleek, Wireless Charging Compatible, Raised Edges Protect Camera & Screen","price":"$25.06","saving":"","rating":"4.7","reviews":"1,596 ratings","image":"https://m.media-amazon.com/images/I/71J3N9jf4YL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Symmetry Series is the slim and protective case that shows off your style. All of your phone’s buttons, features and functions work flawlessly. Additionally, a silver-based antimicrobial additive is integrated into the case that helps inhibit microbial growth and defends the case exterior against many common bacteria. And, Symmetry Series is easy to remove and install."},{"asin":"B09D5FJPV5","title":"OtterBox iPhone 13 mini & iPhone 12 mini Symmetry Series Case - CLEAR, ultra-sleek, wireless charging compatible, raised edges protect camera & screen","price":"$49.99","saving":"","rating":"4.6","reviews":"1,002 ratings","image":"https://m.media-amazon.com/images/I/617SPzGr1NL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Symmetry Series is the slim and protective case that shows off your style. All of your phone’s buttons, features and functions work flawlessly. Additionally, a silver-based antimicrobial additive is integrated into the case that helps inhibit microbial growth and defends the case exterior against many common bacteria. And, Symmetry Series is easy to remove and install."},{"asin":"B09D5GD9ZP","title":"OtterBox iPhone 13 Pro (ONLY) Commuter Series Case - RIVETING WAY, slim & tough, pocket-friendly, with port protection","price":"$21.95","saving":"-45%","rating":"4.6","reviews":"2,375 ratings","image":"https://m.media-amazon.com/images/I/61P0UQjgTtL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"Get moving with Commuter Series, the slim, protective case that keeps your phone safe from drops and bumps. A silver-based antimicrobial additive is integrated into the case that helps inhibit microbial growth and defends the case exterior against many common bacteria. Built to beat the daily grind, Commuter Series combines a pocket-friendly profile with robust defense and added grip to ensure you keep going mile after mile."},{"asin":"B09D54B4BR","title":"OtterBox iPhone 13 Pro (ONLY) Defender Series Case - BLACK, Rugged & Durable, With Port Protection, Includes Holster Clip Kickstand","price":"$25.14","saving":"","rating":"4.7","reviews":"2,251 ratings","image":"https://m.media-amazon.com/images/I/71cif-Nyf6L.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Looking for legendary protection? You’ve found it with Defender Series. The multi-layer construction guards your device from serious drops, dirt, scrapes and bumps. Plus, the included holster does double duty as a belt clip or hands-free kickstand. Defender Series works hard and plays harder with a rugged and refined design that’s ready for anything."},{"asin":"B09D55YMC1","title":"OtterBox iPhone 13 Pro Max & iPhone 12 Pro Max Commuter Series Case - BLACK, Slim & Tough, Pocket-Friendly, With Port Protection","price":"$32.95","saving":"-18%","rating":"4.6","reviews":"8,248 ratings","image":"https://m.media-amazon.com/images/I/61iyaUnoSCL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"Get moving with Commuter Series, the slim, protective case that keeps your phone safe from drops and bumps. A silver-based antimicrobial additive is integrated into the case that helps inhibit microbial growth and defends the case exterior against many common bacteria. Built to beat the daily grind, Commuter Series combines a pocket-friendly profile with robust defense and added grip to ensure you keep going mile after mile."},{"asin":"B09D5MDTVR","title":"OtterBox iPhone 13 Pro Max & iPhone 12 Pro Max Defender Series Case - BLACK, Rugged & Durable, with Port Protection, Includes Holster Clip Kickstand","price":"$36.62","saving":"-39%","rating":"4.6","reviews":"6,825 ratings","image":"https://m.media-amazon.com/images/I/71D7P3LXjAL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Looking for legendary protection? You’ve found it with Defender Series. The multi-layer construction guards your device from serious drops, dirt, scrapes and bumps. Plus, the included holster does double duty as a belt clip or hands-free kickstand. Defender Series works hard and plays harder with a rugged and refined design that’s ready for anything."},{"asin":"B09D57Z3DN","title":"OtterBox iPhone 13 Pro Max & iPhone 12 Pro Max Symmetry Series Case - BLACK, ultra-sleek, wireless charging compatible, raised edges protect camera & screen","price":"$29.90","saving":"-40%","rating":"4.5","reviews":"1,652 ratings","image":"https://m.media-amazon.com/images/I/618F7K4RldL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Symmetry Series is the slim and protective case that shows off your style. All of your phone’s buttons, features and functions work flawlessly. Additionally, a silver-based antimicrobial additive is integrated into the case that helps inhibit microbial growth and defends the case exterior against many common bacteria. And, Symmetry Series is easy to remove and install."},{"asin":"B09GRRRPPZ","title":"OtterBox IPhone 13 Pro Max & IPhone 12 Pro Max Symmetry Series+ Case - Clear, Ultra-Sleek, Snaps to MagSafe, Raised Edges Protect Camera & Screen","price":"$37.99","saving":"-37%","rating":"4.5","reviews":"2,291 ratings","image":"https://m.media-amazon.com/images/I/618uAQs37JL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"Available to ship in 1-2 days","tag":"Amazon's  Choice","description":"Get the most out of your new Apple iPhone with SYMMETRY SERIES+ for MagSafe. This slim case shows off your iPhone’s sleek design and was thoughtfully developed to interact with Apple’snew innovative MagSafe system —bringing a new level of interactivity to your iPhone. All of your phone’s buttons, features and functions work flawlessly, while durable protection shields against drops, bumps and fumbles. Additionally, a silver-based antimicrobial additive is integrated into the case that helps inhibit microbial growth and defends the case exterior against many common bacteria. And, the one-piece design is easy to install. Go about your life with confidence your phone is protected, without sacrificing an ounce of style."},{"asin":"B0B7CBRCN8","title":"OtterBox IPhone 14 & IPhone 13 Commuter Series Case - DONT BE BLUE (Blue), Slim & Tough, Pocket-Friendly, with Port Protection","price":"$23.94","saving":"-40%","rating":"4.8","reviews":"919 ratings","image":"https://m.media-amazon.com/images/I/61z84Y7DCbL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"Get moving with Commuter Series, the thin phone case that keeps your phone safe from drops and bumps. Wireless ready, it works with both Qi charging and MagSafe (no magnets in case). Built to beat the daily grind, Commuter Series combines a pocket-friendly profile with robust defense and added grip to ensure you keep going mile after mile."},{"asin":"B0B7CCLH61","title":"OtterBox iPhone 14 Pro (ONLY) Commuter Series Case - TREES COMPANY (Green), Slim & Tough, Pocket-Friendly, with Port Protection","price":"$23.88","saving":"-40%","rating":"4.6","reviews":"581 ratings","image":"https://m.media-amazon.com/images/I/71bWUnQS2vL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"Get moving with Commuter Series, the thin phone case that keeps your phone safe from drops and bumps. Wireless ready, it works with both Qi charging and MagSafe (no magnets in case). Built to beat the daily grind, Commuter Series combines a pocket-friendly profile with robust defense and added grip to ensure you keep going mile after mile."},{"asin":"B0B7CGYP9T","title":"OtterBox iPhone 14 Pro Max (ONLY) Defender Series Case - BLACK , rugged & durable, with port protection, includes holster clip kickstand","price":"$34.95","saving":"-46%","rating":"4.6","reviews":"1,870 ratings","image":"https://m.media-amazon.com/images/I/717d1XEDYML.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Looking for legendary protection? You’ve found it with the durable phone case, Defender Series. The multi-layer construction guards your device from serious drops, dirt, scrapes and bumps. Wireless ready, it works with both Qi charging and MagSafe (no magnets in case). Plus, the included holster does double duty as a belt clip or hands-free kickstand. The Defender Series works hard and plays harder with a rugged and refined design that's ready for anything."},{"asin":"B00Z7S2YQ8","title":"OtterBox iPhone SE 3rd & 2nd Gen, iPhone 8 & iPhone 7 (not compatible with Plus sized models) Commuter Series Case - INDIGO WAY, slim & tough, pocket-friendly, with port protection","price":"$17.99","saving":"-55%","rating":"4.6","reviews":"6,371 ratings","image":"https://m.media-amazon.com/images/I/71LLuPJpJ7L.__AC_SY300_SX300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Commuter Series is the compact case that keeps your phone safe while you live life on the go. Its two tough layers come together to protect your iPhone SE (2nd Gen - 2020) & iPhone 8/7 (NOT PLUS) against drops, bumps, dust and fumbles. Slip Commuter Series into your pocket and never miss a call, tweet or text."},{"asin":"B07XQX9GN6","title":"OtterBox SYMMETRY CLEAR SERIES Case for iPad 7th, 8th & 9th Gen (10.2&quot; Display - 2019, 2020 & 2021 version) - CLEAR","price":"$59.96","saving":"-25%","rating":"4.6","reviews":"1,411 ratings","image":"https://m.media-amazon.com/images/I/41-JGNCvdVL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Ultra-protective Symmetry Series Clear is the light and thin iPad (7th, 8th & 9th gen) case that goes on easily to guard against drops and scratches. The spine removes to accommodate a Smart Keyboard or Smart Cover and the clear case displays asset tags. There's even a holder for your Apple Pencil."},{"asin":"B0CC6P2R67","title":"Pelican Protector Series - iPhone 15 Pro Max Case 6.7&quot; [Compatible with MagSafe] Magnetic Phone Case with Anti-Scratch Tech [16ft MIL-Grade Drop Protection] Rugged Cover for iPhone 15 Pro Max - Carbon","price":"$49.99","saving":"","rating":"4.1","reviews":"1,188 ratings","image":"https://m.media-amazon.com/images/I/71gKMywIE2L.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"The Pelican Protector Series case for the iPhone 15 Pro Max is created with technology once reserved for first responders and extreme enthusiasts around the globe. This protective case is attentively engineered with a rigid, impact-resistant outer shell, combined with a shock-absorbing rubber lining, that defends your iPhone from any drops of up to 16ft. It survives MIL-STD 810G multiple drops while anti-scratch tech keeps it looking newer for longer. They are made of standard certified sustainable recycled materials, contributing to a positive change in the environment. The built-in powerful magnet syncs seamlessly with all MagSafe chargers and accessories, without influencing any type of phone signals. Precise laser cut-outs fit flawlessly with your phone, allowing full access to your phone functions.Pelican iPhone 15 Pro Max Case Features:16ft Military-Grade Drop ProtectionCompatible with MagSafeCertified Recycled MaterialsMulti-Layer DefensePrecise Cut-OutsAnti-Scratch CoatingRaised Edges for Camera and Screen ProtectionNon-Slip EdgesImpact Absorbing RidgesLifetime WarrantyWho are we: At Pelican we have gained prestige among our buyers by protecting what matters the most and we are now a leading supplier of rugged cases. We always strive to create products with the latest tech, premium materials, and extreme standards.We have a collection of defensive cases, waterproof cases, and screen protectors for the recent flagship like the iPhone 15 Pro Max, iPhone 15 Pro, iPhone 15 Plus, iPhone 15, S23 Series, Pixel 7 Pro, iPad, AirPods, and more."},{"asin":"B08GY7NPYN","title":"ProCase Smart Case for iPad Air 5th Generation 2022 / iPad Air 4th 2020 10.9”, Slim Stand Hard Back Protective Cover for iPad Air 5 A2589 A2591 A2588/ Air 4 A2316 A2324 -Navy","price":"$15.99","saving":"-11%","rating":"4.5","reviews":"36,308 ratings","image":"https://m.media-amazon.com/images/I/7183TFbNKxL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"Only 3 left in stock - order soon.","tag":"Amazon's  Choice","description":"About this item                   🚀 Protective Case for iPad Air 10.9 5th Generation 2022 released (model number: A2589 A2591 A2588) / iPad Air 4th Generation 2020 released tablet (Model number: A2316 A2324 A2325 A2072), Not compatible with any other devices. Please check the back bottom of your iPad to find the model number     🚀 Lightweight hard back design adds minimal bulk while offering your device great protection against accidental drops and bumps     🚀 Translucent frosted back cover allows you to see the Apple icon through your favorite color and protect your device against fingerprints and scratches in the mean time     🚀 Classic and professional design; Full access to all features (Cameras, Speaker, Ports and Buttons), but NOT support Smart Keyboard in this case     🚀 Support 2nd Gen Apple Pencil Charging and Attachment feature; Support auto Sleep/Wake feature; Magnet secures the case closure, easy snap on and off"},{"asin":"B09CBZJ72R","title":"Speck iPhone 13 Case - Drop Protection & Scratch Resistant for iPhone 13 Cases - Dual Layer Case, Slim Design Case for iPhone 13 - Black, Slate Grey CandyShell Pro","price":"$18.13","saving":"","rating":"4.4","reviews":"1,168 ratings","image":"https://m.media-amazon.com/images/I/51SkC3Xnp9L.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"CandyShell Pro's slim dual-layer construction has been tested for drop protection up to 8 feet. This hard phone case with a scratch-resistant, soft touch finish has a patented, two-layer design to absorb and disperse shock on impact. A raised bezel helps to protect your screen from scratching and shattering if your phone falls face-down. This latest CandyShell Pro features a scratch-resistant, soft touch finish. Featuring Microban antimicrobial protection with a 99% reduction in bacteria on the case for a cleaner surface. Plus, this case allows for wireless charging."},{"asin":"B09CBXGX3B","title":"Speck IPhone 13 Clear Case - Drop Protection, Scratch Resistant IPhone 13 Case with Anti-Yellowing & Anti-Fade Slim, Dual Layer Design for 6.1 Inch Phones - Wireless Charging Compatible - GemShell","price":"$21.44","saving":"-14%","rating":"4.6","reviews":"2,138 ratings","image":"https://m.media-amazon.com/images/I/61+WjX1JxBL._AC_SY300_SX300_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"GemShell is a slim and protective clear phone case that adds confidence-inducing protection in a sleek and minimalist design. Not only is this case stylish, but it’s strong as nails. It’s been tested to meet MIL-SPEC drop standards, so you’ll be confident knowing your phone will be protected no matter what life throws at you. GemShell also has an antimicrobial treatment from Microban that provides lifetime product protection from stain and odor causing bacteria growth. If that wasn’t enough, there’s also a raised bezel that helps protect your screen from scratching and shattering if-and-or-when your phone falls and lands face-down."},{"asin":"B08X2X6D5Z","title":"Speck Products Balance Folio Case iPad Air (2022)/(2020)| iPad Pro 11-in. (2nd Generation)| iPad Pro 11-inch (2021), Black/Black","price":"$39.62","saving":"-21%","rating":"4.6","reviews":"479 ratings","image":"https://m.media-amazon.com/images/I/512XVit4gRS.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Balance FOLIO has been tested to withstand drops up to 4 feet. A raised bezel protects your iPad’s screen during a drop, while the recessed cover keeps the case feeling slim. Balance FOLIO has a soft edge-to-edge liner that guards your iPad Pro against scratches. Also, the case turns into a convenient stand for typing or viewing and is fully compatible with Apple Pencil® charging. Featuring Microban for invisible cleanliness."},{"asin":"B07HQYL81B","title":"Speck Products Compatible Case for Apple iPad 9.7&quot; (2017/2018, also fits 9.7&quot; iPad Pro/Air 2/Air), Balance FOLIO Case/Stand, Stormy Grey/Charcoal Grey","price":"$18.26","saving":"-54%","rating":"4.5","reviews":"1,082 ratings","image":"https://m.media-amazon.com/images/I/51vXUCmGVoL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"All-around protection never looked so good. Balance FOLIO’s superior slim design looks great and protects your 9.7-inch iPad from drops up to 4 feet. The case’s hardshell perimeter protects against drops, while the soft liner guards against scratches. The hardshell creates a raised edge around the screen, offering added protection from drops and other damage. Balance FOLIO’s cover recesses into the case, creating a slim profile that doesn’t sacrifice protection. Magnets built into the cover automatically activate and sleep the screen when you open or close it. Plus, a secure clasp keeps the cover closed when you’re not using your 9.7-inch iPad. Balance FOLIO is made from durable, easy-to-clean polyurethane materials that resist heavy abrasions so the case stays looking great through years of use. An adjustable stand offers multiple viewing and typing angles, so you can binge on your favorite shows or get work done. Like all of our products, this 9.7-inch iPad case has been lab-tested against extreme temperatures, cracks, chemicals, and abrasions. Balance FOLIO fits the 9.7-inch iPad (2018 and 2017 models), iPad Pro 9.7-inch, iPad Air, and iPad Air 2."},{"asin":"B0B1PH3JLZ","title":"Spigen for iPhone 14 Pro Case, [Anti-Yellowing Technology] [Compatible with MagSafe] [Military Grade Drop Protection] Ultra Hybrid (MagFit) Phone Case for iPhone 14 Pro - White","price":"$23.99","saving":"-47%","rating":"4.6","reviews":"3,534 ratings","image":"https://m.media-amazon.com/images/I/71QCM+cMxkL._AC_SY300_SX300_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"About this item                   Magnet integrated clear PC back case - Compatible with MagSafe     Raised lip to protects screen and camera     Tactile buttons for solid feedback and an easy press     Air Cushion Technology for shock absorption     iPhone 14 Pro Case Compatible with iPhone 14 Pro"},{"asin":"B0C5S6THJ5","title":"Spigen Magnetic Mag Armor MagFit Designed for iPhone 15 Pro Case, [Military-Grade Protection] Compatible with MagSafe (2023) - Matte Black","price":"$19.99","saving":"-56%","rating":"4.6","reviews":"514 ratings","image":"https://m.media-amazon.com/images/I/71jn8hx8gUL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"About this item                   Magnet integrated shock absorption TPU case - Compatible with MagSafe     Raised lip to protects screen and camera     Tactile buttons for solid feedback and an easy press     Air Cushion Technology for shock absorption     iPhone 15 Pro (2023) Case Compatible with iPhone 15 Pro (2023)"},{"asin":"B0CB78D95C","title":"Spigen Magnetic Ultra Hybrid MagFit Designed for iPhone 15 Pro Case, [Anti-Yellowing] [Military-Grade Protection] Compatible with MagSafe (2023) - Zero One White","price":"$20.99","saving":"-62%","rating":"4.6","reviews":"2,880 ratings","image":"https://m.media-amazon.com/images/I/71SZXYvpokL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"About this item                   Magnet integrated clear PC back case - Compatible with MagSafe     Raised lip to protects screen and camera     Tactile buttons for solid feedback and an easy press     Air Cushion Technology for shock absorption     iPhone 15 Pro (2023) Case Compatible with iPhone 15 Pro (2023)"},{"asin":"B096HBY1YB","title":"Spigen Slim Armor CS Designed for iPhone 13 Pro Case (2021) - Black","price":"$17.99","saving":"-55%","rating":"4.3","reviews":"2,960 ratings","image":"https://m.media-amazon.com/images/I/51qjmN+SM7L._AC_SY300_SX300_.jpg","availability":"Usually ships within 2 to 3 weeks","tag":"","description":"About this item                   Absolute Protection = Dual Layers + Air Cushion Technology     Exterior card slot holds up to 2 cards     Shock-absorbing TPU interior + polycarbonate exterior     Not compatible with Wireless Charging     iPhone 13 Pro Case Compatible with iPhone 13 Pro (2021)"}]},{"name":"iPhone, iPad & MacBook Chargers","url":"iphone-ipad-amp-macbook-chargers","dontInclude":[""],"keyword":["charger","charging"],"category":"apple-devices-amp-accessories","description":"Get the best suited charger for any of your Apple devices.","content":[]},{"name":"Other Accessories","url":"other-accessories","dontInclude":[""],"keyword":[""],"category":"apple-devices-amp-accessories","description":"Enhance your Apple product with the best accessories available.","content":[{"asin":"B0B9BTXHSM","title":"8Bitdo Ultimate 2.4g Wireless Controller With Charging Dock, 2.4g Controller for PC, Android, Steam Deck & iPhone, iPad, macOS and Apple TV (Pastel Pink)","price":"$49.99","saving":"-16%","rating":"4.4","reviews":"1,475 ratings","image":"https://m.media-amazon.com/images/I/31b5yBFRROL._SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Compatible with Windows & Android & Raspberry Pi."},{"asin":"B0835L6DJ9","title":"8K HDMI Cable 6ft Keymox HDMI 2.1 Cable, 48Gbps Ultra HD High Speed, Support 4K@120Hz & 8K@60Hz, Dynamic HDR,eARC/Ethernet, Compatible with Apple TV,Nintendo Switch,Roku,Xbox Series X/S,PS5,Blu-ray","price":"$9.23","saving":"","rating":"4.6","reviews":"1,704 ratings","image":"https://m.media-amazon.com/images/I/31o2fPxjgeL._SY445_SX342_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Keymox 8K HDMI 2. 1 Cable Color Black Size 6 Feet Style 1-Pack KEYMOX High Speed 8K HDMI Cable is compatible with all devices having a HDMI Port(Type A): Home entertainment: Fire TV, Apple TV, 8K TV, TV-Boxes, Computers, Laptops, Blu-ray Players, AV Receivers, DVRs, Media Streamers, HDMI Switcher, HDMI Splitter Gaming devices: Xbox 360, Xbox One, PlayStation 3, PlayStation 4, Nintendo Wii U, Nintendo Switch.Display devices: 8K@60Hz, 4K@120Hz, 4K/HD TVs, Computer Monitors, Projectors. High-Definition Video and Audio: This 8K HDMI cable utilizes the latest HDMI standards that supports bandwidth up to 48Gbps to achieve the highest transmission rate, capable of 8K Ultra-HD resolutions. The cable also features very low EMI emission and is backwards compatible with earlier versions of the HDMI Specification and can be used with existing HDMI devices. Dynamic HDR support ensures every moment of a video is displayed at its optimal values for depth, detail, brightness, contrast and wider color gamuts—on a scene-by-scene or even a frame-by-frame basis. eARC simplifies connectivity, provides greater ease of use, and supports the most advanced audio formats and highest audio quality. It ensures full compatibility between audio devices and upcoming HDMI 2. 1 products. Enhanced refresh rate features ensure an added level of smooth and seamless motion and transitions for gaming, movies and video. They include: Variable Refresh Rate (VRR) reduces or eliminates lag, stutter and frame tearing for more fluid and better detailed game play. Notice: This 8K HDMI cable only supports HDMI Type A standard interface ."},{"asin":"B07M9YVQ3M","title":"[2-Pack] Julk 44mm Case for Apple Watch Series 6 / SE/Series 5 / Series 4 Screen Protector, Overall Protective Case TPU HD Ultra-Thin Cover (1 Rose Pink+1 Transparent)","price":"$10.12","saving":"-8%","rating":"4.3","reviews":"171,121 ratings","image":"https://m.media-amazon.com/images/I/71fuPvvhc3L.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"About this item                   Notice: This case fits for new SE 44mm (2022) & series 6/SE 44mm (2020) & series 5 44mm & series 4 44mm.     Kindly remind: Using this product at gym or sports activities may cause the moisture (from perspiration) to be trapped between this product and the watch screen. This is due to the nature of the product as it does not stick to the screen. When there are fog between the case and the screen, please clean the water mist as shown.     What you get: 1 x HD transparent + 1 x rose gold case with screen protector for watch series 6/SE/5/4 44mm.     This case with screen protector is designed to offer external surface protection to your watch 44mm. Soft clear Case with built-in screen protector prevents your watch from dust, fingerprints and scratches.     Special Design: Made from premium TPU material, overall protective case for watch screen as well as the edges and side of the watch, Perfect fit for watch series 6 & SE & series 5 & series 4 44mm."},{"asin":"B08QVH7SMP","title":"Barkan Universal and Adjustable Streaming Device Mount, Wall or TV Connection, Safety Strap Included, Very Easy Assembly, 5 Year Warranty, Compatible - Apple TV, Roku, Amazon Fire TV, Cable Box, black","price":"$19.74","saving":"","rating":"4.1","reviews":"573 ratings","image":"https://m.media-amazon.com/images/I/51iLVfAJehL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"About this item                   ► STREAMING DEVICE MOUNT - Can be connected to: 1. TV mount with 2 included adaptors (for 200mm back screen holes). 2. TV Back holes - 1 or 2 connection points. 3. Wall with screws. 4. Tabletop positioning.     ► SAFETY STRAP - Safety strap included for mounting wide media devices or cable Boxes. Holds devices up to 13.2 lbs with wall/ tabletop connection. Holds devices up to 7.7 lbs with TV connection.     ► SELF, EASY AND FAST ASSEMBLY - Assembled easily and creates a clean look for the TV area. Telescopic adjustment allows opening range of 0-2.35\", and up to 3.15\" when using the safety strap.     ► VERSATILE - Suitable for all Barkan mounts and most other TV mounts brands in the market     ► WORLD KNOWN BRAND - Since its foundation in 1988, Barkan Mounts has been working to enhance the viewing experience of the customer. Our expertise is in the development, manufacturing and marketing of designed and innovative TV Mounts. Our customer service experts are available every day of the week, and are ready to help! Visit our website to find more information, any kind of help, manuals, FAQ and more.       \n                    ›  See more product details"},{"asin":"B0BY8W7JXR","title":"Batianda Case for M2 MacBook Air 13.6 inch 2022 2023 2024 Release A2681 Model,Honeycomb Heavy Duty Protective Hard Shell with TPU Bumper and Fold Kickstand & Keyboard Cover Screen Protector, Rose","price":"$31.99","saving":"","rating":"4.5","reviews":"525 ratings","image":"https://m.media-amazon.com/images/I/71F1MXWQ-uL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Note: different models correspond to different case,please check the model number on the bottom of your laptop carefully  Case Only Compatible with New MacBook Air 13.6 inch with M2 Chip 2022 2023 2024 release Model Number: A2681  Attention:Case NOT Compatible with - Previous macbook Air 13-inch M1 chip 2020 2021 and MacBook Air 13 2019 2018 release - 2010- 2017 Old MacBook Air 13.3 inch (it's bigger than the new macbook air)  Package including:1× heavy duty hard case + 1×matching Keyboard cover + 1×screen protector +1×set little port plugs  Note: Regarding color, there will be slight color difference between different monitors  Batianda Case Features Engineered shock-absorbent beveled ridges design bumper heavy duty hard shell, provides ultimate protection for your laptop against accidental scuffs, drops, and scratches. Fully vented for safe heat disbursement, fully access to all buttons and features. Totally removable, easy to put on and take off. The built-in foldable kickstands provide an ergonomic typing angle, also give you a better visual experience. Two pieces of folio design, easily clips to your laptop with upper and bottom cover."},{"asin":"B09MT88Q4G","title":"Belkin Apple Watch Charger - Fast Wireless Charging Pad - Travel Charger with Nightstand Mode W/USB-C Cable Included for Apple Watch (Compatible with All Models) - Black","price":"$47.99","saving":"-20%","rating":"4.5","reviews":"499 ratings","image":"https://m.media-amazon.com/images/I/51bYxZPtDkL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"The Belkin BoostCharge Pro wireless Apple Watch MagSafe charging pad is the perfect way to keep your Apple watch charged and ready to go. It’s compact enough to throw in your bag and take with you anywhere you go. MagSafe technology is compatible with Apple Watch Series 1, Series 2, Series 3, Series 4, Series 5, Series 6, and Series 7. This wireless charging pad ensures a secure and stable connection for your Apple Watch. Choose the way it displays and charges your Apple Watch while laying flat or in Nightstand Mode. With wireless fast charging, you can refuel your Apple Watch from 0% to 80% in 45 minutes (Series 7 Model only), so you can get back to using your devices in no time. The Belkin BoostCharge Pro wireless MagSafe charging pad supports all Apple Watch models, just place your Apple Watch on the charging pad for a secure, aligned connection. With this compact Belkin magnetic wireless charger pad, you'll always have a convenient place to charge your Apple Watch. Its modern minimalist design complements any environment from your living room to the nightstand of a hotel room. Note: A power adapter is not included. 20W USB-C Wall charger recommended."},{"asin":"B0B5XWJW36","title":"Belkin MagSafe 3-in-1 Wireless Charging Stand - 2ND GEN w/ 33% Faster for Apple Watch - iPhone 15, 14 & 13 Series, & AirPods -Charging Station for Multiple Devices - Black","price":"$115.95","saving":"-23%","rating":"4.5","reviews":"7,479 ratings","image":"https://m.media-amazon.com/images/I/51e3Cc-kqCL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"The Belkin MagSafe 3-in-1 Wireless Charging Stand is the perfect way to keep your devices charged and ready to go. With three charging modules, this iPhone charger can wirelessly charge your phone, Apple Watch, and AirPods all at the same time.MagSafe technology is compatible with Apple iPhone 15, iPhone 14, iPhone 13, and iPhone 12 standard, Mini, Plus, Pro and Pro Max models. This wireless charging station ensures a secure and stable connection for your MagSafe accessories, so you don't have to worry about your devices slipping off the stand. With wireless fast charging you can refuel your iPhone and Apple Watch Series 7 (or newer) from 0% to 80% in 45 minutes, so you can get back to using your devices in no time.The Belkin MagSafe 3-in-1 Wireless Charging Stand supports multiple device orientations, just place your iPhone on the charging stand for a secure, aligned connection in portrait or landscape mode. The wireless charging puck and pad are optimized for your Apple Watch, AirPods and AirPods Pro. With this Belkin Magnetic Wireless Charger Stand, you'll always have a convenient place to charge your iPhone."},{"asin":"B0725DW6D3","title":"Belkin Thunderbolt 3 Cable (USB-C to USB-C) - USB C Cable For MacBook Air, Galaxy, Apple TV & More, Fast Charging Up To 100W, Made For USB-C, Thunderbolt 3 devices & 5K/Ultra HD - 1.6ft/0.5m - Black","price":"$29.00","saving":"","rating":"4.6","reviews":"698 ratings","image":"https://m.media-amazon.com/images/I/51oihESeXQL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Thunderbolt, famed for superfast speeds, high definition capability, and huge power output, has had an upgrade. Transferring data between Thunderbolt 3 devices at up to a staggering 40Gbps, this cable is ideal for large volume data and Ultra HD displays. It also supports power delivery up to 100 Watts, and can daisy chain up to six Thunderbolt 3 devices. Get the most from all your Thunderbolt 3 peripherals with the ultimate smart, high-speed cable.High volume data capability makes the Thunderbolt 3 Cable 40Gbps ideal for high-definition video. Thunderbolt supports sharing content between 5K and Ultra HD displays, without compromising quality. The Thunderbolt 3 Cable supplies up to 100W of power delivery for Thunderbolt 3 and USB-C devices.The 1.6ft Thunderbolt 3 cable is a compact solution ideal for connecting Thunderbolt peripherals such as docks and hard drives and fits seamlessly to any desk environment. Tested for durability and sustained functionality, the result is a fully Thunderbolt 3-compatible cable with the quality you expect from Belkin.At A Glance:Thunderbolt 3 male to Thunderbolt 3 maleTransfer data up to 40GbpsUp to 100W of power deliverySupports Thunderbolt/Ultra HD DisplaysThunderbolt certified 1.6-ft / 0.5m length"},{"asin":"B086SV2FK4","title":"Belkin USB-C to Ethernet + Charge Adapter - Gigabit Ethernet Port Compatible with USB-C Devices - USB-C to Ethernet Cable for MacBook Air, MacBook Pro & Windows - Ethernet to USB-C Adapter - Black","price":"$28.99","saving":"-17%","rating":"4.4","reviews":"3,031 ratings","image":"https://m.media-amazon.com/images/I/61kQksV0CmL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Connect to the internet with confidence while charging your laptop for the office, home, or classroom. This Belkin USB to Ethernet adapter provides convenient access to fast and reliable Internet connection through a gigabit Ethernet port and allows for USB Power Delivery at the same time. It's a plug and play adapter that works universally with Mac and Windows laptops and other USB-C devices. Connect and stay powered while surfing the Internet or transferring data using this ethernet USB-C Hub. Pass through Power Delivery of up to 60W allows you to stay charged while you work using a single USB-C port and the included cable supports network speeds up to 1000 Mbps. This USB-C Docking Station works with iPad mini 6th Gen, Mac mini M1 (2020), MacBook Air 13\" M1 (2020), and MacBook Pro 13\" M1 (2020). You can be assured it’s an adapter that’ll work seamlessly with your laptop. Package Includes: USB-C to Ethernet + Charge Adapter Specs: Width: 41mm / 1.6” Height: 14mm / 0.55” Length without cable: 40mm / 1.57” Cable Length: 130mm / 5.1”"},{"asin":"B07KMWY9YW","title":"elkson Compatible with Apple Watch 44mm Bumper Case, Quattro Series Rugged Case for Apple Watch SE 2 and iWatch Series 6 5 4, Military Grade Durable Protective Cover, Flexible Shock Proof, White","price":"$10.99","saving":"","rating":"4.3","reviews":"999 ratings","image":"https://m.media-amazon.com/images/I/51mIrn9nEtL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"Only 2 left in stock - order soon.","tag":"","description":"About this item                   Shockproof Design - Designed to protect Apple Watch Series SE2 6 SE 5 4 44mm from bumping and dropping. A raised edge guard protects the watch face. 8 ft drop tested iwatch bands.     Premium Material - Made with scratch-resistant TPU for long-lasting durability. Easy to install and remove. Soft, breathable, and lightweight, good for any activities. The inside material won't scratch your Apple Watch.     Precise Cutouts - All cutouts are precisely made to work smoothly with the buttons and watch crown. It fits snugly and doesn't add any bulkiness.     Accessory Friendly - Work with most Apple Watch screen protectors and chargers. Please kindly note there is no screen protector included.     Exclusively designed watch faces are free to download. Elkson Inc. is the lawful owner of this design patent."},{"asin":"B097H3QMHY","title":"Fullmosa No Tools Needed Compatible Apple Watch Band 49/45/41/44/40/42/38mm,Metal Band with Case for iWatch Series 9/8/7/6/5/4/3/2/1/SE2/SE/Ultra/Ultra2,45mm 44mm 42mm Black","price":"$26.99","saving":"","rating":"4.4","reviews":"1,858 ratings","image":"https://m.media-amazon.com/images/I/61cnmQtf71L.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"Only 13 left in stock - order soon.","tag":"","description":"[Tool-free Length Adjustment]: Fullmosa Apple watch band features 4 removable links on each side that can be easily attached or detached by hand, allowing you to adjust the perfect length for your wrist size without any tools. The apple watch metal band is suitable for wrist sizes ranging from 5.51\"-7.87\".     [Hypoallergenic High-Quality Materials] The Fullmosa Apple watch band is made from 304 stainless steel, ensuring that it is safe and comfortable to wear without any concerns about skin allergies or irritations. The band's inherent metal properties make it resistant to water, rust, and sweat.     [Security Design] The iWatch band features built-in connectors that protect your iWatch from accidental falling. The adapters have been designed and tested to ensure flawless compatibility with Apple watches, while the fold-over push-button deployant clasp adds an extra layer of security.     [Slim Apple Watch Band for Men Women] Unlike most women's iWatch bands on the market, our watch bands feature integrated adapters that are tapered slim from both connectors toward the buckle, making it look more flattering on both men and women. It is not only gorgeous but also very comfortable to wear.     [What You Get]: 1*Compatible with iWatch band, 1*Product Manual, 1*Quality Control Card, 1*a TPU Case(The casing and strap materials may exhibit slight color variations due to their inherent differences)."},{"asin":"B088XVMNBR","title":"GE 6-Device Backlit Universal Remote Control for Samsung, Vizio, Lg, Sony, Sharp, Roku, Apple TV, Smart TVs, Streaming Players, Blu-Ray, DVD, Master Volume Control, Graphite, 47507","price":"$10.91","saving":"","rating":"4.2","reviews":"712 ratings","image":"https://m.media-amazon.com/images/I/71sPyrXg-8L.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Consolidate control with the GE 6-Device, Backlit Universal Remote in a sleek, brushed graphite finish. No need to worry about keeping track of multiple controllers this remote can operate up to six devices, including your TV, Blu-ray/DVD player, streaming media player, cable, satellite, sound bar and more. Eliminate the hassle of managing multiple remotes as you take charge of your home entertainment system. Preprogrammed for immediate use with Samsung TVs and Roku boxes, this remote offers simple, user friendly setup with your choice of automatic code search or direct code entry. The master volume control feature allows you to adjust the audio regardless of which device is selected. Full backlighting with blue LEDs gives you enhanced visibility when operating your remote in low-light settings. For added convenience, this remote includes a Blu-ray/DVD player open/close button as well as advanced DVR functions, simple menu navigation and a dot button for sub-channel access. Organize your entertainment with this GE 6-Device, Backlit Universal Remote."},{"asin":"B088X6NBCK","title":"GE 6-Device Backlit Universal Remote Control for Samsung, Vizio, Lg, Sony, Sharp, Roku, Apple TV, Smart TVs, Streaming Players, Blu-Ray, DVD, Master Volume Control, Rose, 47505","price":"$8.86","saving":"-10%","rating":"4.3","reviews":"9,611 ratings","image":"https://m.media-amazon.com/images/I/81GkxZI6e7L.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Consolidate control with the GE 6-Device, Backlit Universal Remote in a sleek, brushed rose gold finish. No need to worry about keeping track of multiple controllers this remote can operate up to six devices, including your TV, Blu-ray/DVD player, streaming media player, cable, satellite, sound bar and more. Eliminate the hassle of managing multiple remotes as you take charge of your home entertainment system. Preprogrammed for immediate use with Samsung TVs and Roku boxes, this remote offers simple, user friendly setup with your choice of automatic code search or direct code entry. The master volume control feature allows you to adjust the audio regardless of which device is selected. Full backlighting with blue LEDs gives you enhanced visibility when operating your remote in low-light settings. For added convenience, this remote includes a Blu-ray/DVD player open/close button as well as advanced DVR functions, simple menu navigation and a dot button for sub-channel access. Organize your entertainment with this GE 6-Device, Backlit Universal Remote."},{"asin":"B006SRUNXS","title":"Kantek Tablet Stand for Apple iPad, iPad Air, iPad Mini, Galaxy Tab (7-Inch or 9.7-Inch), Kindle Fire (7-Inch or HD 6) and most other 6 to 7-Inch or 9.7-Inch Tablets (TS710)","price":"$36.11","saving":"-33%","rating":"4.5","reviews":"1,309 ratings","image":"https://m.media-amazon.com/images/I/71h04We+gGL._AC_SY300_SX300_.jpg","availability":"In Stock","tag":"","description":"Founded in 1982, Kantek has set the standard for personal customer service, superior design and construction, a high degree of flexibility and responsiveness to the marketplace. The Kantek Tablet Stand positions your tablet for easy, hands-free desktop use. You can rotate, angle, and swivel your tablet for optimum viewing in either landscape or portrait position. The stand's weighted swivel base provides excellent security and stability. Its spring bracket adjusts from 6.18 to 7.48-inches to accommodate Apple iPad, iPad Air, iPad Pro (All 9.7-Inch, 10.5-Inch, and 11-Inch Sizes), iPad Mini (1, 2, and 3), Kindle Fire 7-Inch (Kindle Fire, HDX7, HD 7), Samsung Galaxy Tab (S, S2, S3), and Galaxy Pro S, which are easy to attach and remove."},{"asin":"B0BY395PWX","title":"Lenovo Yoga Laptop Sleeve 14 Inch Notebook/Tablet Compatible with MacBook Air/Pro - Slim Eco-Friendly Lightweight Case with Accessory Pocket & Magnetic Closure - Grey","price":"$25.37","saving":"","rating":"4.4","reviews":"472 ratings","image":"https://m.media-amazon.com/images/I/61IQRDx2P9L.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"Made from PET recycled materials, the sleeve not only provides a perfect fit but also takes us one step closer to our environmental aspirations. Sporting a dedicated laptop compartment and accessory pockets sealed by a magnetic flap to keep your devices and accessories safe."},{"asin":"B07B52FVHW","title":"Londo Top Grain Leather Macbook Bag Laptop Sleeve for MacBook Pro and MacBook Air Case - 14 Inch - 13 Inch (M2, M2 Pro, M2 Max, M1) - 13.3 Inch - iPad Pro 12.9 Inch - 2020 2021, 2022 and 2023 Models","price":"$39.32","saving":"-21%","rating":"4.8","reviews":"1,365 ratings","image":"https://m.media-amazon.com/images/I/91p30WR2anL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"About this item                   EXQUISITE LEATHER CRAFTSMANSHIP – The Londo Genuine Leather Macbook Bag is crafted with high quality, genuine cowhide leather attached with fine and durable stitching, giving it a sleek look and a slim body. An exemplary model of artisanal craft combining the pleasant feel and the handsome look of leather without sacrificing versatility and convenience.     MODELS – The Londo Genuine Leather 14-inch MacBook bags are made to fit the MacBook Pro and MacBook Air 14 Inch - 13.3 Inch (M2 Pro, M2 Max, M1 Pro, M1 Max, M2 & M1) - 13 Inch - iPad Pro 12.9 Inch (Compatible with M1, M2 Pro & Max 2020 2021, 2022, 2023 and M2 Pro 13.3 Models), screen size MacBooks, laptops, ultrabooks, or tablets. The bag can also accommodate additional small items such as a notebook note that adapters do not fit inside the bag.     PRACTICAL – The Londo MacBook 16 inch and MacBook 14 inch genuine leather laptop bags have padded slim, minimalist design and can be used as a laptop sleeve or a laptop case and, can be carried by itself or within another computer bag. It has quick top-loading access.     DURABLE – The Londo Genuine Leather Macbook Bag is made from durable materials and manufactured with durable and strong stitching to ensure that it has a long lasting life.     STYLISH – The Londo MacBook 16 inch and MacBook 14 inch genuine leather laptop bags come in three varieties. Blue drop and colorful mosaic patterns are woven jacquard linen polyester, the ethnic brown variety is woven linen. Choose a style that best fits your personality."},{"asin":"B07B5182F1","title":"Londo Top Grain Leather Macbook Bag Laptop Sleeve for MacBook Pro and MacBook Air Case - 16 Inch - 15 Inch - 15.5 Inch (M2, M2 Pro, M2 Max, M1) 2020 2021, 2022 and 2023 Models","price":"$43.75","saving":"-20%","rating":"4.8","reviews":"1,365 ratings","image":"https://m.media-amazon.com/images/I/81HYakv5mzL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"Only 20 left in stock (more on the way).","tag":"","description":"About this item                   EXQUISITE LEATHER CRAFTSMANSHIP – The Londo Genuine Leather Macbook Bag is crafted with high quality, genuine cowhide leather attached with fine and durable stitching, giving it a sleek look and a slim body. An exemplary model of artisanal craft combining the pleasant feel and the handsome look of leather without sacrificing versatility and convenience.     MODELS – The Londo Genuine Leather 16-inch MacBook bags are made to fit the MacBook Pro and MacBook Air 15 Inch - 15.5 Inch - 16 Inch (Compatible with M1, M2 Pro & M2 Max 2020 2021, 2022, 2023), screen size MacBooks, laptops, ultrabooks, or tablets. The bag can also accommodate additional small items such as a notebook note that adapters do not fit inside the bag.     PRACTICAL – The Londo MacBook 16 inch and MacBook 14 inch genuine leather laptop bags have padded slim, minimalist design and can be used as a laptop sleeve or a laptop case and, can be carried by itself or within another computer bag. It has quick top-loading access.     DURABLE – The Londo Genuine Leather Macbook Bag is made from durable materials and manufactured with durable and strong stitching to ensure that it has a long lasting life.     STYLISH – The Londo MacBook 16 inch and MacBook 14 inch genuine leather laptop bags come in three varieties. Blue drop and colorful mosaic patterns are woven jacquard linen polyester, the ethnic brown variety is woven linen. Choose a style that best fits your personality."},{"asin":"B09C2M3CG7","title":"OtterBox All Day Case for Apple Watch Series 4/5/6/SE 44mm - Pavement (Black/Grey)","price":"$19.99","saving":"-20%","rating":"4.5","reviews":"1,311 ratings","image":"https://m.media-amazon.com/images/I/61KEp8fG5qL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Streamlined for a precision fit, OtterBox case transforms how you work out, connect and play by adding just the right amount of protection for your Apple Watch display. Meet movement goals, never miss a call or text and max out every activity without worrying about cracking your Apple Watch display. OtterBox Case’s smooth bumper blocks impact force and precisely covers edges and crown to protect against bumps, slams and scrapes. Your ultimate partner now has the fundamental protection you demand for every connection and activity."},{"asin":"B09R5P82HG","title":"OtterBox All Day Case for Apple Watch Series 7/8/9 (45mm) - Pavement (Black)","price":"$20.08","saving":"-20%","rating":"4.4","reviews":"2,199 ratings","image":"https://m.media-amazon.com/images/I/61G6Kwy7H9L.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Streamlined for a precision fit, OtterBox case transforms how you work out, connect and play by adding just the right amount of protection for your Apple Watch display. Meet movement goals, never miss a call or text and max out every activity without worrying about cracking your Apple Watch display. OtterBox Case’s smooth bumper blocks impact force and precisely covers edges and crown to protect against bumps, slams and scrapes. Your ultimate partner now has the fundamental protection you demand for every connection and activity."},{"asin":"B0CC9JGF5K","title":"OtterBox ECLIPSE CASE for Apple Watch Series 7/8/9 41MM - UPBEAT (Yellow)","price":"$28.65","saving":"-28%","rating":"4.4","reviews":"715 ratings","image":"https://m.media-amazon.com/images/I/51sOWdgfcaL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"The Eclipse Case for Apple Watch integrates a sleek watch bumper with a built-in screen protector that work together to keep your watch pristine. With its precision fit and high-touch sensitivity, you barely notice there’s a case on your watch."},{"asin":"B07XSH8ND1","title":"Philips Universal Companion Remote Control for Samsung, Vizio, LG, Sony, Roku, Apple TV, RCA, Panasonic, Smart TVs, Streaming Players, Blu-ray, DVD, 4 Device, Flip & Slide Fire TV, Black, SRP2024A/27","price":"$17.98","saving":"-18%","rating":"4.1","reviews":"4,533 ratings","image":"https://m.media-amazon.com/images/I/81YVPO4P-YL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"About this item                   INNOVATIVE PATENT PENDING DESIGN –The Flip & Slide Cradle on the back of the remote securely holds compatible Fire TV remotes (sold separately) to keep them nearby and ready to stream your favorite content. Not compatible with the Fire TV Basic remote (1st Gen, 2nd Gen) or the Fire TV Stick remote (1st Gen). Side-access ON/OFF and volume controls, as well as the soft-touch click keys add functionality and style     MULTI DEVICE CONTROL – Operate your Fire TV device and up to 4 different audio and video components such as TVs, Blu-ray/DVD players, cable/satellite receivers, soundbars, other streaming media players and more     BEST REMOTE CODE LIBRARY – This universal remote works with all major brands and supports thousands of the latest audio and video devices     SIMPLE SETUP – Preprogrammed for immediate use with Samsung TVs and Roku boxes, this universal remote provides trouble-free setup with automatic code search, primary audio control to let you adjust the volume level no matter which device is selected and easy-to-follow online videos to walk you through the setup process step by step. Requires 2 AAA batteries (not included)     SATISFACTION GUARANTEED – This universal remote is backed by a limited-lifetime warranty and free U.S.-based technical support. Call the experts at 844-816-0320 with any questions or issues about your purchase"},{"asin":"B0B16PJ31L","title":"Razer Kishi V2 Mobile Gaming Controller for iPhone (Lightning): Console Quality Controls - Universal Fit w/ Extendable Bridge - Stream PC, Xbox, PlayStation Games - Customizable Triggers - Ergonomic","price":"$89.90","saving":"-10%","rating":"4.1","reviews":"1,157 ratings","image":"https://m.media-amazon.com/images/I/411k1Dg22tL._SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Rethink everything you knew about mobile gaming. Razer Kishi v2 is a universal mobile gaming controller that brings a console-class gameplay experience to your iPhone. Play the best AAA games, on your iPhone, exactly as you’d expect to play them on a game console – zero compromises."},{"asin":"B07KLBX1NX","title":"SABRENT USB-C 3.0 Hub, 5-in-1 USB SD Card Reader, SD & TF Dual Slot + 3 USB 3.0 Hub Portable Compatible with MacBook, Mac Pro/Mini, iMac, XPS, Surface Pro, Windows, Thunderbolt (HB-U3CR)","price":"$18.99","saving":"","rating":"4.4","reviews":"4,481 ratings","image":"https://m.media-amazon.com/images/I/81GUMFyIxqL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"About this item                   Transfers your data at up to 5Gbps.     Plug & Play, Hot-Swappable.     Built in All-in-One Card Reader for flash memory cards.     3 USB 3.0 Type‐A ports for data transfer up to 5Gbps.     Card reader support, SD/SDHC, Micro SD (T-Flash)."},{"asin":"B0C4FCK7QY","title":"TOTU USB C Hub, 7 in 1 USB C Dock with 4K HDMI, 2 USB 3.0, USB C 3.0, 100W Type C PD, SD/TF Card Slot for MacBook Pro/Air and Other Type C Laptops","price":"$24.99","saving":"","rating":"4.3","reviews":"943 ratings","image":"https://m.media-amazon.com/images/I/614P2N+oLsL._AC_SY300_SX300_.jpg","availability":"In Stock","tag":"","description":"About this item                   Exceptional Multiport USB C Hub: Experience the convenience of TOTU 7 in 1 USB C dock, offering 1 external video output with 4K@30Hz HDMI, rapid data transfer via 2 USB A 3.0, 1 USB C 3.0 ports, and universal SD/TF card slots. Charge devices quickly with the 100W USB C PD port. Simply plug in your Type C device and play without needing external drivers. This adapter will seamlessly upgrade your laptop, tablet, or smartphone to connect with more peripherals.     Stunning 4K HDMI Output: Experience crystal-clear visuals with the 4K HDMI port, capable of mirroring or extending the display of a Type C device to an HDTV, monitor, or projector at 30Hz. This feature is ideal for those seeking high-definition, dynamic, and lifelike visuals.     Rapid Data Transfer: The USB A 3.0 and USB C 3.0 ports on this laptop docking station boast a transfer speed of 5 Gbps, which is 10 times faster than USB 2.0. Connect your type c phone, tablet, or gaming console with ease and utilize multiple USB A peripheral devices such as flash drives, keyboards, mice, and printers. The universally compatible SD and TF card readers allow for quick data transfer to your laptop while also providing additional storage space.     Powerful 100W Charging: This USB C hub supports a maximum power input of 100W and delivers up to 87W of safe, rapid charging for connected MacBook Pro/Air devices. Simply connect your laptop's power cable to the USB-C PD port. For safety, the USB C adapters include a protection system that guards against overloads and overheating (high temperatures).     Broad Compatibility & Portable: Featuring a compact, pocket-sized design similar to a smartphone, this USB C adapter is perfect for use at home, work, or while traveling. Its durable aluminum alloy construction ensures safe usage. Compatible with MacBook Pro/Air 2022/2021/2020/2019/2018, iMac/iMac Pro, HP Envy 13, Dell XPS 15/XPS 13, and various other devices with a fully functional Type C port."},{"asin":"B0B9DVCB76","title":"ZAGG InvisibleShield Glass XTR2 Screen Protector for iPhone 14 Pro with New Anti-reflective Technology, Anti-dust installation, and Ultra Strong Hexiom Impact Technology","price":"$30.99","saving":"-48%","rating":"4.3","reviews":"770 ratings","image":"https://m.media-amazon.com/images/I/51rTfVn470L.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"The strongest screen protection just got stronger. Glass XTR2 is made with Hexiom impact technology that makes 10% stronger than its predecssor. Revolutionary new anti-reflective technology significantly reduces reflections on your screen while letting more light transmit through the protector for clear, precise images and color quality. ZAGG also added enhanced Eyesafe blue light technology that filters 40% of intense blue light (435-440nm) from your device screen. Glass XTR2 is ideal for gamers with an ultra-smooth, touch-sensitive surface that reduces friction as you move your finger across the surface of the screen. A new, world-first anti-dust adhesive combined with ZAGG's EZ Apply install make installations perfect and dust-free. Every time. Glass XTR2 has a limited lifetime warranty, and sets a new premium standard for screen protection."}]}],"date":"January 15, 2024","count":79,"Ads":[{"asin":"B06X16Z7DZ","title":"Apple EarPods Headphones with 3.5mm Plug, Wired Ear Buds with Built-in Remote to Control Music, Phone Calls, and Volume","price":"$18.79","saving":"","rating":"4.6","reviews":"276,390 ratings","image":"https://m.media-amazon.com/images/I/410eivKV4DL.__AC_SY445_SX342_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"About this item                   SUPERIOR COMFORT — Unlike traditional circular ear buds, the design of EarPods is defined by the geometry of the ear. Which makes them more comfortable for more people than any other ear bud–style headphones.     HIGH-QUALITY AUDIO — The speakers inside EarPods have been engineered to maximize sound output and minimize sound loss, which means you get high-quality audio.     BUILT-IN REMOTE — EarPods with 3.5mm Headphone Plug also include a built-in remote that lets you adjust the volume, control the playback of music and video, and answer or end calls with a pinch of the cord.     COMPATIBILITY — Works with all devices that have a 3.5mm headphone jack.     INTEGRATED MICROPHONE — A built-in microphone precisely captures your voice while you’re on the phone, taking a FaceTime call, or summoning Siri — so you’re always heard loud and clear."},{"asin":"B07M9YVQ3M","title":"[2-Pack] Julk 44mm Case for Apple Watch Series 6 / SE/Series 5 / Series 4 Screen Protector, Overall Protective Case TPU HD Ultra-Thin Cover (1 Rose Pink+1 Transparent)","price":"$10.12","saving":"-8%","rating":"4.3","reviews":"171,121 ratings","image":"https://m.media-amazon.com/images/I/71fuPvvhc3L.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"About this item                   Notice: This case fits for new SE 44mm (2022) & series 6/SE 44mm (2020) & series 5 44mm & series 4 44mm.     Kindly remind: Using this product at gym or sports activities may cause the moisture (from perspiration) to be trapped between this product and the watch screen. This is due to the nature of the product as it does not stick to the screen. When there are fog between the case and the screen, please clean the water mist as shown.     What you get: 1 x HD transparent + 1 x rose gold case with screen protector for watch series 6/SE/5/4 44mm.     This case with screen protector is designed to offer external surface protection to your watch 44mm. Soft clear Case with built-in screen protector prevents your watch from dust, fingerprints and scratches.     Special Design: Made from premium TPU material, overall protective case for watch screen as well as the edges and side of the watch, Perfect fit for watch series 6 & SE & series 5 & series 4 44mm."},{"asin":"B08J5Q255V","title":"Apple 2020 iPad (10.2-inch, Wi-Fi, 32GB) - Silver (8th Generation)","price":"$326.00","saving":"-6%","rating":"4.9","reviews":"64,226 ratings","image":"https://m.media-amazon.com/images/I/71GsWDM8sPL.__AC_SY445_SX342_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"About this item                   Gorgeous 10.2-inch Retina display     A12 Bionic chip with Neural Engine     Support for Apple Pencil (1st generation) and Smart Keyboard     8MP back camera, 1.2MP FaceTime HD front camera     Stereo speakers     802.11ac Wi-Fi and Gigabit-class LTE cellular data     Up to 10 hours of battery life       \n                           Lightning connector for charging and accessories  Touch ID for secure authentication and Apple Pay  iPadOS 14 brings new capabilities designed specifically for iPad      Show more"},{"asin":"B00QWRISTA","title":"JETech Case for iPad Air 2 (2nd Generation), Smart Cover Auto Wake/Sleep (Black)","price":"$9.99","saving":"-38%","rating":"4.5","reviews":"52,015 ratings","image":"https://m.media-amazon.com/images/I/61EsFxX+VsL._AC_SY300_SX300_.jpg","availability":"Only 1 left in stock - order soon.","tag":"","description":"About this item                   (NOTE: NOT compatible with iPad Air 1st Edition, iPad 6th/5th Generation, iPad Pro 9.7); Designed for iPad Air 2 Second Edition with Touch ID technology. Fit iPad Models: A1566/A1567. Please check back bottom of your iPad to find the model number     Made with PU+PC. Slim/light design. Synthetic exterior and smooth interior provide comprehensive protection for your iPad     Magnetic smart cover supports automatic sleep/wake function.The tri-fold front cover can support iPad in two standing position for viewing and typing     Easy access to all the controls and features; Perfect cutouts for speakers, camera and other ports     Package includes: iPad Air 2 case, customer service card"},{"asin":"B07W7F4P63","title":"OtterBox IPhone 11 Commuter Series Case - BESPOKE WAY (BLAZER BLUE/STORMY SEAS BLUE), Slim & Tough, Pocket-Friendly, with Port Protection","price":"$24.95","saving":"-38%","rating":"4.7","reviews":"47,724 ratings","image":"https://m.media-amazon.com/images/I/51xfmD6D3vL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Commuter Series is the compact case that keeps your phone safe while you live life on the go. Its two tough layers come together to protect your iPhone 11 against drops, bumps, dust and fumbles. Slip Commuter Series into your pocket and never miss a call, tweet or text."},{"asin":"B01A6EO0N2","title":"MOSISO Laptop Sleeve Compatible with MacBook Air/Pro, 13-13.3 inch Notebook, Compatible with MacBook Pro 14 inch M3 M2 M1 Chip Pro Max 2023-2021, Neoprene Bag with Small Case, Black","price":"$14.38","saving":"-10%","rating":"4.6","reviews":"44,825 ratings","image":"https://m.media-amazon.com/images/I/6185myKan4L.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"Only 10 left in stock - order soon.","tag":"Amazon's  Choice","description":"About this item                   The big bag internal dimension is: 13.58 x 0.79 x 9.64 inch (L x W x H); external dimension is: 13.97 x 0.79 x 10.04 inch (L x W x H). The additional small pouch bag internal dimension is: 5.71 x 0.59 x 5.12 inch (L x W x H); external dimension is: 6.3 x 0.59 x 5.31 inch (L x W x H).     Features a neoprene foam padding layer and fluffy fleece fabric lining for bump and shock absorption and protection of your computer from accidental scratches.     Additional small storage pouch bag for you to storage laptop mouse and earphone. Same color as the big sleeve bag, harmony and stylish. This protective carrying sleeve case cover bag with small pouch is ideal for you to take your laptop out.     Slim and lightweight; does not bulk your laptop up and can easily slide into your briefcase, backpack or other bag. Top-loading zipper on the sleeve glides smoothly and allows convenient access to your laptop computer.     Compatible with MacBook Pro 14 inch 2023-2021 M3 A2918 A2992 M2 A2779 M1 A2442 Pro Max with Touch ID, compatible with MacBook Air 13 inch A1369 A1466 2010-2017, compatible with MacBook Pro 13 inch A1425 A1502 A1278 2008-2015; Compatible with Surface Book 3/2/1 13.5, compatible with Surface Laptop 4/3/2/1 13.5; Compatible with Dell Latitude 14; Compatible with HP Elitebook 13.3/Spectre X360 13.3/Envy 13/Stream 13/Stream 14/Pavilion 14; compatible with Lenovo IdeaPad 13/14."},{"asin":"B08GY7NPYN","title":"ProCase Smart Case for iPad Air 5th Generation 2022 / iPad Air 4th 2020 10.9”, Slim Stand Hard Back Protective Cover for iPad Air 5 A2589 A2591 A2588/ Air 4 A2316 A2324 -Navy","price":"$15.99","saving":"-11%","rating":"4.5","reviews":"36,308 ratings","image":"https://m.media-amazon.com/images/I/7183TFbNKxL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"Only 3 left in stock - order soon.","tag":"Amazon's  Choice","description":"About this item                   🚀 Protective Case for iPad Air 10.9 5th Generation 2022 released (model number: A2589 A2591 A2588) / iPad Air 4th Generation 2020 released tablet (Model number: A2316 A2324 A2325 A2072), Not compatible with any other devices. Please check the back bottom of your iPad to find the model number     🚀 Lightweight hard back design adds minimal bulk while offering your device great protection against accidental drops and bumps     🚀 Translucent frosted back cover allows you to see the Apple icon through your favorite color and protect your device against fingerprints and scratches in the mean time     🚀 Classic and professional design; Full access to all features (Cameras, Speaker, Ports and Buttons), but NOT support Smart Keyboard in this case     🚀 Support 2nd Gen Apple Pencil Charging and Attachment feature; Support auto Sleep/Wake feature; Magnet secures the case closure, easy snap on and off"},{"asin":"B07175N8XP","title":"JETech Case for iPad Pro 10.5-Inch and iPad Air 3 (10.5-Inch 2019, 3rd Generation), Smart Cover Auto Wake/Sleep Cover (Black)","price":"$14.99","saving":"","rating":"4.5","reviews":"29,235 ratings","image":"https://m.media-amazon.com/images/I/61p-LLxHZsL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"Only 4 left in stock - order soon.","tag":"Amazon's  Choice","description":"Designed for iPad Air 3rd generation 10.5 (2019) and iPad Pro 10.5 (2017). NOT compatible with any other iPad models. Fit iPad Models: A1701/A1709/A2152/A2123/A2153. Please check back bottom of your iPad to find the model number."},{"asin":"B086C8GBBV","title":"ORIbox Case Compatible with iPhone 11 , Heavy Duty Shockproof Anti-Fall Clear","price":"$8.44","saving":"-11%","rating":"4.3","reviews":"19,342 ratings","image":"https://m.media-amazon.com/images/I/81O9IolbBzL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"The picture is for reference only, please check the style and color suitable for your iPhone model.Grab the bottom piece from dust proof plug on charge jack or ring/vibrate button, Pull out the soft cover from the slot on hard bumper, Carefully peel it off, Find the openings on 2 sides, Carefully separate the hard bumper, Insert your phone, Make sure every button right on their position then snap on, Put on the soft layer, Finish off"},{"asin":"B08DY77FYW","title":"OtterBox iPhone 12 & iPhone 12 Pro Defender Series Case - BLACK, rugged & durable, with port protection, includes holster clip kickstand","price":"$34.95","saving":"","rating":"4.7","reviews":"17,767 ratings","image":"https://m.media-amazon.com/images/I/51u38N2cZwL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Worry less while you’re working, adventuring and living when you defend your device against drops, dirt and scrapes. Combining a solid internal shell with a resilient outer slipcover, Defender Series SCREENLESS Case deflects the action and accidents that come your way every day. Plus, the included holster doubles as a kickstand for hands-free viewing. Defender Series SCREENLESS Case — because life happens!Specifications:Compatible With:iPhone 12iPhone 12 ProDrop Height:DROP+ | 4X as many drops as military standard (MIL-STD-810G 516.6)Dimensions:6.38 in x 3.58 in x 1.3 in / 162.05 mm x 90.93 mm x 33.02 mmWeight:0.28 lbs | 127.00 gMaterials:Polycarbonate shellSynthetic rubber slipcoverPolycarbonate holsterCase Features:Updated slimmer design, same rugged protection and drop performanceMulti-layer defense from the solid inner shell and resilient outer slipcoverPort covers prevent dirt, dust and lint from clogging jacks and portsScreenless design provides flawless touch responseHolster works as a belt clip and a hands-free kickstandRaised edges protect camera and screenWorks with 5G, 4G and all other standard networksWorks with Qi wireless charging (We recommned OtterBox Power accessories for best Qi wireless experience)Limited lifetime warranty supported by hassle-free customer service"}]}