{"name":"Home Improvement & Maintenance Devices","url":"home-improvement-amp-maintenance-devices","category":"home-gadgets-amp-appliances","necessary":[""],"description":"Get the best deals on home improvement and maintenance devices, including smart controlling systems, cleaning utensils and more.","keywords":"home maintenance,home improvement,home appliances,home cleaning,home security,smart home","content":[{"name":"Smart Home Appliances","url":"smart-home-appliances","category":"home-improvement-amp-maintenance-devices","dontInclude":[""],"keyword":[""],"description":"Buy the top quality smart home appliances at the best prices.","content":[{"asin":"B07JMX65V9","title":"Amazon Basics 60W Equivalent, Soft White, Dimmable, 10,000 Hour Lifetime, A19 LED Light Bulb , 6-Pack","price":"$18.22","saving":"","rating":"4.6 out of 5 stars","reviews":"8,878 ratings","image":["https://m.media-amazon.com/images/I/61slBwv-pvL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"Amazon's  Choice","description":"Product Description        Amazon Basics 60W Equivalent, Soft White, Dimmable, 10,000 Hour Lifetime, A19 LED Light Bulb | 6-Pack          From the Manufacturer        Amazon Basics"},{"asin":"B08J4K74SB","title":"Amazon Basics Traditional Electronic Keypad Deadbolt Door Lock with Passage Lever - Oil Rubbed Bronze, 129.2mm H Upper x 65mm H Lower","price":"$67.36","saving":"-5%","rating":"4.2 out of 5 stars","reviews":"1,341 ratings","image":["https://m.media-amazon.com/images/I/61FZ4d9IUaL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"Product Description        Amazon Basics Traditional Electronic Keypad Deadbolt Door Lock with Passage Lever - Oil Rubbed Bronze          From the Manufacturer        Amazon Basics"},{"asin":"B08WWTWXQJ","title":"Armacost Lighting 423500 RibbonFlex Home 16ft. RGB+W Smart LED Tape Light Kit, multi-color and white","price":"$36.20","saving":"-40%","rating":"4.5 out of 5 stars","reviews":"702 ratings","image":["https://m.media-amazon.com/images/I/61lMZw3WVVL._AC_SX425_.jpg"],"availability":"In Stock","tag":"","description":"The Armacost Lighting RibbonFlex Home Multicolor RGB+ White Smart LED strip light kit is the perfect solution for versatile indoor accent lighting including under cabinets, shelving, decks and patios. Full-range brightness and color control with included wireless remote; RF technology works through walls up to 50 ft. away. Adhesive backing for easy installation."},{"asin":"B082VXK9CK","title":"August Home, Wi-Fi Smart Lock (4th Generation)– Fits Your Existing Deadbolt in Minutes, Silver","price":"$177.61","saving":"","rating":"4.1 out of 5 stars","reviews":"10,212 ratings","image":["https://m.media-amazon.com/images/I/61e592E6PqL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"This item cannot be shipped to your selected delivery location. Please choose a different delivery location.","tag":"","description":"The August Wi-Fi Smart Lock (4th Generation) and August app allows you to remotely lock or unlock your door, check door status, grant virtual guest keys and always know who’s coming and going. Connected out of the box with built in Wi-Fi, the August Wi-Fi Smart Lock is easy to install and attaches to your existing deadbolt so you can keep your original keys."},{"asin":"B01M22BVFZ","title":"BLACK+DECKER LED Under Cabinet Lighting Kit, 3-Bars, 9 Inches Each, DIY Tool-Free Installation, Warm White, 2700K, 1080 Lumens, 15 Watts, Home Accent (LEDUC9-3WK)","price":"$61.19","saving":"","rating":"4.6 out of 5 stars","reviews":"1,655 ratings","image":["https://m.media-amazon.com/images/I/71eDHIFbblL.__AC_SY300_SX300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"Engineered for superior performance, our revolutionary line of PureOptics LED Under Cabinet Lighting is powerful, sleek, and a snap to install.  With its slim shape, the LED lighting emits a warm, rich accent lighting with an expanded light zone, while the unit remains hidden for clean, contemporary style. Great for areas large or small, easily link up to 5 light bars (3 included) with each bar illuminating spaces up to 36 inches wide. Conveniently included in the kit are various sized jumper wires, which provide additional flexibility to cover longer distances or specialty configurations, such as jumping a stove. Depending on the task at hand, customize the light brightness by switching through the light’s 10 dimmer settings to find the perfect level of illumination while the flicker-free light softly fades out without any hot-spots. In addition to the power switch on one of the lights, for convenience and speed, you can also wave your hand below the motion sensor to turn the lights on or off. For energy efficiency, activate the timer and after three hours, the lights automatically shut off. With cost-efficient LEDs, use 85% less energy for brilliant illumination lasting 50,000 hours.  Conserve energy with crisp, warm white light that is high-contrast for vivid, brilliant colors, so you can work, play, and create with unparalleled clarity.  APPLICATION: To apply, simply adhere mounting clips to the light bar, attach to desired location, and plug in. For a more permanent solution, use the screws in the kit. For specialty configurations, the various-sized jumper wires (included) provided additional flexibility.   DETAILS: Simple tool-free installation with adhesive mounting clips, or a permanent application using screws Choose between the motion sensor for hands-free on and off, or the power button for traditional use Slim design (0.4” height by 0.75” width) allow lights to be easily hidden 10 dimmer settings Optional auto timer shuts off after three hours to save energy Warm white light that is crisp and high-contrast for vivid, brilliant colors  50,000 hour life and uses 85% less energy 3-Year Limited Warranty   SPECIFICATIONS: Bulb Length: 9” Voltage: 24V Color Rendering Index (CRI): 82.0 Color temperature (in Kelvin): 2,700K Lumens per Bar: 360 Efficacy: 72.0 Total Watts: 15.0 Maximum Cabinet Size Per Light Bar: 36” Energy Star Approved  KIT CONTENTS: 9-inch LED light bar with power button 9-inch LED light bar (2x) Control Box AC Adapter Light bar mounting clips (10x) Wire mounting clips (12x) Jumper extender  4-inch jumper wires (3x) 12-inch jumper wire 30-inch jumper wires (2x) Optional - Mounting screws (6x)Ac Adaptor : 120-240V, Output 24V, 1 Amps"},{"asin":"B088KRPCQJ","title":"Bose TV Speaker - Soundbar for TV with Bluetooth and HDMI-ARC Connectivity, Black, Includes Remote Control","price":"$279.00","saving":"","rating":"4.4 out of 5 stars","reviews":"9,973 ratings","image":["https://m.media-amazon.com/images/I/61syGjJDgeL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"This item cannot be shipped to your selected delivery location. Please choose a different delivery location.","tag":"","description":"The Bose TV Speaker helps you hear your TV better. It’s a small sound bar that clarifies speech and improves overall TV sound. Inside the TV speaker there are two full-range drivers angled to deliver wide, spacious sound and a center tweeter specifically focused on elevating vocals. Built-in Dolby decoding helps further enhance this compact TV speaker’s audio capabilities to deliver a more realistic and satisfying listening experience. Designed with simplicity in mind, this small soundbar only uses a single connection to the TV via an optical audio cable (included) or an HDMI cable (sold separately) and has you up and running in minutes. At just over 2\" tall, the Bose TV Speaker is a compact sound bar that can be placed just about anywhere. And small LED lights on the front of this small soundbar turn on and/or change color for visual confirmation when certain features are enabled. They also blink in acknowledgement of volume changes. The Bose TV Speaker has HDMI-CEC, which allows the TV and this small soundbar to communicate when connected with an HDMI cable. Meaning when you turn the TV on, the TV speaker will automatically turn on too. With this technology, you can even keep using your current TV remote to control the volume of this compact soundbar. However, the Bose TV Speaker comes with its own remote. And on it, you can enable “dialogue mode” on the TV speaker to elevate vocals even more or press the “bass” button for some extra depth. This compact soundbar also is a Bluetooth soundbar. Simply press the Bluetooth button on the remote to pair your device to this Bluetooth TV speaker and wirelessly stream your favorite music or podcasts. You can also expand your system at any time by adding a wired subwoofer to the Bluetooth TV speaker for a more home-theater-like experience. The Bose TV Speaker is compatible with the Bose Bass Module 500 and 700 and requires the Bose Bass Module Connection Cable or a standard 3.5 mm audio cable, sold separately."},{"asin":"B084FLHDDM","title":"Catalina Lighting 96&quot; Track Ceiling Light, Oil Rubbed Bronze, Transitional 5-Light LED Flex Track, Bulb Included, for Kitchen, Living Room, Home Lighting","price":"$136.86","saving":"-32%","rating":"4.2 out of 5 stars","reviews":"507 ratings","image":["https://m.media-amazon.com/images/I/51xNZWRjynL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"Brighten your space just the way you want it with the Catalina Transitional 5-Light Flex Track Ceiling Light. This light fixture comes ready for application, with five highly efficient GU10 LED lights that come integrated into the track to save you time, energy, and money. Made from durable metal materials with a dark bronze finish, this fixture is both beautiful and long-lasting. The flexible track rail can be bent, arched, and angled to fulfill your exact interior design vision, and the adjustable cylinder shades offer even more freedom in directing and positioning illumination to your liking. Connect this lighting fixture to a standard dimmer switch, and the luminary settings can be adjusted and customized until you reach your preferred level of brightness. This light is also smart home compatible, and can be plugged into a smart outlet or smart switch to connect with Alexa, Google Home, or other smart home devices. With articulate provided instructions in English, Spanish and French, this ceiling light features a center canopy which can be mounted to any ceiling or wall junction box with the included installation and mounting kit. To build onto this track light, additional fixtures with joiners may be purchased and added, resulting in a brilliant light display with few limits. This impressive light fixture measures 96\" x 10.25\" x 4.38\"."},{"asin":"B07JBZ5ZDD","title":"Cooluli 20L Mini Fridge For Bedroom - Car, Office Desk & College Dorm Room Glass Front Digital Temperature Control 12v Small Refrigerator for Food, Drinks, Skin Care, Beauty Breast Milk (Blue)","price":"$149.99","saving":"","rating":"4.2 out of 5 stars","reviews":"2,747 ratings","image":["https://m.media-amazon.com/images/I/71oCvrhZxrL._AC_SX425_.jpg"],"availability":"In Stock","tag":"","description":"About this item                   Convenient & Lightweight: The Concord-20LDX thermo-electric cooler/warmer/wine cooler mini fridge by Cooluli is sleek, compact and perfectly portable. This compact unit measures: 11.25\" W x 13.75\" D x 16.25\" H and weighs 13 lbs. 12 oz. The inner dimensions are 8.8\" L x 9\" D x 13.6\" H.Cooling method:Thermoelectric     Customized Temperature Control: Adjust and set your desired temperature with the simple touch of a button with the digital thermostat on the easy-to-read display     Ultra Versatile & Functional: Use this cooler/warmer mini refrigerator as a beer and wine cooler, and to store food, snacks, drinks, breast milk, insulin, beauty and skincare products, and medications     Stylish Design: Sleek, glass-front mini fridge is ideal to use at home, in the nursery, office and dorm room, and on road trips, vacation, and tailgate parties     Advanced Dual-Core Cooling & Warranty: Innovative semiconductor operation is energy-efficient, ultra-quiet and 100% eco-friendly. The Concord is built to North American electrical standards. Please refer to the User Manual before use. A 1-year limited warranty is provided.       \n                    ›  See more product details"},{"asin":"B07Y8VCFMR","title":"Cooluli Vibe Mini Fridge for Bedroom - With Cool Front Magnetic Whiteboard - 15L Portable Small Refrigerator for Travel, Car & Office Desk - Plug In Cooler & Warmer for Food, Drinks & Skincare (White)","price":"$99.99","saving":"","rating":"4.1 out of 5 stars","reviews":"1,251 ratings","image":["https://m.media-amazon.com/images/I/61GdfKqhq5L.__AC_SY445_SX342_QL70_FMwebp_.jpg"],"availability":"Only 17 left in stock (more on the way).","tag":"","description":"About this item                   Convenient & Lightweight: The Cooluli Vibe 15-liter thermoelectric cooler/warmer dry-erase whiteboard mini fridge is sleek, durable and perfectly portable. This unit measures 10.5\" W x 12.75\" D x 14.75\" H and weighs 9 lbs. 2 oz.Cooling method:Thermoelectric     Quickly Switch from Cooling to Warming: Go from cooling to warming with one quick switch     Ultra Versatile & Functional: Use the Vibe-15LE compact cooler/warmer mini-refrigerator to store food, drinks, breast milk, insulin, skincare products, medications and other essentials.     Magnetic & Dry-Erase Whiteboard Front: The stylish yet practical whiteboard surface is perfect for storing magnets, and keeping notes and memos handy—in dorms, offices, nurseries, and on road trips, vacation, and tailgate parties. Dry-erase markers not included.     Advanced Technology & Warranty: The dual-voltage Vibe (110-240V/12V) works anywhere in the world. It features our 100% eco-friendly EcoMax Technology which uses minimum energy and prevents frost. The Vibe is supported by exceptional customer support and a 1-year limited warranty. Please refer to the Instruction Manual before use.       \n                    ›  See more product details"},{"asin":"B09XYXVZH9","title":"Cree Lighting Connected Max Smart Led Bulb A19 60W Tunable White + Color Changing, 2.4 Ghz, Compatible with Alexa and Google Home, No Hub Required, Bluetooth + WiFi, 3Pk (CMA19-60W-AL-9ACK-B3)","price":"$27.40","saving":"-5%","rating":"4.4 out of 5 stars","reviews":"1,494 ratings","image":["https://m.media-amazon.com/images/I/81q2kOEdxwL._AC_SX425_.jpg"],"availability":"In Stock","tag":"Amazon's  Choice","description":"Exceptional smart lighting made simple. Turn on, off or dim your favorite shade of white light for everyday use or get the party started with millions of colors. Control and manage your Cree Lighting Connected Max LED Smart Bulbs from anywhere. Control on the app or with your favorite voice assistant. Set up is fast and easy – pair your bulbs quickly using Bluetooth and then control with WiFi. Enable “Follow the Sun” and your lights will gradually shift throughout day to mimic natural sunlight, which can improve your mood, well-being & productivity."},{"asin":"B0CGKG7WT7","title":"DESIGNERS FOUNTAIN 5/6 inch 12 Watt 5CCT LED Retrofit Recessed Ceiling Light 2700K 3000K 3500K 4000K 5000K 1000lm Dimmable Bronze Baffle Retrofit Trim, EVL61093T50BZ (5CCT New Version of EVL6733CBZ30)","price":"$13.88","saving":"-7%","rating":"4.5 out of 5 stars","reviews":"735 ratings","image":["https://m.media-amazon.com/images/I/51Rjww72pFL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"Amazon's  Choice","description":"The integrated LED bronze recessed light is the perfect solution for residential and commercial applications. This retrofit light produces 1,000 lumens of light with 5 color temperature (CCT) selections: warm 2700K, soft 3000K, neutral 3500K, bright 4000K, and a 5000K setting that is close to daylight. This baffle trim LED fixture can be used with 5 in. or 6 in. IC or non-IC-rated recessed housings (housings not included). It is ETL certified for installation in dry or damp indoor areas and is listed by Energy Star and compliant with California Title 24 for rebates that may be available in the area. Backed by a 5-year limited manufacturer's warranty and a 50,000-hour expected lifespan, this is a rock-solid option for remodel or retrofit applications."},{"asin":"B09XXTQPXC","title":"ecobee New Smart Thermostat Enhanced - Programmable Wifi Thermostat - Works with Siri, Alexa, Google Assistant - Energy Star Certified - Smart Home","price":"$189.99","saving":"","rating":"4.5 out of 5 stars","reviews":"1,754 ratings","image":["https://m.media-amazon.com/images/I/51YWnoWYbkL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"Amazon's  Choice","description":"The all new ecobee's Smart Thermostat Enhanced gives you automatic energy savings and adapts to your lifestyle by adjusting temperature based on occupancy, suggesting schedule changes, and optimizing your energy savings. eco+ comes with features that automatically turn temperatures down when you're away or asleep. Works with your smart device or Apple Watch and connects to your smart home system like Apple HomeKit, Amazon Alexa, Google Assistant, SmartThings, and IFTTT. Trusted by experts and made for the planet, Smart Thermostat Enhanced delivers unparalleled comfort and savings."},{"asin":"B07RQ8K25S","title":"Enbrighten Add-On Switch QuickFit and SimpleWire, In-Wall Rocker Paddle, Z-Wave ZigBee Wireless Smart Lighting Controls, NOT A STANDALONE Switch, 46199 , White and Light Almond","price":"$21.48","saving":"","rating":"4.6 out of 5 stars","reviews":"786 ratings","image":["https://m.media-amazon.com/images/I/91wGCIAxUfS.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"Amazon's  Choice","description":"Expand your control with the Enbrighten Add-on Switch with QuickFit and SimpleWire When paired with an Enbrighten smart switch or dimmer including Z-Wave and Zigbee controls the hardwired device completes multi-switch systems Wirelessly operate and schedule indoor or outdoor fixtures from up to five locations for effortless management of your home."},{"asin":"B07FFBCQ5B","title":"Feit Electric 4 inch LED Recessed Downlight - Baffle Trim - Standard E26 Adapter - 2700K Soft White - Dimmable- 50W Equivalent - 45 Year Life - 650 Lumen, 6-Pack, LEDR4B/927CA/MP/6","price":"$36.46","saving":"-27%","rating":"4.6 out of 5 stars","reviews":"577 ratings","image":["https://m.media-amazon.com/images/I/41IebP-0LvL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"Available to ship in 1-2 days","tag":"","description":"Feit Electric LEDR4B/927CA/MP/6 is designed for easy DIY installation, the downlight fits most 4\" recessed can housings and comes with a standard base adapter with a baffle trim for trouble-free do-it-yourself installation. This dimmable LED recessed light has a wide range of uses; compatible with most LED dimmers, you can create your favorite space by utilizing the smooth dimming range of 10% - 100%. Giving you 90+ CRI this light can enhance your home's interior and bring colors to life; the colors will remain true and the light output will remain stable through the lifetime of the bulb. With this 2700K color temperature, it is the warmest option that most closely resembles a standard incandescent blub; giving a warm and cozy feeling, and is often best for kitchens, laundry rooms, living rooms, dens, and bedrooms. Feit Electric LED recessed light provides up to 85.6% energy saving by replacing 50W with 7.2W; replace your old incandescent bulbs for a brighter and more energy-friendly home. UL listed, and FCC compliant, Feit Electric upholds the highest standards for all our light bulbs, fixtures, and string lights with optimal performance and safety; with 40+ years of experience in lighting, we are the leader in lighting innovations. This pack includes 6 (six) LED Recessed Lights with a Medium E26 Base adapter; great value along with the convenience and ease of purchase"},{"asin":"B07GFYQWLK","title":"Feit Electric LED Recessed Downlight, fit Most 5-6&quot; Housing Cans, Baffle Trim, Dimmable, 75W Equivalent 10.2W, 925 LM Retrofit kit, 75 Watt, 5000K Daylight, 6-Pack LEDR56B/950CA/MP/6","price":"$39.73","saving":"-34%","rating":"4.6 out of 5 stars","reviews":"577 ratings","image":["https://m.media-amazon.com/images/I/71WQsr3B-PL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"Feit Electric LEDR56B/950CA/MP/6 is designed for easy DIY installation, the downlight fits most 5-6\" recessed can housings and comes with a standard base adapter with a baffle trim for trouble-free do-it-yourself installation. This dimmable LED recessed light has a wide range of uses; compatible with most LED dimmers, you can create your favorite space by utilizing the smooth dimming range of 10% - 100%. Giving you 90+ CRI this light can enhance your home's interior and bring colors to life; the colors will remain true and the light output will remain stable through the lifetime of the bulb. This 5000K color temperature simulates full-spectrum light; providing an energizing crisp white light for any room. Feit Electric LED recessed light provides up to 86.4% energy saving by replacing 75W with 10.2W; replace your old incandescent bulbs for a brighter and more energy-friendly home. UL listed, and FCC compliant, Feit Electric upholds the highest standards for all our light bulbs, fixtures, and string lights with optimal performance and safety; with 40+ years of experience in lighting, we are the leader in lighting innovations. This pack includes 6 (six) LED Recessed Lights with a Medium E26 Base adapter; great value along with the convenience and ease of purchase"},{"asin":"B07ZWTFLCF","title":"Feit Electric Smart Recessed Light, Fits Most 5-6&quot; Can Housing, Works with Alexa or Google Assistant, 75W Equiv, 2.4GHz WiFi Color Changing and Tunable White, Dimmable, No Hub Needed, LEDR6/RGBW/AG","price":"$15.49","saving":"-38%","rating":"4.3 out of 5 stars","reviews":"1,047 ratings","image":["https://m.media-amazon.com/images/I/71wMPbKrutL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"Convert your old recessed downlights to advanced LED energy-saving technology with the LEDR6/RGBW/AG smart recessed downlight from Feit Electric. Fitting most 5-6 inch recessed can housings, this dimmable color-changing light produces 1000 lumens using only 11. 1 watts - up to 84% less energy than an equivalent 75 watt incandescent. The wireless smart recessed light required 2.4GHz WIFI network. These smart downlights connect directly to your Wi-Fi at home, allowing control over color, dimming, schedules and more with an intuitive mobile app, or your Alexa or Google device. Use AP mode to connect when you are having challenges connecting to the 2.4GHz WiFi network."},{"asin":"B082LK16TH","title":"GE CYNC Smart Dimmer Light Switch, No Neutral Wire Required, Bluetooth and 2.4 GHz Wi-Fi 3-Wire Switch, Works with Alexa and Google (1 Pack)","price":"$29.98","saving":"-45%","rating":"4.0 out of 5 stars","reviews":"1,592 ratings","image":["https://m.media-amazon.com/images/I/41ivuDY8KqL._SY445_SX342_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"The Cync Smart Switch-Dimmer adds smart bulb functionality to traditional bulbs and keeps smart bulbs smart. The smart Wi-Fi switch works as dimmer switch while enhancing the traditional bulb functionality to include out-of-home control, scheduling and scene setting. When C by GE Smart Bulbs are installed, the smart switch allows app or voice control even when power is turned off at the switch. Pair the Smart Switch with C by GE Smart Bulbs in other fixtures like table lamps and control your all your lights in the room from one wall switch. C by GE Smart Switch wirelessly connects with other C by GE Smart Switches so you can control the same light fixture from multiple switches – connecting the switches wirelessly still applies, even if the switches are on different circuits. Simple DIY set up. The Smart Switch connects directly with Google Home and Amazon Alexa devices without a hub required. Works with most common residential wiring– no neutral wire required."},{"asin":"B0948L7Z5W","title":"GE CYNC Smart Plug, Indoor Bluetooth and Wi-Fi Outlet Socket, Works with Alexa and Google (1 Pack)","price":"$24.99","saving":"","rating":"4.3 out of 5 stars","reviews":"2,332 ratings","image":["https://m.media-amazon.com/images/I/61SMnjg+x3L._AC_SX425_.jpg"],"availability":"In Stock","tag":"Amazon's  Choice","description":"The Cync Smart Plug makes any lamp or device that plugs into a wall smart. The built-in Wi-Fi bridge adds out-of-home control for your lighting and devices and voice control when paired with a voice assistant. The plug also enables scheduling and scene setting to traditional bulbs and devices. The Smart Plug adds smart functionality to fixtures where smart bulbs won't fit or match the look of the fixture. Pair the Smart Plug with Cync or C by GE Smart Bulbs in other fixtures and Smart Switches to control all your lights together. Use the Smart Plug with other devices like curling irons, fans and electronic devices to turn them on or off remotely or schedule them to operate around your routine. The Smart Plug connects directly with Google Home and Amazon Alexa devices without a hub required. Simply plug into a standard wall socket and you're ready to go."},{"asin":"B09LXGHR5X","title":"GHome Smart Mini Smart Plug, WiFi Outlet Socket Works with Alexa and Google Home, Remote Control with Timer Function, Only Supports 2.4GHz Network, No Hub Required, ETL FCC Listed (4 Pack),White","price":"$19.98","saving":"-20%","rating":"4.2 out of 5 stars","reviews":"8,334 ratings","image":["https://m.media-amazon.com/images/I/61zNryo7KsL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"The WP3 is GHome smallest mini smart plug. You can use it controlling lamps, fans, heating, kettle, coffee maker, humidifiers and other home electronic appliances.Smart plugs that work with Alexa and Google Home Assistant. You can enjoy the hands-free convenience with its voice control, just give a simple voice command and you enjoy smart and better life. You can control your Alexa smart plug via the APP(OUR APP and Smart Life), also it support Tuya APP."},{"asin":"B0BG82G8SJ","title":"GHome Smart Switch, 2.4Ghz Wi-Fi Light Switch Compatible with Alexa, Google Home, Neutral Wire Required, Single-Pole,UL Certified,Voice Control and Timer,No Hub Required, 4Pack, White","price":"$39.99","saving":"-7%","rating":"4.3 out of 5 stars","reviews":"587 ratings","image":["https://m.media-amazon.com/images/I/614-oC5AVrL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"Amazon's  Choice","description":"Enjoy Convenience of Smart Home- throw away your old wall light switches, use our smart light switch to make your home smarter and more convenient. Note: When the updated wifi light switch is off, it is designed without led light, you could control it by voice and smart life Apps on the smartphone."},{"asin":"B0B43S6NJP","title":"Globe Electric 35847 Wi-Fi Smart 7 W (60 W Equivalent) Spiral Filament Multicolor Changing RGB Tunable White Clear LED Light Bulb, No Hub Required, Voice Activated, 2000K - 5000K, Vintage Edison","price":"$29.99","saving":"","rating":"4.1 out of 5 stars","reviews":"1,048 ratings","image":["https://m.media-amazon.com/images/I/71xU3p0vVeL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"Using Globe Electric smart bulbs and the GLOBE SUITE App, easily start your home automation. Seem like you're home when you're not by having lights come on at different times in different rooms. Turn on your lights before you get home from work, so you have a light to arrive home with. The tunable white feature is great for your health by allowing you to have bright white light in the morning and then a relaxed warm white light for evenings, echoing your circadian rhythm. And that's not all. These bulbs let you change the color of your room too so you can create the perfect mood for any situation. Resembling the vintage Edison filament bulbs from yesteryear, but with a stylish spiral update, you'll love adding these to open socket fixtures or fixtures with clear glass shades to enjoy their sweet vintage look. Perfectly hands -free, control your bulb with the sound of your voice using your Google Assistant, Amazon Alexa, or Siri. It's so simple. It's your home. Smarter."},{"asin":"B01BTRZ6AQ","title":"Globe Electric 90958 4&quot; Rust Proof Indoor/Outdoor Ridged Baffle Round Trim Recessed Lighting Kit 4-Pack, White, Easy Install Push-N-Click Clips, 3.88&quot; Hole Size, Porch Light, Bulb Not Included","price":"$47.94","saving":"-17%","rating":"4.5 out of 5 stars","reviews":"1,242 ratings","image":["https://m.media-amazon.com/images/I/51RTDmJRWsL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"Globe Electric's 4 inch recessed lighting kit is the perfect way to brighten up the interior of your home or business with style. Turn your recessed lighting Green using LED bulbs with this recessed lighting kit. This recessed lighting kit features patented PUSH-N-CLICK clips which are fully adjustable and extra wide to grip uneven surfaces and provides for easy tool-free installation. Pot light kit features an integrated cut-off switch, ensuring that the fixture will not overheat and can be used with or without an insulation box. Robust construction; longer shaft with flexible BX cable and large accessible electrical box with removable side panels and tempered steel clips. This recessed lighting kit requires one 50W equivalent MR16 GU10 light bulbs (sold separately). About Globe Electric - since 1932 - our commitment is to our consumers, partners, associates, and our product. Every day we strive to develop and sustain the Creative energy that has kept us going for more than 80 years. Globe is a leader in high quality and innovative products; with the pace of technological change increasing globe continues to invest in research and development. Specializing in the design and manufacture of light bulbs, luminaires, and electrical products, globe has over 20 production facilities all over the world. Globe Works hand in hand with the leading retailers in the world to make sure the product presentation is flawless. The recipient of numerous achievement and design awards, Globe Electric Works tirelessly to design and manufacture products that deliver beautiful appeal, stellar performance, easy installation, and exceptional value. Globe Electric - the Creative energy Company."},{"asin":"B092CQWFJB","title":"GU10 Smart Bulb 4 Pack, RGBCW Color Changing Alexa LED Light Bulbs 5W - WiFi Halogen Lights Dimmable Music Sync 2.4G WiFi Smart Bulbs Compatible with Google Assistant for Track Lighting","price":"$23.00","saving":"","rating":"4.3 out of 5 stars","reviews":"2,615 ratings","image":["https://m.media-amazon.com/images/I/61qFCT-IXML.__AC_SY445_SX342_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"Amazon's  Choice","description":"About this item                   💡 FASTER TO INSATLL& CONTROL ANYWHERE💡: Just install the AvatarControls APP, open the Bluetooth and connect to 2.4GHz WIFI, it will find the gu10 smart bulb automatically, and start to enjoy smart life, control the smart bulbs anywhere anytime.(the Bluetooth just use for set up)     🎼 SYNC WITH MUSIC 🎼: Smart light bulbs GU10 sync bias lighting to your favorite song and shows how neon changing with the rhythm. It provides 16 million colors, 8 scenes,make a stronger viewing experience     ❤️SMART VOICE CONTROL❤️: Avatar Controls gu10 smart bulbs work with Alexa, Google Home, voice control and hand free. “Alexa, turn on the string light” “Google, turn to blue”     ⏲SET SCHEDULES & TIMERS⏲: Set the WiFi halogen lights to come on in the morning, wake up by a smooth light. Set the lights turn off gradually in the night, so you never have to worry whether you've left any lights on.     ❤️DIMMABLE & GROUP CONTROL❤️: You can set the all Avatar Controls smart item a group, One key control. Also, the gu10 smart bulbs temperature is 2700-6500K, you can adjust brightness, warm white or cool white or RGB lights to meet your need.       \n                    ›  See more product details"},{"asin":"B0CCW7QWMW","title":"HALO LT 5/6-Inch Recessed LED Retrofit Trim","price":"$79.92","saving":"","rating":"4.6 out of 5 stars","reviews":"1,277 ratings","image":["https://m.media-amazon.com/images/I/51PAw3TnyaL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"The Halo LT recessed LED trims are designed for use with new construction or remodel housings. Choose your color temperature directly on the fixture. With the flick of a switch, you can choose between 5 color temperatures ranging from warm (2700K) to daylight (5000K). It's wet rated and ships with a gasket, making any housing air-tite for added energy savings and code compliance. The LT series is the perfect solution for general area downlighting in retrofit, remodel, or new construction applications."},{"asin":"B0BTMVQK7C","title":"Kasa Apple HomeKit Smart Light Switch KS200P3, Single Pole, Neutral Wire Required, 2.4GHz Wi-Fi Light Switch Works with Siri, Alexa and Google Home, UL Certified, No Hub Required, White, 3-Pack","price":"$44.99","saving":"-25%","rating":"4.7 out of 5 stars","reviews":"23,558 ratings","image":["https://m.media-amazon.com/images/I/61odq0U3bkL._SX342_.jpg"],"availability":"In Stock","tag":"Amazon's  Choice","description":"About this item                   【Apple HomeKit Support】This Apple HomeKit compatible smart switch fully integrates into your Apple ecosystem, just ask Siri to turn on/off the lights in your home. (Apple HomeKit remote control requires an additional networked Apple device at home such as a HomePod or Apple TV.)     【Easy Guided Install】Neutral wire is required, standard wall plate size. No need to understand complex switch wiring or master vs auxiliary switch configuration. The Kasa App guides you through easy step by step installation. Need 2.4GHz Wi-Fi connection     【Voice Control】Enjoy the hands-free convenience of controlling the lights in your home with your voice via Apple Siri, Amazon Alexa, or Google Assistant. Perfect for times when your hands are full or entering a dark room.     【Control From Anywhere】Monitor your light status. Turn electronics on and off from anywhere with your smartphone using the Kasa App, whether you are at home, in the office or on vacation.     【Advanced Scheduling & Timer】Use timer or countdown schedules to set your smart switch to automatically turn on and off while you're home or away. Enable 【Away Mode】 to randomly switch on and off to trick potential intruders"},{"asin":"B099KLNM24","title":"Kasa Outdoor Smart Plug, Smart Home Wi-Fi Outlet Timer, Max Load 15A/1875W, IP64 Weather Resistance, Compatible with Alexa, Google Home & SmartThings, No Hub Required, ETL Certified(KP401)","price":"$16.99","saving":"","rating":"4.6 out of 5 stars","reviews":"26,979 ratings","image":["https://m.media-amazon.com/images/I/613VWkNY3ZL.__AC_SY300_SX300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"Extend your Smart Home to the outdoors with the Kasa Smart Outdoor Plug KP401 with landscape lighting, swimming pool pumps, holiday lights, or other appliances. Use the sunrise/sunset offsetting to better schedule your connected device. The Kasa app contains not only all the feature you expect from TP-Link Kasa family include smart actions, but also guidance for you through each step of the installation to connect your smart plug with your home Wi-Fi, Alexa or Google assistant."},{"asin":"B091FXH2FR","title":"Kasa Outdoor Smart Plug, Smart Home Wi-Fi Outlet with 2 Sockets, IP64 Weather Resistance, Compatible with Alexa, Google Home & IFTTT, No Hub Required, ETL Certified(EP40), Black","price":"$21.99","saving":"-12%","rating":"4.6 out of 5 stars","reviews":"13,996 ratings","image":["https://m.media-amazon.com/images/I/61soGaMHzrL.__AC_SY300_SX300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"Amazon's  Choice","description":"About this item                   Individual Control of 2 IN 1 Outlets: 2 AC outlets are working and controlled independently.15A/1875W Max for each. Waterproof cover is attached to protect it from dirt when not in use. Long Wi-Fi range up to 300 feet with IP64 weather resistance. Group your Kasa Smart light bulbs, plugs and switches for seamless control. Ideal for controlling all your devices simultaneously with a single tap.     Voice & Remote Control: Add voice control to any outdoor outlet. Enjoy the hands-free convenience of controlling any outdoor electronic appliances with your voice via Alexa or Google Home Assistant. Turn electronics on and off from anywhere with your smartphone using the Kasa app, whether you are at home, in the office or on vacation.     Easy Set Up and Use: 2.4GHz Wi-Fi connection required. Plug in, open the Kasa app, follow the simple instructions and enjoy the wifi smart plug. Ideal for landscape lighting, swimming pool pumps, holiday lights, or other appliances.     Scheduling: Use schedules or countdown timer to set your smart plug to automatically turn on and off at the time you want. Sunset/sunrise offset makes it even smarter to act according to the real daytime.     Trusted and Reliable: Kasa is trusted by over 6 Million users and being the Reader’s Choice of PCMag 2020. 2-year warranty.     Refer user manual for better understanding of the product     An outdoor plug needs a strong Wi-Fi signal and the Kasa Smart Wi-Fi Outdoor Plug has one of the strongest. With a built-in power amplifier for long range Wi-Fi, the outdoor plug has a reach of up to 300 ft. in open space.       \n                    ›  See more product details"},{"asin":"B0BC2MWTR9","title":"Kasa Smart 3 Way Dimmer Switch KIT, Dimmable Light Switch Compatible with Alexa, Google Assistant and SmartThings, Neutral Wire Needed, 2.4GHz, ETL Certified, No Hub Required, White (KS230 KIT v2)","price":"$34.99","saving":"-36%","rating":"4.5 out of 5 stars","reviews":"890 ratings","image":["https://m.media-amazon.com/images/I/71S0-zkaFQL._AC_SX425_.jpg"],"availability":"In Stock","tag":"","description":"1. No need to understand complex switch wiring configurations. Kasa app guides you through easy step by step installation. Neutral Wire & 2.4GHz Wi-Fi is required, standard wall plate size. 2. Support incandescent bulb up to 300W or dimmable LED bulbs up to 150W. (Dimming function does not support smart Wi-Fi bulbs.) 3. 2-year warranty."},{"asin":"B07HGSCXB6","title":"Kasa Smart Dimmer Switch HS220P3, Single Pole, Needs Neutral Wire, 2.4GHz Wi-Fi Light Switch Works with Alexa and Google Home, UL Certified,, No Hub Required, 3-Pack","price":"$46.99","saving":"-37%","rating":"4.6 out of 5 stars","reviews":"7,945 ratings","image":["https://m.media-amazon.com/images/I/31hK2ioZA7L._SY445_SX342_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"With the smart Wi Fi dimmer, you can control the ambiance of any space with the push of a button. A quick tap of the switch toggles lighting to the previous level and built in up & down dimmer buttons let you fine tune lighting to match your mood or activity. Because it’s a TP Link smart switch, you can easily control it from anywhere using the Kasa app or your favorite voice assistant device."},{"asin":"B09QBD5J7S","title":"Kasa Smart LED Light Strip, 50 Color Zones RGBIC, 16.4ft Wi-Fi LED Strip Works w/ Alexa, Google Home & SmartThings, High Brightness, 16M Colors, PU Coating, Trimmable, 2 Yr Warranty (KL420L5)","price":"$29.99","saving":"-25%","rating":"4.5 out of 5 stars","reviews":"3,444 ratings","image":["https://m.media-amazon.com/images/I/71N1ACuZ00L.__AC_SY445_SX342_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"Transform the ambiance of your bedroom, gaming area, work station, and more with the Kasa Smart WiFi RGBIC LED Light strip. Cut the 16.4 ft. smart light strip to perfectly match your bed frame or cabinets, and choose from unlimited lighting effects with 16 million fully dimmable color choices and advanced animations that can match any mood from a party to unwinding before bed. With its 50 adjustable color zones, the customization on your preferred lighting is endless. The durable PU Coating along the length of the LED strip protects it from moisture so you can install your light strip with peace of mind. 2 year warranty. (Light strip has IP44 rating. Connection points and power adapter do not have protective coating.)."},{"asin":"B08TB8Z5HF","title":"Kasa Smart Light Bulbs, Full Color Changing Dimmable WiFi Bulbs Compatible with Alexa and Google Home, A19, 9W 800 Lumens,2.4Ghz only, No Hub Required, 4 Count (Pack of 1), Multicolor (KL125P4)","price":"$27.99","saving":"-30%","rating":"4.5 out of 5 stars","reviews":"7,688 ratings","image":["https://m.media-amazon.com/images/I/61Y-TtwpVIL.__AC_SY445_SX342_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"Amazon's  Choice","description":"Dimmable 16 million colors and warm to cool whites(2500K-6500K), E26 A19 base. Explore endless lighting possibilities to create your favorite light effects for every scene you need. The Kasa app contains not only all the feature you expect from TP-Link Kasa family, but also guidance for you through each step of the installation to connect your smart bulb with your home Wi-Fi, Alexa or Google assistant."},{"asin":"B01EZV35QU","title":"Kasa Smart Light Switch HS200, Single Pole, Needs Neutral Wire, 2.4GHz Wi-Fi Light Switch Works with Alexa and Google Home, UL Certified, No Hub Required , White","price":"$13.99","saving":"-30%","rating":"4.6 out of 5 stars","reviews":"38,569 ratings","image":["https://m.media-amazon.com/images/I/71dXf56rv0L._SX342_.jpg"],"availability":"In Stock","tag":"#1 Best Seller","description":"Control your lights, ceiling fans, and other fixtures from anywhere with the HS200. The smart switch replaces any standard light switch, and connects to your home Wi-Fi in no time through the free Kasa app. Kasa also lets you manage connected fixtures with your smartphone or tablet, including setting schedules, timers and countdowns. For added convenience, you can use your voice to control the HS200 when paired with works with Amazon Alexa, Google assistant and Microsoft cortana.Input Voltage: 100 - 120 VAC, 50/60 Hz, 15 A."},{"asin":"B09NMX9N24","title":"Kasa Smart Motion Sensor Switch, Dimmer Light Switch, Single Pole, Needs Neutral Wire, 2.4GHz Wi-Fi, Compatible with Alexa & Google Assistant, UL Certified, No Hub Required(ES20M) White 1-Pack","price":"$39.99","saving":"","rating":"4.5 out of 5 stars","reviews":"2,763 ratings","image":["https://m.media-amazon.com/images/I/51MWX3hAPqL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"Amazon's  Choice","description":"The ES20M is smart dimmer with an advanced motion and ambient light sensor built in. Ideal for areas where hand-free operation is ideal, the ES20M is perfect for those who want more automation in their home, including those with limited mobility or those with children in the home. Walk into a room and have your lights automatically turn on. Lights can be programmed to turn off after a set time without motion detection to save on electricity. The smart dimmer also includes an ambient light sensor that will detect daylight conditions and prevent the lights from turning on during the daytime if desired. Fully customize your experience with dimmer settings based on your routine. Best of all, the smart dimmer is hands-free, voice controllable, and app accessed. From Amazon Alexa, Google Assistant, to Samsung SmartThings, the Kasa Smart ES20M gives you convenient voice controls.You can expect Kasa Smart quality with the ES20M which has undergone rigorous safety testing and has been UL certified by 3rd party Underwriter Laboratories. In addition, the device is backed by an industry leading 2-year limited warranty. If you are one of the 7 million plus Kasa Smart users, you will also appreciate that the ES20M is compatible with other Kasa devices meaning, you can set groups, and smart actions to work in conjunction with other Kasa Smart devices.Take control of your smart lighting, and have total automated freedom with the Kasa Smart ES20M Smart Dimmer with motion sensor.This which can achieve more automation, intelligence, and personalized settings. Standard: IEEE802.11 b/g/n Wi-Fi Standard: 2.4 GHz Wi-Fi only Max load: 300W INC, 150 W CFL/LED. Power Supply: AC 100~125 V, 50/60 Hz Neutral Wire Required. 2-year warranty."},{"asin":"B07B8W2KHZ","title":"Kasa Smart Plug HS103P2, Smart Home Wi-Fi Outlet Works with Alexa, Echo, Google Home & IFTTT, No Hub Required, Remote Control,15 Amp,UL Certified, 2-Pack White","price":"$19.77","saving":"","rating":"4.6 out of 5 stars","reviews":"69,160 ratings","image":["https://m.media-amazon.com/images/I/318hT1pOvRL._SY445_SX342_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"The HS103 Kasa smart plug is the easiest way you can start controlling lamps, fans, humidifiers and other home electronic appliances. With it adding voice control to any outlet, you could also enjoy the hands-free convenience. The Kasa app contains not only all the feature you expect from TP-Link Kasa family, but also guidance for you through each step of the installation to connect your smart plug with your home Wi Fi, Alexa or Google assistant."},{"asin":"B07RCNB2L3","title":"Kasa Smart Plug HS103P4, Smart Home Wi-Fi Outlet Works with Alexa, Echo, Google Home & IFTTT, No Hub Required, Remote Control, 15 Amp, UL Certified, 4-Pack, White","price":"$25.99","saving":"-13%","rating":"4.6 out of 5 stars","reviews":"53,704 ratings","image":["https://m.media-amazon.com/images/I/51dHnr3+jGL._AC_SY300_SX300_.jpg"],"availability":"In Stock","tag":"","description":"The HS103 Kasa smart plug is the easiest way you can start controlling lamps, fans, humidifiers and other home electronic appliances. With it adding voice control to any outlet, you could also enjoy the hands-free convenience. The Kasa app contains not only all the feature you expect from TP-Link Kasa family, but also guidance for you through each step of the installation to connect your smart plug with your home Wi-Fi, Alexa or Google assistant."},{"asin":"B091FXLMS8","title":"Kasa Smart Plug Mini 15A, Smart Home Wi-Fi Outlet Works with Alexa, Google Home & IFTTT, No Hub Required, UL Certified, 2.4G WiFi Only, 4-Pack(EP10P4) , White","price":"$25.99","saving":"-13%","rating":"4.6 out of 5 stars","reviews":"16,346 ratings","image":["https://m.media-amazon.com/images/I/51L3mlb5BXL.__AC_SY300_SX300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"The EP10 is Kasa latest mini smart plug that support 15A maximum load, you can use it controlling lamps, fans, humidifiers and other home electronic appliances. With it adding voice control to any outlet, you could also enjoy the hands-free convenience. The Kasa app contains not only all the feature you expect from TP-Link Kasa family include smart actions, but also guidance for you through each step of the installation to connect your smart plug with your home Wi-Fi, Alexa or Google assistant.EP10 Series plug will be part of Amazon CFH program(certified for humans) program soon for the simply setup, Just plug in and say ”Turn on first plug” or follow the simple instructions on Kasa App to enjoy the feature."},{"asin":"B07G95FFN3","title":"Kasa Smart Plug Power Strip HS300, Surge Protector with 6 Individually Controlled Smart Outlets and 3 USB Ports, Works with Alexa & Google Home, No Hub Required , White","price":"$49.99","saving":"-38%","rating":"4.6 out of 5 stars","reviews":"7,607 ratings","image":["https://m.media-amazon.com/images/I/61PI8akrKOL._AC_SX425_.jpg"],"availability":"In Stock","tag":"","description":"About this item                   6 smart outlets: Independently control 6 smart outlets, and charge 3 devices with built in USB ports; Ideal for controlling electronics in your home, home office, or small business     Surge protection: ETL certified surge protection shields sensitive electronics and appliances from sudden power surges that can occur during weather storms and cause irreparable damage     Energy monitoring : Monitor how much energy devices connected to the power strip consume; Check on each one from your Kasa smart app and turn off ones that are using too much power     Control from anywhere: Control connected devices from anywhere with the Kasa Smart app. Power up your office remotely and even your holiday lights from the app     Voice control: Remotely control your smart plug and use voice commands with Alexa, Google Assistant, or MicroSoft Cortana. Plug type:3-prong plug       \n                    ›  See more product details"},{"asin":"B091699Z3W","title":"Kasa Smart Plug Ultra Mini 15A, Smart Home Wi-Fi Outlet Works with Alexa, Google Home & IFTTT, No Hub Required, UL Certified, 2.4G WiFi Only, 1-Pack(EP10), White","price":"$9.99","saving":"","rating":"4.6 out of 5 stars","reviews":"2,072 ratings","image":["https://m.media-amazon.com/images/I/51420cbALHS.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"The EP10 Kasa mini smart plug is the easiest way you can start controlling lamps, fans, humidifiers and other home electronic appliances. With it adding voice control to any outlet, you could also enjoy the hands-free convenience. The Kasa app contains not only all the feature you expect from TP-Link Kasa family include smart actions, but also guidance for you through each step of the installation to connect your smart plug with your home Wi-Fi, Alexa or Google assistant."},{"asin":"B091FXQQMQ","title":"Kasa Smart Plug Ultra Mini 15A, Smart Home Wi-Fi Outlet Works with Alexa, Google Home & IFTTT, No Hub Required, UL Certified, 2.4G WiFi Only, 2-Pack(EP10P2) , White","price":"$14.99","saving":"-25%","rating":"4.6 out of 5 stars","reviews":"27,528 ratings","image":["https://m.media-amazon.com/images/I/51c+0pl9KvS._AC_SY300_SX300_.jpg"],"availability":"In Stock","tag":"","description":"The EP10 Kasa mini smart plug is the easiest way you can start controlling lamps, fans, humidifiers and other home electronic appliances. With it adding voice control to any outlet, you could also enjoy the hands-free convenience. The Kasa app contains not only all the feature you expect from TP-Link Kasa family include smart actions, but also guidance for you through each step of the installation to connect your smart plug with your home Wi-Fi, Alexa or Google assistant."},{"asin":"B08GH9KL4M","title":"Kasa Smart Security Camera for Baby monitor, 1080p HD Indoor Camera for Home Security with Motion Detection, Two-Way Audio, Night Vision, Cloud & SD Card Storage, Works with Alexa & Google Home (EC60)","price":"$19.99","saving":"-33%","rating":"4.4 out of 5 stars","reviews":"9,315 ratings","image":["https://m.media-amazon.com/images/I/51TvRd0WslL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"Keep an eye on your things with the highly affordable Kasa Spot indoor security camera. Receive instant alerts and live stream 1080p HD video to your smartphone, Alexa or Google Assistant supported display. The Spot even provides HD video up to 30 ft. with Night Vision. EC60 continuously records and stores footage on a local MicroSD card up to 64 GB (MicroSD card not included). Premium cloud storage options are available."},{"asin":"B07DXFFSCX","title":"Kwikset 99140-023 SmartCode 914 Traditional Smart Lock Keypad Electronic Deadbolt Door Lock With SmartKey Security and Z-Wave Plus, Satin Nickel","price":"$179.00","saving":"-13%","rating":"4.5 out of 5 stars","reviews":"1,116 ratings","image":["https://m.media-amazon.com/images/I/71RSHPzB5HL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"The SmartCode touchpad smart lock with Home Connect technology enables the lock to wirelessly communicate with other devices in home. The lock allows the user (through a web enabled device) to remotely check the door lock status, lock or unlock the door and receive notifications. SmartCode is a one-touch locking motorized deadbolt. With your personalized code, you can enter your home with the convenience of keyless entry and the back-lit keypad provides increased visibility. This SmartCode deadbolt is easy to install, program and use, and operates on 4 AA batteries. It also features SmartKey Security as the back-up keyway. Kwikset smartcode dead bolts are available as smart locks and as electronic deadbolts to provide keyless entry and access for your daily life similar to our Kwikset Kevo door lock. Our Kwikset locks come with patented Kwikset only security features including- Kwikset smartkey security and SecureScreen. Our front door locks are the smart choice whether you are searching for a keypad lock or a touchscreen lock with multiple finishes including satin nickel, venetian bronze, and polished chrome. From august to December Kwikset deadbolts are the locks for year-round keyless entry. Kwikset smartcode home connect means our kwikset z wave locks works with amazon alexa, smartthings, and wink smart home hubs for smart home automation..Required door thickness- 1 3/8 to 2 inches. Latch is 20 minute fire rated with round corner face.  TROUBLESHOOT: The lock jams and the turnpiece does not rotate smoothly: (1) The door handing process was not executed during installation.Perform the door handing process in the Installation Guide. (2) The hole in the door is misaligned.Disassemble the lock, and reinstall it without the adapter ring on the exterior side of the door.  The Lock button does not lock the door. (1) No user codes are programmed.If there are no codes in the lock, the lock button will not lock the door. Program at least one user code and test the Lock button again. (2) The door handing process was not executed.Perform the door handing process, following the instructions inside the installation guide. (3) The battery is too low to lock the door.This is indicated by the keypad flashing red three times with three beeps. Remove the batteries and replace with a fresh set."},{"asin":"B07YNJMWTC","title":"Kwikset 99170-004 SmartCode 917 Keypad Keyless Entry Contemporary Residential Electronic Lever Lock Deadbolt Alternative with Halifax Door Handle and SmartKey Security, Matte Black","price":"$113.40","saving":"-9%","rating":"4.6 out of 5 stars","reviews":"2,813 ratings","image":["https://m.media-amazon.com/images/I/51uWptAhJbL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"Amazon's  Choice","description":"The SmartCode 917 is a keyless entry electronic lever that allows you to program up to 30 user access codes that can be customized for family, friends, or guests. SmartCode 917 is easy to install, program and use, and operates on one 9 Volt battery. It also features SmartKey Security as the back-up keyway. This entry lever can be locked or unlocked by using the keypad or key from the outside as well as the turn button from the inside. The rich tones of Iron Black add the finishing touch to this product. The Iron Black finish provides a rich and warm complement to the product’s style. Combine the convenience of keyless entry with the highest residential BHMA security grade and the leading designs and finishes that will enhance any door in your home. Perfect for home offices, storage closets or interior garage doors, the SmartCode 917 delivers the right access solution to make your life more convenient, more stylish and more secure. Kwikset SmartCode 917 is available in two styles- traditional and contemporary to match your home decor. Our modern contemporary style comes in three finishes including satin nickel, iron black, and polished chrome. Our traditional wave style come in two finishes satin nickel and venetian bronze."},{"asin":"B08DYZF1CK","title":"Kwikset Halo Fingerprint Wi-Fi Smart Door Lock, Keyless Touch Entry Electronic Contemporary Deadbolt, No Hub Required App Remote Control, With SmartKey Re-Key Security, Matte Black","price":"$249.99","saving":"","rating":"4.1 out of 5 stars","reviews":"732 ratings","image":["https://m.media-amazon.com/images/I/61eqDFImntL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"The Halo Touch fingerprint smart lock allows you to simply use your unique fingerprint to lock and unlock your door. Halo Touch has Wi-Fi built-in that connects directly to your home Wi-Fi network and smartphone for a secure smart home that does not require a third party smart home hub, panel, or subscription. With storage for up to 100 fingerprints (50 users), you can give access to your family and friends with their unique fingerprint and manage access through the Kwikset app. With the Kwikset app and your smartphone, you can manage your lock from anywhere. Lock and unlock, manage users, view lock activity, receive lock notifications and much more. Your existing home Wi-Fi network and an internet connection brings the ultimate in security and convenience right to your fingertips. You can also lock and check the status of Halo using voice commands with Amazon Alexa and Google Assistant. This single cylinder deadbolt can be locked or unlocked by using the fingerprint sensor or key from the outside as well as the turn button from the inside. Available in both contemporary and traditional styles; find the perfect match for your home decor. Halo Touch brings all the convenience and security right to your fingertips."},{"asin":"B08DZ89KJQ","title":"Kwikset Halo Fingerprint Wi-Fi Smart Door Lock, Keyless Touch Entry Electronic Traditional Deadbolt, No Hub Required App Remote Control, With SmartKey Re-Key Security, Satin Nickel","price":"$198.99","saving":"-20%","rating":"4.3 out of 5 stars","reviews":"650 ratings","image":["https://m.media-amazon.com/images/I/71mjjzP5F2L.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"The Halo Touch fingerprint smart lock allows you to simply use your unique fingerprint to lock and unlock your door. Halo Touch has Wi-Fi built-in that connects directly to your home Wi-Fi network and smartphone for a secure smart home that does not require a third party smart home hub, panel, or subscription. With storage for up to 100 fingerprints (50 users), you can give access to your family and friends with their unique fingerprint and manage access through the Kwikset app. With the Kwikset app and your smartphone, you can manage your lock from anywhere. Lock and unlock, manage users, view lock activity, receive lock notifications and much more. Your existing home Wi-Fi network and an internet connection brings the ultimate in security and convenience right to your finger tips. You can also lock and check the status of Halo using voice commands with Amazon Alexa and Google Assistant. This single cylinder deadbolt can be locked or unlocked by using the fingerprint sensor or key from the outside as well as the turn button from the inside. Available in both contemporary and traditional styles; find the perfect match for your home decor. Halo Touch brings all the convenience and security right to your fingertips."},{"asin":"B081FYJ6G8","title":"Kwikset Halo Keypad Wi-Fi Smart Door Lock, Keyless Entry Electronic Touchscreen Deadbolt Door Lock, No Hub Required App Remote Control, With SmartKey Re-Key Security, Satin Nickel","price":"$165.00","saving":"-21%","rating":"4.1 out of 5 stars","reviews":"4,507 ratings","image":["https://m.media-amazon.com/images/I/71pPJSarNdL._AC_SX425_.jpg"],"availability":"In Stock","tag":"","description":"Introducing the Halo Wi-Fi enabled smart lock. It's the uncomplicated way to get smart lock security and smart home convenience using your home's existing Wi-Fi router. Operate, manage and monitor the lock with your smartphone using the Kwikset app from anywhere there's an Internet connection. Halo Wi-Fi Smart Lock is a keyless entry electronic deadbolt featuring SmartKey. Using the Kwikset App, you can lock/unlock, program up to 250 user access codes, and receive notifications from anywhere there's an Internet connection. This single cylinder deadbolt can be locked or unlocked by using the keypad or key from the outside as well as the turn button from the inside. The crisp, clean appearance of the Satin Nickel finish adds to the overall look of the product and brings a modern feel partible phone devices include- Apple iPhone 6, Apple iPhone 6S, Apple iPhone 7, Apple iPhone 7S, Apple iPhone 7 Plus, Apple iPhone 8, Apple iPhone X, Apple iPhone XS, Apple iPhone XS, Apple iPhone XS Max, Apple iPad Air 2, Apple iPad Pro, LG G7 ThinQ, Google Pixel 2XL, Google Pixel 3, Google Pixel 3a, Google Pixel 3XL, Samsung Galaxy S7, Samsung Galaxy Edge S7, Samsung Galaxy S8, Samsung Galaxy S9, Samsung Galaxy S9 plus, Samsung M30, OnePlus 6, Motorola Moto X, Xiaomi Pocophone F1."},{"asin":"B081FYDWL1","title":"Kwikset Halo Touchscreen Wi-Fi Smart Door Lock, Keyless Entry Electronic Deadbolt Door Lock, No Hub Required App Remote Control, With SmartKey Re-Key Security, Venetian Bronze","price":"$199.00","saving":"-6%","rating":"4.1 out of 5 stars","reviews":"6,071 ratings","image":["https://m.media-amazon.com/images/I/718NthXUEwL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"Introducing the Halo Wi-Fi enabled smart lock. It's the uncomplicated way to get smart lock security and smart home convenience using your home's existing Wi-Fi router. Operate, manage and monitor the lock with your smartphone using the Kwikset app from anywhere there's an Internet connection. Halo Wi-Fi Smart Lock is a keyless entry electronic deadbolt featuring SmartKey. Using the Kwikset App, you can lock/unlock, program up to 250 user access codes, and receive notifications from anywhere there's an Internet connection. This single cylinder deadbolt can be locked or unlocked by using the keypad or key from the outside as well as the turn button from the inside. The Venetian Bronze finish is hand-rubbed to reveal unique bronze highlights and provides a rich and warm complement to the product's style partible phone devices include- Apple iPhone 6, Apple iPhone 6S, Apple iPhone 7, Apple iPhone 7S, Apple iPhone 7 Plus, Apple iPhone 8, Apple iPhone X, Apple iPhone XS, Apple iPhone XS, Apple iPhone XS Max, Apple iPad Air 2, Apple iPad Pro, LG G7 ThinQ, Google Pixel 2XL, Google Pixel 3, Google Pixel 3a, Google Pixel 3XL, Samsung Galaxy S7, Samsung Galaxy Edge S7, Samsung Galaxy S8, Samsung Galaxy S9, Samsung Galaxy S9 plus, Samsung M30, OnePlus 6, Motorola Moto X, Xiaomi Pocophone F1."},{"asin":"B0C5GCMC8G","title":"Kwikset SmartCode 916 Z-Wave Smart Lock, Keyless Entry Ring Compatible Door Lock, Touchscreen Electronic Deadbolt, SmartKey Re-Key Security, Smart Hub Required, Contemporary Satin Nickel","price":"$199.94","saving":"","rating":"4.1 out of 5 stars","reviews":"1,147 ratings","image":["https://m.media-amazon.com/images/I/61g011snlfL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"The SmartCode touchscreen smart lock with Home Connect technology enables the lock to wirelessly communicate with other devices in home. The lock allows the user (through a web enabled device) to remotely check the door lock status, lock or unlock the door and receive notifications. SmartCode is a one-touch locking motorized deadbolt. With your personalized code, you can enter your home with the convenience of keyless entry and the back-lit keypad provides increased visibility. It features patented SecureScreen™ technology to prevent code detection from fingerprints on the touchscreen. SmartCode is easy to install, program and use, and operates on 4 AA batteries. It also features SmartKey Security as the back-up keyway. This single cylinder deadbolt can be locked or unlocked by using the keypad or key from the outside as well as the turn button from the inside. The crisp, clean appearance of the Satin Nickel finish adds to the overall look of the product and brings a modern feel."},{"asin":"B0BDFRNZY6","title":"LaView 4MP Bulb Security Camera 2.4GHz,360° 2K Security Cameras Wireless Outdoor Indoor Full Color Day and Night, Motion Detection, Audible Alarm, Easy Installation, Compatible with Alexa","price":"$62.76","saving":"","rating":"4.2 out of 5 stars","reviews":"10,030 ratings","image":["https://m.media-amazon.com/images/I/71BuJPJEC-L.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"About this item                   4MP HD 2560x1440P resolution delivers ultra clear image quality day and night     360° panoramic viewing angle captures entire room with no blind spots     Advanced Starlight night vision provides full color video even in low light conditions     Motion detection with tracking alerts and customizable sensitivity     Two-way audio and 110db alarm siren to deter intruders     Easy wireless installation using WiFi connectivity and E27 light bulb base     Remote viewing and control from smartphone via LaView app       \n                           Multi-user sharing allows monitoring by family and friends  Compatible with Amazon Alexa and Google Assistant voice controls  IP67 weatherproof rating for indoor and outdoor use      Show more"},{"asin":"B093L455JL","title":"LaView Door Lock with Keypad, Keyless Entry Lock, Electronic Deadbolt for Front Door, Bedroom Garage Auto Lock,1-Touch Motorized Locking, 20 User Codes, Easy to Install Silver","price":"$48.89","saving":"","rating":"4.2 out of 5 stars","reviews":"874 ratings","image":["https://m.media-amazon.com/images/I/71tF6PmNK+L._AC_SY300_SX300_.jpg"],"availability":"In Stock","tag":"","description":"About this item                   🔒[Keyless Entry & 20 Passwords] Opening your door with our keypad lock is much easier than it is with a key when your arm is full of groceries. The keyless entry door lock ensures that you can easily enter your house with passwords of only 4-10 digits.You can also program 20 unique user codes for your family members and friends.Note: Measure your door's backset, cross bore and thickness to ensure you find the right fit     🔒[One-time Code & Auto Lock] This deadbolt lock allows you to set up one-time temporary codes that you can grant your sitter access to while you're away for a trip.The keypad lock also has an auto lock setting if left without operations for 30 seconds, so you don't have to worry about forgetting to lock the door     🔒[Easy Installation & Set Up] You will no longer need expensive locksmiths; we have a detailed installation guide book packed in the box , you can also watch tutorial videos for installation for specific reference; our lock is powered by 4 AA batteries, no hard wiring     🔒[IP54 & Comprehensive Tutorial] This keypad door lock would never fail you; IP54 waterproof, can be used indoors and outdoors, anti-peeping, user password protection, low battery indicator, deadbolt lock core, high-quality metal frame, bring you excellent user Experience     🔒[Wild Style & Good CS] This digital door lock works with doors of any style, and you can consult our customer service for any questions during the installation process which will assist you to solve the problem within twelve hours       \n                    ›  See more product details"},{"asin":"B073177QS8","title":"LIFX Beam Smart Light Bar 6 Piece Kit (L3BEAMKITUS), Multicolor, 6 Count, 33 Watts","price":"$146.46","saving":"-23%","rating":"4.0 out of 5 stars","reviews":"465 ratings","image":["https://m.media-amazon.com/images/I/61VHKn6zlBL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"Amazon's  Choice","description":"LIFX Beam Kit is a Wi-Fi enabled LED modular light surface with millions of beautiful colors—no hub required. You should not install your LIFX Beam Kit on a ceiling or in an upside down position. While the 3M adhesive binds strongly to surfaces it is recommended that you install your LIFX Beam Kit in a safe area"},{"asin":"B08BKZFHQQ","title":"LIFX Color A19 800 lumens, Billions of Colors and Whites, Wi-Fi Smart LED Light Bulb, No Bridge Required, Works with Alexa, Hey Google, HomeKit and Siri (2-Pack)","price":"$39.00","saving":"-22%","rating":"4.5 out of 5 stars","reviews":"2,157 ratings","image":["https://m.media-amazon.com/images/I/711WGqAccXL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"Amazon's  Choice","description":"Meet LIFX Color. A compact smart light that packs a serious 800 lumen punch. The LIFX Color features billions of colors as well as a huge cool-to-warm range of whites. And for anyone who loves an upgrade, take advantage of endless integration options."},{"asin":"B08FWH238Y","title":"LIFX color, A19 1100 lumens, Wi-Fi Smart LED Light Bulb, Billions of colors and Whites, No bridge required, Works with Alexa, Hey Google, HomeKit and Siri multicolor (Pack of 2)","price":"$57.56","saving":"-18%","rating":"4.5 out of 5 stars","reviews":"1,725 ratings","image":["https://m.media-amazon.com/images/I/81VL9KVCfmL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"Meet LIFX Color 1100lm. The LIFX Color is the brightest LIFX product, packing a serious 1100 lumen punch. This light features billions of colors as well as a huge cool-to-warm range of whites. And for anyone who loves an upgrade, take advantage of endless integration options."},{"asin":"B091ZT4L78","title":"LIFX Lightstrip Color Zones, Wi-Fi Smart LED Light Strip, Full Color with Polychrome Technology™, No Bridge Required, Works with Alexa, Hey Google, HomeKit and Siri, 80&quot; Kit","price":"$82.63","saving":"-8%","rating":"4.3 out of 5 stars","reviews":"884 ratings","image":["https://m.media-amazon.com/images/I/71Gfwm2HoaS.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"Meet Lightstrip 80\". A flexible 80\" lightstrip, for highlights and multicolored layouts. Features Polychrome Technology: 8 addressable color zones per light strip, and millions of colors."},{"asin":"B07M8P79TB","title":"Lithonia Lighting WF4 30K40K50K 90CRI MW M6 LED color Temperature Selectable Ultra Thin Recessed Downlight, 3000K 4000K 5000K, White","price":"$24.67","saving":"","rating":"4.7 out of 5 stars","reviews":"1,115 ratings","image":["https://m.media-amazon.com/images/I/31McE7obxFL._SY300_SX300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"The 4-inch round Wafer™ LED Downlight with Switchable White provides high-quality light output and efficiency featuring a switch for easy color temperature adjustment from warm white to daylight during installation - while eliminating the need for recessed housings. The innovative, slim design allows for easy retrofit, remodel or new construction installation from below the ceiling. The Wafer LED downlight is wet location listed – making it ideal for use in a breadth of outdoor residential, hospitality, commercial and multifamily applications."},{"asin":"B07SH2SCQB","title":"Lockly Secure Pro, Wi-Fi Smart Lock, Keyless Entry Door Lock, PIN Genie® Keypad, 3D Biometric Fingerprint Sensor, Voice Control, Auto Lock - Venetian Bronze (PGD628WVB) - Latch Edition","price":"$303.99","saving":"-5%","rating":"4.3 out of 5 stars","reviews":"652 ratings","image":["https://m.media-amazon.com/images/I/61Jh87llnyL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"About this item                   【6-IN-1 SMART DOOR LOCK】Multiple unlocking methods: Patented PIN Genie numeric keypad, 3D biometric fingerprint reader, smartphone app, Alexa or Hey Google voice control, scan-to-open blue QR code or physical key.     【ANTI-PEEK NUMERIC KEYPAD】LOCKLY's patented PIN Genie numeric keypad has four virtual keys, each with three different numbers. You can randomly set a PIN code, and when you open the door lock, the numbers will be randomly scrambled, preventing others from snooping on the code.     【FAST KEYLESS DOOR LOCK】 Fingerprint unlocking, your finger is the key, fingerprint recognition <0.3 seconds, unlocking <0.5 seconds for fast access. No need to worry about forgetting your keys or your mobile phone running out of battery.     【REAL-TIME MONITORING & ALERTS】Smartphone can monitor the lock's open/close status anytime, anywhere; set the auto-lock function, never worry about forgetting to lock the door again; use Lockly app to grant lock codes to family, friends and visitors.     【EASY DIY INSTALLATION】Easy to install with common household tools; Rekeying Function: Replacement cylinders eliminate the need to replace the door lock (with standard rekeying parts); Warranty: Limited 5-year mechanical and finish warranty, 2-year electronic warranty, and lifetime technical support.       \n                    ›  See more product details"},{"asin":"B09GXJM6Z3","title":"Lumary 6 inch Smart Recessed Lighting - Wi-Fi Recessed Lights Ultra-Thin Smart Downlight 13W 1000lm with Junction Box Work with Alexa/Google Assistant/Siri(6 Inch-1PACK)","price":"$31.29","saving":"-13%","rating":"4.1 out of 5 stars","reviews":"1,514 ratings","image":["https://m.media-amazon.com/images/I/71m5150wXOL.__AC_SY445_SX342_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"About this item                   【Voice/BT Remote Controller】 Lumary smart recessed lighting 6 inch work with Alexa and Google Assistant or Remote Controller (sold separately, please search Lumary BT Remote Controller). A simple dialogue/button turns your Lumary LED recessed lights on or off, changes colors and adjusts brightness. Multiple control options for easy daily use.     【High Quality & Easy Installation】Lumary canless LED recessed light is very easy to install. Cut a hole in the ceiling with a 160MM hole template, connect the Jbox to the cable, and use a spring clip to fix it on the ceiling. Ultra-thin body is suitable for outdoor retrofit and new decoration. If you have a very small ceiling space, this light will be your first choice.     【 2700-6500k Adjustable & Brightness】 Lumary 6 inch smart WiFi recessed lights support 1%-100% brightness adjustment, providing warm and cool white from 2700K to 6500K to meet your different lighting needs. (Note: Not compatible with any dimmer switch, it will affect the service life.)     【RGB Adjustable & Music Sync】 Lumary smart WiFi recessed lights provide 16 million colors and 8 scene modes to create the perfect lighting atmosphere. You can DIY the scene mode you want. The recessed light can also change color with the beat of the music or the sound of the game. This feature is only available for APP, with no built-in microphone or speaker.     【Lumary APP Control】Download Lumary App, You just lay on the sofa and you can easily control all of the Lumary black recessed lights 6inch functions through the app, enjoying the convenience and fun of smart lighting. Note: only support 2.4 GHz Wi-Fi.     【Group control】You may control the black smart recessed lighting in several rooms at the same time, such as the living room, kitchen, bedroom, soffit, etc. Save you more time!     【Schedule & Remote Control】You can set this mode to turn on or off the canless Wafer Downlight according to your wake-up and sleep time. When you turn on this mode, you don't have to turn the lights on and off manually. You control your lamps remotely anytime, anywhere through the app.       \n                           【Share the device & Memory Function】You can share the device with your family, and family members can all control the black recessed canless lighting together and enjoy the smart fun. With memory, the function will stay at the last setting you choose while turned on again, no need to reset it.  【APP Connection Use】 ①Download the APP named Lumary and enjoy intelligent control.②Repeat turning the smart wifi LED recessed lights switch on and off 3 times to make the light flash into the paired WiFi mode.③Tap on Add Devices on the home page and the hub will auto-connection. NOTE: Only support 2.4 GHz Wi-Fi.④With memory function will stay at the last setting you choose while turning it on again, no need to reset it.  【After-sales service】Lumary has a professional after-sales team, if you encounter any problems in the follow-up use, please feel free to contact us will provide you with technical support in a timely manner.      Show more"},{"asin":"B01M3XJUAD","title":"Lutron Caseta Deluxe Smart Dimmer Switch (2 Count) Kit with Caseta Smart Hub | Works with Alexa, Apple Home, Ring, Google Assistant | P-BDG-PKG2W-A | White","price":"$169.90","saving":"","rating":"4.8 out of 5 stars","reviews":"4,828 ratings","image":["https://m.media-amazon.com/images/I/51lp0eOCGvL._SY445_SX342_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"Amazon's  Choice","description":"The Caseta Deluxe dimmer kit with Caseta Smart Hub provides simple and personalized control of your lights, shades and temperature. Control your lights from anywhere within your home with the included Pico remote controls or from anywhere in the world using the free Lutron app. Set lights to automatically adjust with spring and fall time changes, create personalized schedules to turn on, off, or dim lights at set times to best fit your everyday routines, or control lights with your voice via Alexa and Siri. The Caseta Smart Hub also connects with other leading brands like Ring, Honeywell, Sonos, Serena shades and more. The included in-wall dimmers install easily with no neutral wire required, provide the best dimming performance for over 500 different dimmable LED bulbs, and can be controlled from anywhere within the home with the included Pico remotes. To use dimmers in a multi-location application, replace the existing switch with a Pico remote control and wall plate adapter (PICO-WBX-ADAPT, sold separately). Pico remote control takes (1) CR2032 battery, included in remote."},{"asin":"B00JJY1QG0","title":"Lutron Caseta Single-Pole/3-Way Smart Lighting Lamp Dimmer and Remote Kit | P-PKG1P-WH | White","price":"$49.95","saving":"","rating":"4.8 out of 5 stars","reviews":"2,749 ratings","image":["https://m.media-amazon.com/images/I/41eZQAm4iLL._SY445_SX342_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"Amazon's  Choice","description":"Conveniently create just the right light for reading, watching TV or entertaining, with the Lutron Caseta plug-in lamp dimmer and Pico smart remote control. The plug-in lamp dimmer simply plugs into a standard outlet and can be used with up to 2 lamps. Control the lights from anywhere in the room by using the Pico remote control either in your hand, on a tabletop pedestal (sold separately) or by mounting the remote directly to the wall. Using a Pico remote control and wallmount bracket (wallmount bracket sold separately), you can add a new \"switch\" to almost any wall surface where there wasn't one before, without cutting holes or pulling wires. The remote lets you turn lights on/off as well as brighten or dim them. The remote also includes a button for saving your favorite light level. This dimmer works with up to 300-Watt of incandescent or halogen, 100-Watt of dimmable LED or dimmable CFL."},{"asin":"B07SGGQLNT","title":"Lutron Caseta Smart Home 5A Switch with Wallplate, Works with Alexa, Apple HomeKit, and Google Assistant | for Ceiling and Exhaust Fans, LED Bulbs, Incandescent and Halogen | PDW-5ANS-WH-A | White","price":"$56.54","saving":"","rating":"4.7 out of 5 stars","reviews":"2,495 ratings","image":["https://m.media-amazon.com/images/I/41Z1ovEIyjL._SY445_SX342_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"Amazon's  Choice","description":"Experience the ultimate convenience in lighting control with Lutron's family of Caseta Wireless dimmers, switches and smart phone control. The Caseta Wireless In-Wall Switch provides switching of multiple load types and, when paired with Pico remote controls, allows remote control from anywhere in the space. Use the Pico remote control either in your hand, on a tabletop pedestal or by mounting the remote directly to the wall (remote control and accessories sold separately). You can even use the Pico remote to control the lights from your car as you arrive home. This switch works with up to 600-Watt of incandescent, halogen, ELV and MLV, 5 amps of LED/CFL and 3.0 amps of general purpose fans. Neutral wire required."},{"asin":"B00JJY0S4G","title":"Lutron Caseta Smart Lighting Dimmer Switch and Remote Kit | P-PKG1W-WH | White","price":"$64.95","saving":"-7%","rating":"4.8 out of 5 stars","reviews":"1,659 ratings","image":["https://m.media-amazon.com/images/I/519ZmbJcbTL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"Experience the ultimate convenience with the Lutron Caseta dimmer and Pico remote control. The wireless dimmer gives you the ability to set the right light for any activity whether it's reading, watching TV, entertaining or having a casual dinner. Control the lights from anywhere in the room by using the Pico remote control either in your hand, on a tabletop pedestal (sold separately) or by mounting the remote directly to the wall. You can even use the Pico remote to control the lights from your car as you arrive home. The remote lets you turn lights ON/OFF as well as brighten or dim them. With the Lutron Caseta Smart Hub and app, you can control your Caseta dimmers with your Smartphone from anywhere. The dimmer works up to 600-Watt of incandescent or halogen and 150-Watt of dimmable LED or dimmable CFL."},{"asin":"B00KLAXNC6","title":"Lutron Caseta Smart Lighting Dimmer Switch for Wall and Ceiling Lights | PD-6WCL-BL | Black","price":"$59.95","saving":"","rating":"4.7 out of 5 stars","reviews":"5,139 ratings","image":["https://m.media-amazon.com/images/I/719i7vrlE0L._SX342_.jpg"],"availability":"In Stock","tag":"Amazon's  Choice","description":"Experience the ultimate convenience with the Lutron Caseta dimmer. The dimmer gives you the ability to set the right light for any activity whether it's reading, watching TV, entertaining, or having a casual dinner. Control the lights from anywhere in the room by using the Pico remote control (sold separately). The dimmer works with up to 600-Watt of incandescent or halogen and 150-Watt of dimmable LED or dimmable CFL. Coordinating wall plate and Pico sold separately."},{"asin":"B00KHSXB60","title":"Lutron Caseta Smart Lighting Lamp Dimmer | PD-3PCL-WH,White","price":"$44.95","saving":"","rating":"4.8 out of 5 stars","reviews":"2,749 ratings","image":["https://m.media-amazon.com/images/I/31gzj640xNS._SY445_SX342_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"Amazon's  Choice","description":"Conveniently create just the right light for reading, watching TV, or entertaining, with the Lutron Caseta plug-in lamp dimmer. The plug-in lamp dimmer simply plugs into a standard outlet and can be used with up to two lamps. Control the lights from anywhere in the room by using the Pico remote control (sold separately). Using a Pico remote control and wallmount bracket (both sold separately), you can add a new \"switch\" to almost any wall surface where there wasn't one before, without cutting holes or pulling wires. This dimmer works with up to 300-Watt of incandescent or halogen, 100-Watt of dimmable LED or dimmable CFL."},{"asin":"B017LRCGR4","title":"Lutron Caseta Smart Lighting Switch for All Bulb Types or Fans | Neutral Wire Required | PD-6ANS-LA | Light Almond","price":"$59.95","saving":"","rating":"4.8 out of 5 stars","reviews":"2,727 ratings","image":["https://m.media-amazon.com/images/I/71igQvNtv6L.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"Amazon's  Choice","description":"Experience the ultimate convenience in lighting control with Lutron's family of Caseta dimmers, switches, and smart phone control. The Caseta by Lutron In-Wall Switch provides switching of multiple load types and, when paired with Pico remote controls, allows remote control from anywhere in the space. Use the Pico remote control either in your hand, on a tabletop pedestal or by mounting the remote directly to the wall (remote control and accessories sold separately). You can even use the Pico remote to control the lights from your car as you arrive home. This switch works with up to 720-Watt of incandescent, halogen, ELV and MLV, 6 Amp of dimmable LED/CFL and 3.6 Amp of general purpose fans. Neutral wire required. Coordinating wall plate sold separately."},{"asin":"B003WGU2MU","title":"Lutron Caseta Wireless Pedestal for Pico Smart Remote, L-PED1-WH, White","price":"$9.97","saving":"-23%","rating":"4.9 out of 5 stars","reviews":"1,544 ratings","image":["https://m.media-amazon.com/images/I/41Wij6hPyYL._AC_SX425_.jpg"],"availability":"In Stock","tag":"Amazon's  Choice","description":"For easy access and added convenience, mount your Pico remote on this modern tabletop pedestal. Place the pedestal on your coffee table or leave it on your nightstand and control your lights or shades without having to leave the comfort of your couch or bed. The Pico smart remote (sold separately) can be used to control Lutron Caseta dimmers and Serena Motorized Shades."},{"asin":"B08YPFFM58","title":"Lutron Caséta Weatherproof+ Outdoor Smart Plug On/Off Switch | Works with Alexa, Google Assistant, Ring, Apple HomeKit (Smart hub Required) | for Landscape and String Lighting | PD-15OUT-BL | Black","price":"$79.95","saving":"","rating":"4.8 out of 5 stars","reviews":"1,080 ratings","image":["https://m.media-amazon.com/images/I/51dv+GhOpSL._AC_SY300_SX300_.jpg"],"availability":"In Stock","tag":"","description":"The Caseta Weatherproof+ Outdoor Smart Plug is IP66-rated, which means it is protected against dust, dirt, and severe rainfall. It is built to last, rated to withstand temperatures from -4 to 122 F, and its black, polycarbonate body delivers long-term durability, UV resistance, and full protection of its internal electronics. Smart home - meet your smart yard. With the Lutron Caseta Smart Hub (L-BDG2-WH, sold separately), you can toss your traditional timer - effortlessly schedule and control your outdoor lights year-round, without any need for manual adjustments. The plug will not lose its place as the sun rises and sets, as the seasons change, and as you gain or lose an hour with Daylight Savings. The plug is perfect for landscape lighting, patio string lighting/holiday lights (1,000s of ft of LED and 100s of ft of incandescent), as well as inflatables, and small pumps and motors (up to 1/2 HP). You can also add a Lutron Caseta Smart Hub (sold separately) to unlock smart control of your Outdoor Smart Plug. The Plug works with Alexa, the Google Assistant, Apple Home, Ring, and more. Control the plug in a variety of ways, via your preferred voice assistant, the Lutron app, or a Pico remote (sold separately)."},{"asin":"B005WM3ALC","title":"Lutron Maestro Motion Sensor Switch | 2 Amp, Single Pole | MS-OPS2-WH | White","price":"$19.95","saving":"-13%","rating":"4.6 out of 5 stars","reviews":"12,479 ratings","image":["https://m.media-amazon.com/images/I/61MCZuwG0jL._AC_SX425_.jpg"],"availability":"In Stock","tag":"#1 Best Seller","description":"Let Lutron's Maestro Occupancy/Vacancy Motion Sensor Switch turn the lights on and off for you. This sensor is a simple way to save energy and add light automation to any room of your home, turning lights on when you enter the room and off when you exit. It features XCT (cross-correlation) sensing technology to detect fine motion, such as typing at a desk or reading a book, to ensure lights won't turn off inadvertently when you're still in the room. It also learns your preferred natural light level and keeps lights off with smart ambient light detection. Program your lights to turn off 1, 5, 15, or 30 minutes after you leave the room. Alternatively, you can set the motion sensor to vacancy-only mode to only turn off the lights when you leave a room, to meet Title 24 requirements. Great for many locations such as bathrooms, laundry rooms, kitchens, and garages for added convenience and energy savings. This sensor works with any bulb type, including CFL and LED. It matches the entire Maestro product family line (sold separately) to give you a complete and coordinated look in your home. Install using the ground wire if no neutral is available in your home. Coordinating Claro wall plate and accessories sold separately."},{"asin":"B089QXQCT1","title":"Lutron P-BDG-PKG2WS-WH Caseta Deluxe Smart Switch Kit, Compatible with Alexa, Apple HomeKit, and The Google Assistant, White, 2.88H X 5.5L X 10.13W","price":"$159.95","saving":"","rating":"4.7 out of 5 stars","reviews":"2,495 ratings","image":["https://m.media-amazon.com/images/I/41qO0WLFHnS._SY445_SX342_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"Ensure you and your family always enter a well-lit home. Use the smart switch to set your front porch lights to turn on at dusk, ensuring your home is not dark when you return. Create personalized schedules to turn lights on and off at set times to best fit your everyday routines and activate customized lighting scenes with just the touch of a button. Schedule your outdoor lights to turn on every night, as the sun sets - even when the seasons change and you gain or lose an hour. The geofencing feature allows you to never have to worry that you forgot to turn off the lights - set your lights to instantly turn off the minute you leave your home.Caseta allows you to control your lights, your way - use the free app, your voice (voice assistant and Caseta Smart Hub required), the wireless Pico remote, or the switch at the wall itself. The smart switch also allows you to control multiple styles of bulbs at once - control your deck and patio lights all at once to transform your outdoor living space for your family and guests. For added convenience, use your smart switch with the included wireless Pico remote to turn your lights on or off with the simple touch of a button from anywhere in your home. Add an extra point of control and mount your Pico to virtually any surface with the included Pico wall mount bracket, no cutting holes or pulling wire required."},{"asin":"B0CJBX32WV","title":"meross Outdoor Dimmer Plug, Outdoor Smart Plug Works with Apple Home, Alexa, Google Home, SmartThings, 2.4Ghz WiFi Smart Dimmer Plug for String Lights with Voice & Remote Control, Schedule & Timer","price":"$28.99","saving":"","rating":"4.4 out of 5 stars","reviews":"2,658 ratings","image":["https://m.media-amazon.com/images/I/41YgymdQwtL._SY445_SX342_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"About this item                   1%-100% Dimmable & Voice Control: The wifi outdoor plug can adjust the brightness level from 1-100% via the Home app or Meross app, and available 10%, 20%, 30%, 50% and 100% respectively with hardware button. You can also easily dim outdoor lights by sending that voice commands like “Hey Siri, set my yard lights to 50%”.     Remote Control & Local Control: Simply plug in a device and control the weather-resistant outlet with the Home app or Meross app, remotely adjust the brightness or turn on/off from anywhere with 2.4 GHz Wi-Fi Internet access at any time. Additionally, enjoy millisecond response and no drop-off with superfast local control when you're at home. NO hub required.     Schedule & Routine Offline Execution: You can create customized schedules(including sunrise and sunset) according to your daily routines, the schedules can still perform even if the internet is down. Not only more convenient but also energy-saving and environmentally friendly.     Multi-compatible & Safety: The wifi plug is compatible with a variety of light bulbs: LED CFL and INC (Max Power: 150W for LED & CFL, 400W for INC.). FCC certified, equipped with fire-retardant housing for safety use. Note: Make sure to use dimmable lights for dimmer function.     Weatherproof & Wide Application: IP44 weatherproof housing and sockets cover help to protect your dimmer plug against splashes of water and dust. Designed for indoor and outdoor use. Ideal for Garden, Backyard, Christmas tree, Holiday lights, Kitchen, Landscape lighting, Bathroom, Porch, Balcony, Garage, Basement, Patio, etc. Do not use it for a pump.     For Android users: It works with any Android smartphone or tablet with OS 4.1 or higher. Android users will have an effortless experiences when configure with Meross app. Then skill 'meross' with your smart speakers as you wish."},{"asin":"B08BFGRY9C","title":"meross Outdoor Smart Plug, Outdoor Wi-Fi Outlet with 3 Independent Sockets Compatible with Apple Homekit, Alexa and SmartThings, Voice & Remote Control, Timer, 2.4 GHz only","price":"$32.99","saving":"-11%","rating":"4.3 out of 5 stars","reviews":"4,289 ratings","image":["https://m.media-amazon.com/images/I/41cV9rRaqgL._SY445_SX342_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"Amazon's  Choice","description":"About this item                   3 Independent Outlets Design: Equipped with 3 individually controlled sockets. 3 outlets WORK INDEPENDENTLY of one another. Powered by Mediatek IoT chipset, meross outdoor smart outlet has longer Wi-Fi connection range and lower offline rate. Please also make sure connect your Phone to 2.4GHz home Wi-Fi while setting up the outdoor Wi-Fi plug.     Ideal for Outdoor Use: IP44 weatherproof housing and sockets cover which help prevent rain from getting in. Outdoor smart plug is made for Garden, Backyard, Christmas tree, Kitchen, Landscape lighting, Bathroom, Porch, Balcony, Garage, Basement, Patio or Electric grill, Sprinkler, Lamps and other outdoor or indoor-use electric appliances, etc. DO NOT USE IT FOR PUMP and EXTREME CONDITION     Remote Control: To enable HomeKit remote control, you need a HomePod, an Apple TV 4K, Apple TV HD. Set any of these Apple devices in your house as a HomeKit bridge and connect it to your home Wi-Fi network. Keep in mind that once your HomeKit bridge is set up, it has to be kept online. If it is powered off or disconnected from the Wi-Fi, it will fail to respond when try to control the device remotely.     Schedule and Timer: Schedule each socket to turn on and off automatically. You can prepare your schedule in advance and will not forget to turn off the outdoor plug, decreasing electrical waste and environmentally friendly. Support sunrise and sunset setting.     Voice Control: Control your devices via voice command, Note: HomeKit remote control requires additional Apple device as a home hub such as HomePod or Apple TV. Control your devices via voice command, just say:“Hey siri, turn on the Sprinkler.”     For Android users: It works with any Android smartphone or tablet with OS 4.1 or higher. Android users will have an effortless experiences when configure with Meross app. Then skill 'meross' with your smart speakers as you wish."},{"asin":"B00O4CV856","title":"MiLocks DF-02AQ Electronic Keyless Entry Touchpad Deadbolt Door Lock, Antique Brass","price":"$46.40","saving":"","rating":"4.1 out of 5 stars","reviews":"2,729 ratings","image":["https://m.media-amazon.com/images/I/81dfj+HAHwL._AC_SY300_SX300_.jpg"],"availability":"In Stock","tag":"","description":"No more need for extra keys, experience the advantages of a keyless entry lock for your home at a very affordable price. This keyless touchpad entry deadbolt allows you to unlock your door using a unique passcode. You can add up to 6 users and delete individual users if needed. Besides having your own personal passcode, it's also great for temporary house guest and service personnel. The backlit touchpad easily lights up with the push of a button and facilitates operation in the night time. This deadbolt is a direct replacement for your traditional deadbolt and installs just as easy on both left handed doors and right handed doors 1 1/4\"- 1 7/8\" thick. (up to 2.25\" with extension kit available from manufacturer) It includes an adjustable latch with 2 different backset settings of 2 3/8\" and 2 3/4\" and features audible tones when locking, unlocking, and low battery warning. Operates on 4 \"AA\" batteries which are not included.."},{"asin":"B095KV6RFY","title":"Philips Hue Smart 100W A21 LED Bulb - White and Color Ambiance Color-Changing Light - 1 Pack - 1600LM - E26 - Indoor - Control with Hue App - Works with Alexa, Google Assistant and Apple Homekit","price":"$64.98","saving":"","rating":"4.6 out of 5 stars","reviews":"3,564 ratings","image":["https://m.media-amazon.com/images/I/61ibAm31w-L.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"Go bright by giving your largest spaces this bright, colorful smart light. With a brightness equivalent to a traditional 100 W bulb, this bulb can tastefully illuminate living rooms, kitchens, and more with color. Dimmable features allow you to control the level of brightness. Own our Hue Hub? You can set timers to dim your smart bulbs as the day goes by."},{"asin":"B07WVNBWJH","title":"Philips Hue Smart 50W GU10 LED Bulb - White and Color Ambiance Color-Changing Light - 1 Pack - 400LM - Indoor - Control with Hue App - Works with Alexa, Google Assistant and Apple Homekit","price":"$49.99","saving":"-9%","rating":"4.7 out of 5 stars","reviews":"856 ratings","image":["https://m.media-amazon.com/images/I/617PuqdQW8L.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"Experience ultimate smart lighting control and bring vintage style to your smart home with this fully dimmable smart light bulb featuring a coiled filament design. The smart bulb can be used with Bluetooth or paired with a Philips Hue Hub (sold separately) for ultimate smart lighting control."},{"asin":"B0B8QVDR7P","title":"Philips Hue Smart 6-Inch LED Downlight, 1100LM - White & Color Ambiance, Control with Hue App - Works with Alexa, Google & Apple Homekit","price":"$49.88","saving":"-17%","rating":"4.6 out of 5 stars","reviews":"1,732 ratings","image":["https://m.media-amazon.com/images/I/51RvRVa2VuL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"This Philips Hue White and color ambiance E26 smart retrofit LED 5/6 inch downlight 1-pack for recessed cans offers millions of shades of warm-to-cool white and color changing light to transform your home decor and the way you feel. This 12W smart RGB downlight features Bluetooth capability for instant light control in one room and offers up to 1100 lumens of brightness. Bluetooth makes it easy to get started with Philips Hue. Simply screw in the bulb, download the Hue app and start enjoying the convenience of smart lighting immediately. Dim, brighten, and set the mood right out of the box. With Bluetooth you can control up to 10 lights in a single room. It's easy to have the right light for routines throughout the day with Hue light scenes. Or create the ultimate mood lighting with dynamic light effects that show subtle changes in color or brightness that you can customize in the app. Looking for smart recessed downlights that work with Alexa and Google Assistant? It's easy to set up voice control with the Hue app and use simple voice commands to control your lights. Whether you need smart LED lights for bedrooms, your living room, or kitchens, Hue complements your room decor while offering the convenience of smart control. Already have a Bridge or want to get more from your Hue system? Connect them to a Hue Bridge (sold separately) to unlock the full power of Philips Hue, including the ability to control up to 50 lights and accessories, automations, and smart control from anywhere in the world."},{"asin":"B07QWB3J8W","title":"Philips Hue Smart 60W A19 LED Bulb - Soft Warm White Light - 4 Pack - 800LM - E26 - Indoor - Control with Hue App - Works with Alexa, Google Assistant and Apple Homekit","price":"$49.99","saving":"","rating":"4.7 out of 5 stars","reviews":"39,492 ratings","image":["https://m.media-amazon.com/images/I/61TphR55n9L.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"Only 1 left in stock (more on the way).","tag":"","description":"New to smart lighting? Get started with easy smart lighting with this Hue smart bulbs Just using Bluetooth, without the Hue Hub, you can control up to 10 lights in 1 room. Comfy on the couch? No need to get up to change your lights. Control your lights using the (free) Hue Bluetooth app or with just your voice with Alexa or Google Assistant. Works with all Echo smart speakers/displays and Google Nest devices, (Hue Hub required for Echo (1st Gen) and Echo Dot (1st Gen)). Certified for Humans: struggle-free, tinker-free, stress-free. No patience needed-they’re actually simple. Want to upgrade your whole home with smart lighting? Add a Hue Hub to control up to 50 light points, get access the full Hue capabilities (Home and away control, timers/routines, more smart home partners) and extended product portfolio (indoor/outdoor smart lighting and accessories). Already a Philips Hue customer? This bulbs is also compatible with the Hue Hub. Philips Hue, the creator of Smart Lighting, brings you the most comprehensive, up-to-date and secure smart lighting ecosystem."},{"asin":"B095KSHGYW","title":"Philips Hue Smart 75W A19 LED Bulb - White and Color Ambiance Color-Changing Light - 1 Pack - 1100LM - E26 - Indoor - Control with Hue App - Works with Alexa, Google Assistant and Apple Homekit","price":"$54.98","saving":"","rating":"4.6 out of 5 stars","reviews":"12,348 ratings","image":["https://m.media-amazon.com/images/I/71jAmbyN1UL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"Go bright by giving your largest spaces this bright, colorful smart light. With a brightness equivalent to a traditional 75-Watt bulb, this bulb can tastefully illuminate living rooms, kitchens, and more with color. Dimmable features allow you to control the level of brightness. Own our Hue Hub? You can set timers to dim your smart bulbs as the day goes by."},{"asin":"B07GX9YG1H","title":"Philips Hue Smart Play Light Bar Base Kit, Black - White & Color Ambiance LED Color-Changing Light - 1 Pack - Requires Bridge - Control with App - Works with Alexa, Google Assistant and Apple HomeKit","price":"$89.99","saving":"","rating":"4.7 out of 5 stars","reviews":"11,254 ratings","image":["https://m.media-amazon.com/images/I/71ceMUf31yL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"Amazon's  Choice","description":"Connect it to Hue Hub (sold seperately) in order to control lights with your Hue App, Voice or Smart Home device. Compact design, full light experience. Create a vibrant ambiance with the Hue Play light bars. Choose from 16 million colors to experience different light effects. Lay it on the floor, let it stand on the cabinet, or mount it on the back of the TV and paint your wall with light. Sync your lights to music or movies using the Hue Sync app. This base kit provides 1 black Play light bars with 80-inch cable 1 table stand with screw 1 mounting clip with double-sided tape (suitable for TV) 1 power supply unit (suitable to connect up to 3 Play light bars) 1 Allen wrench. Requires the Hue Hub (sold Separately) for the full Hue experience and to take advantage of voice activation. Purchase the Philips Hue Hub (Model: 458471). Search \"Philips Hue Hub\" or \"B016H0QZ7I\" to find this product on Amazon."},{"asin":"B0BCXGLT1H","title":"Philips Hue Smart Slim 6 Inch LED Downlight - White and Color Ambiance Color-Changing Light - 1 Pack - 1200LM - Indoor - Control with Hue App - Works with Alexa, Google Assistant and Apple Homekit","price":"$59.99","saving":"-14%","rating":"4.6 out of 5 stars","reviews":"1,732 ratings","image":["https://m.media-amazon.com/images/I/71P7y669VZL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"The new Philips Hue slim downlight makes it possible to add downlights to any room in your home — especially where traditional can lights just can't fit."},{"asin":"B0BBXRX8H2","title":"Philips Hue White and Color Ambiance BR30 LED Smart Bulbs (Bluetooth Compatible), Compatible with Alexa, Google Assistant, and Apple HomeKit, 1-Pack","price":"$54.98","saving":"","rating":"4.7 out of 5 stars","reviews":"617 ratings","image":["https://m.media-amazon.com/images/I/71jzEYjv2eL._AC_SX425_.jpg"],"availability":"In Stock","tag":"","description":"Philips Hue White and Color Ambiance BR30 LED Smart Bulb (Bluetooth Compatible), Works with Amazon Alexa, Google Assistant, and Apple HomeKit"},{"asin":"B08NC347QB","title":"Prominence Home 51474-01 Ashby Ceiling Fan with Remote Control and Dimmable Integrated LED Light Frosted Fixture, 52&quot; Contemporary Indoor, 5 Blades, Champagne","price":"$156.18","saving":"-8%","rating":"4.4 out of 5 stars","reviews":"2,563 ratings","image":["https://m.media-amazon.com/images/I/51HcdCMgWuL._AC_SX425_.jpg"],"availability":"In Stock","tag":"","description":"Sleek and modern with a glamorous flair, the 52-inch Prominence Home Ashby will easily become a conversation starter in any room it graces. This chic ceiling fan features a dazzling champagne finish with 5 reversible blades expertly designed to enhance the look and provide the perfect complement to your piece. These blades feature a white finish on one side and a honey oak finish on the other. Adjusting the blades is easy and the choice is yours! Its spherical housing features a powerful integrated LED globe with the lumens to light up a room but dimmable to create the perfect ambiance for your mood. The robust motor and design provide adjustable, reversible air movement that is ultra-efficient whether you want to cool down on those sweltering summer days or circulate warm air in the cold months of winter. The included remote controls the power, 3 speed settings of the fan, the reversible airflow and light for the ultimate convenience. To ensure your long-term satisfaction, this fan is backed by a limited lifetime warranty. The Prominence Home Ashby gives you all the quality functions you deserve while providing the impressive eye-catching style you crave."},{"asin":"B0B89L2WNV","title":"SAMSUNG 32&quot; M80B 4K UHD HDR Smart Computer Monitor Screen with Streaming TV, SlimFit Camera Included, Wireless Remote PC Access, Alexa Built-In, LS32BM805UNXGO, White","price":"$449.99","saving":"-5%","rating":"4.0 out of 5 stars","reviews":"972 ratings","image":["https://m.media-amazon.com/images/I/51x5-SodZYL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"Amazon's  Choice","description":"Watch, work and chat, all without connecting a separate PC, with the Smart Monitor. Your favorite content, productivity and video call apps are built-in. Access Streaming apps like Netflix, YouTube, Apple TV, Disney + and local OTT (i.e Hulu, Xfinity Stream) directly from monitor. USB-C offers a single connection architecture for a clutter-free setup. Access the Internet without a PC. Slim Fit Camera comes included. Wirelessly connect to and mirror PCs remotely for a PC-less environment. Easily control all in-home IoT devices and control monitor by voice with built-in voice assistants including Bixby and Amazon Alexa. *App availability may vary by country and separate subscriptions may be required. Requires internet connection and TV tuner is not included. Samsung TV Plus and Universal Guide may not be available in some regions. Remote control specifications may vary by country. Product color availability may vary by country. **Apple TV+ may not be available in all regions. ***On-screen content simulated for demonstration purpose. Microsoft 365 requires Microsoft account. Wireless DeX supported on selected Galaxy, Note, and Tab devices. Windows 10 Pro, Mac OS 10.5, or higher, and compatible network settings are required for this feature. Product color availability may vary by country. ****Available technology, functions and features may vary by country, service provider, network environment or product, and are subject to change without notice. Requires a Wi-Fi, Bluetooth or other wireless network connection and devices registered to SmartThings app. Connected devices are sold separately. For full compatible device list, please check https://www.smartthings.com/products. *****Amazon, Alexa and all related marks are trademarks of Amazon.com, Inc. or its affiliates. Bixby voice commands recognize English (US/UK/IN), French, Spanish, German, Italian, Portuguese(BR), Chinese (in China mainland only) and Korean. ******Product color availability may vary by country."},{"asin":"B0CCBXRYRC","title":"SAMSUNG Galaxy SmartTag2, Bluetooth Tracker, Smart Tag GPS Locator Tracking Device, Item Finder for Keys, Wallet, Luggage, Pets, Use w/Phones and Tablets Android 11 or Later, 2023, 1 Pack, Black","price":"$29.99","saving":"","rating":"4.2 out of 5 stars","reviews":"885 ratings","image":["https://m.media-amazon.com/images/I/61PzhW9vK4L.__AC_SY300_SX300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"*Requires Samsung Galaxy smartphones or tablets running Android 11.0 or later with 3GB or more of free RAM; user must opt-in to the SmartThings Find App and be logged in to Samsung Account. Bluetooth range of up to 120m without obstacles; if Galaxy SmartTag2 is out of range, Find Network will be used to track (Find Network accuracy based on opt-in Galaxy users who are in-range of the SmartTag). **Consistent with IP67 rating, water resistant in up to 1M (3 feet) of water for up to 30 minutes. Rinse residue / dry after wet. ***Expected performance based on typical use with in-box CR2032 battery. Actual battery life may vary depending on different usage patterns, environmental conditions, the replacement battery manufacturer, and other factors. ****Requires Bluetooth, range up to 120m without obstacles; accuracy may be reduced if there's an obstacle between you and the tag, such as when the tag is inside a drawer, behind a wall, or in a car. Samsung account long-in and registration on SmartThings Find App is required. *****Only available with ultra-wideband (UWB) enabled Galaxy smartphones running Android 11.0 or higher (Galaxy Note20 Ultra, S21+ and Ultra, S22+ and Ultra, S23+ and Ultra, Z Fold2 and up). Samsung account long-in and registration on SmartThings Find App is required. ******Through the SmartThings app, allows 2 pre-set conditions at a time. A pre-set condition can be either an IoT device or a SmartThings routine. *******Non-Power Saving Mode expected battery life under typical usage conditions is up to 500 days. Power Saving Mode is limited to basic Bluetooth finding functions (for example, Search Nearby signal indicator and map)."},{"asin":"B07HXNBWVV","title":"Schlage Encode Smart Wi-Fi Deadbolt with Camelot Trim in Aged Bronze","price":"$239.47","saving":"-20%","rating":"4.5 out of 5 stars","reviews":"13,475 ratings","image":["https://m.media-amazon.com/images/I/61ukDykbeyL._AC_SX425_.jpg"],"availability":"In Stock","tag":"","description":"Schlage Encode Smart WiFi Deadbolt offers peace of mind from anywhere by allowing you to remotely manage your lock via the Schlage Home app or Key by Amazon app. There’s no need to purchase an extra accessory/hub to connect to your lock from anywhere it will connect to your home’s WiFi signal similar to your laptop, making it easy and intuitive to use. Graded best in security, durability and finish by industry experts, Schlage Encode Smart WiFi Deadbolt offers the advanced features of secure encryption and built-in alarm technology. This innovative smart deadbolt is available in a variety of styles and finishes that pair perfectly with Schlage interior door hardware, creating a cohesive look throughout the home. Backed by a limited lifetime mechanical/finish warranty and 3-year electronics warranty, as well as the strength and durability you can expect from a brand with more than 95 years of experience."},{"asin":"B091GCJ4RT","title":"Sengled Alexa WiFi Light Bulb - Smart Bulbs That Work with Alexa/Google Assistant, A19 Daylight (5000K) - No Hub Required, 800LM 60W High CRI)90 Equivalent, Pack of 4","price":"$20.40","saving":"-15%","rating":"4.2 out of 5 stars","reviews":"17,446 ratings","image":["https://m.media-amazon.com/images/I/61akqzq0WyS.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"Amazon's  Choice","description":"About this item                   Voice Control: Sengled WiFi Classic smart bulbs that work with Alexa and Google Assistant. Control your smart light bulbs via voice commands to turn your smart bulbs on/off, create suitable mood scenes, adjust brightness and more, e.g. Switch on the alexa light bulb before getting out of bed, dim the smart lights from the couch to watch a movie..Special Features:No Hub Required,Works with Alexa & Google Assistant,App & Remote Control,Voice Command Control,Set Scenes & Schedules     Remote Control: Enhance your smart home with WiFi light bulbs, controlled remotely wherever you are. Set timers and light schedules, automating your smart lights to make it seem like someone is home, even when you are away. You can also create a group for all of your alexa light bulbs, and easily group control your smart light bulbs with Alexa devices or Google Assistant players.     Schedule Feature: Easily setup via using Sengled Home App (iOS and Android), turn smart light bulb on/off, dim smart bulb to the desired brightness and set up schedules from anywhere. Program timers and routines to automate your entire smart home lighting setup. Control your smart light bulbs while away from home. Dimensions: 2.42 in (diameter), 4.41 in (height)     Wake Up & Sleep Mode: Easily setup via using Sengled Home App (iOS and Android). Schedule your smart lights to slowly light up. Starting at the set time, the smart bulbs will slowly brighten throughout the timespan you set. Your lights will slowly get brighter in the morning. And you can also schedule your lights to simulate a sunset so that you can fall asleep more naturally every evening. Your bulbs will slowly dim over the timespan you set.     No Hub Required: Connect to your home's secure 2.4GHz WiFi network directly (not support 5GHz); No need for a smart hub or extra equipment. All you need is your smartphone, the Sengled Home App and a 2.4GHz WiFi router to start controlling your smart lights from anywhere. Live customer service based in the U.S.     Note: Dimmers reduce the supply of electricity to the bulb, which will negatively impact performance and cause damage to the bulbs. Beam angle 240º       \n                    ›  See more product details"},{"asin":"B091FV4XMC","title":"Sengled Alexa, WiFi, Smart Light Bulbs that Work with Alexa & Google Assistant,A19 Soft White(2700K)No Hub Required,800LM 60W Equivalent HighCRI)90,4Count(Pack of 1)","price":"$19.20","saving":"-20%","rating":"4.3 out of 5 stars","reviews":"7,647 ratings","image":["https://m.media-amazon.com/images/I/51H4GUSoqnS.__AC_SY300_SX300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"From Sengled: Smart Lighting Expert. Lighting up the world since 1997Sengled WiFi Classic Smart Light Bulbs are the simplest way to get started with smart lighting.No hub is required — just install the LED bulb like a standard light bulb and connect it to your home's 2.4GHz Wi-Fi network. Control the bulb through the Sengled Home app (iOS and Android) to manage the smart lights, including adjusting the brightness, setting schedules, creating scenes and monitoring energy.You can also control the lights with your voice when paired to your Amazon Alexa devices or Google Assistant smart speakers."},{"asin":"B0B9GKJ6NC","title":"Sengled Ambient TV LED Backlights with Camera, Smart Strip Light for 50-60 inch TVs PC, (TV Sync Supports Off-line) WiFi RGB Lights, Works with Alexa & Google Assistant, App Control, Vision G2","price":"$71.25","saving":"-11%","rating":"4.1 out of 5 stars","reviews":"1,354 ratings","image":["https://m.media-amazon.com/images/I/811M2Ell1qL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"Amazon's  Choice","description":"From Sengled - Smart Lighting Expert Since 1997.R&D is fully focused on smart home lighting -Sengled integrate seamlessly with alexa Smart Home devices and Google Home to offer beautiful lighting throughout your home.Sengled Vision G2Let us take a look at what advantages it has.(1) Sengled strip lighting compared to the previous generation of camera strip and HDMI BOX, our Brightness is almost 15% higher than them(2) Prefer blue when the TV is not displayed or other base colors can make the visual effect more Calm and Comfortable(3) Off-line Mode: Localized Information Security, When Video Sync or Gaming Sync is on, you can turn off your network. (Remote control still requires a 2.4Ghz Wi-Fi connection, The camera is only used to scan the screen for color.)(4) Remote Control:Even if you're not at home, you can control your strip lighting remotely directly from your Sengled Smart Home APP."},{"asin":"B0C9YZ7T2G","title":"Sengled Dusk to Dawn Light Bulbs, A19 10.5W (75W Eqv.) LED Auto On Off Light Bulbs, 1200 Lumens, E26 Base, 3000K Warm White Bulb for Outdoor Lighting, Pack of 6, UL Listed","price":"$24.37","saving":"","rating":"4.7 out of 5 stars","reviews":"6,055 ratings","image":["https://m.media-amazon.com/images/I/512xjguGojL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"Only 16 left in stock (more on the way).","tag":"","description":"‎✔ Auto On-Off ✔ Dusk to Dawn Light Sensor Bulb ✔ A19 Lamp Shape ✔ 75 Watt Equivalent ✔ 1200 lumen ✔ LED 10.5 Watt ✔ Instant On ✔ Non-Dimmable ✔ Warm White 3000K ✔ No Flicker & Noise-Free ✔ 25000+Hours Lifespan ✔ 3-YEAR Warranty"},{"asin":"B096WXN9VN","title":"Sengled LED Light Bulbs 100W Equivalent, 1500LM Bluetooth Mesh, Smart Bulbs That Work with Alexa Only, A19 5000K Dimmable, High Brightness, No Hub Required, 4 Pack","price":"$39.99","saving":"","rating":"4.3 out of 5 stars","reviews":"19,617 ratings","image":["https://m.media-amazon.com/images/I/61VWkoFOtGL._AC_SX425_.jpg"],"availability":"In Stock","tag":"","description":"From Sengled - Smart Lighting Expert Since 1997, From Sengled - Smart Lighting Expert Since 1997, Sengled smart bulb integrate seamlessly with Alexa smart home devices to offer beautiful lighting throughout your home.Let us take a look at what advantages it has. (1) Remote Control:Even if you're not at home, you can control your smart light bulb remotely directly from your mobile APP.(2 )Dim or brighten color changing light bulb as you like, create a relaxing and comfortable atmosphere.(3) The installation and setup is very simple, it only takes one minute to complete. Campatible with Alaxe assistant only, it is easier to use. Smart flood light bulbs specifications:Lumens: 1500lm dimmable Watts: 12WBase Type: E26Bulb Type: A19Voltage: 120VacColor temperature: DaylightApp: Sengled/Alexa Sengled smart light bulbs are very suitable for people who are just starting to use smart lighting. It is a very good choice. Start your smart lighting lifestyle now."},{"asin":"B08X6C5VWM","title":"Sengled Light Bulb, S1 Auto Pairing with Alexa Devices, Color Changing , Smart Light that Work with , Bluetooth Mesh Smart Home Lighting, E26 60W Equivalent, 800LM, 4-Pack","price":"$35.88","saving":"-10%","rating":"4.3 out of 5 stars","reviews":"3,205 ratings","image":["https://m.media-amazon.com/images/I/610Je3jUYqL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"From Sengled - Smart Lighting Expert Since 1997.Sengled is committed to bringing automated whole-house smart living to your Alexa devices.R&D is fully focused on smart home lighting -Sengled integrate seamlessly with alexa Smart Home devices to offer beautiful lighting throughout your home.The alexa devices list that support to connect directly with The New - Sengled Auto Paring Technology.Echo Plus / Echo Studio / Echo Show / Echo Dot / Echo Frams.. (all after 2016 support Bluetooth gateway Alexa Devices)"},{"asin":"B0892LXT7J","title":"Sengled Motion Sensor Flood Lights Outdoor Dusk to Dawn Security Light Bulbs, E26 PAR38 Motion Activated 3000K Warm White, 1050LM, Waterproof LED Light Bulbs for Porch, Driveways, 4 Pack 4rd Gen","price":"$52.05","saving":"-5%","rating":"4.5 out of 5 stars","reviews":"3,609 ratings","image":["https://m.media-amazon.com/images/I/61MHFt0YT6L.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"Main Features 1. 3000K soft white and 1050 lm brightness 2. Built-in Photocell Sensor, which enables the bulb to stay off during the day and automatically light up at night. 3. Built-in PIR Motion Sensor. When in Motion Detection Mode, it will light on automatically and last for 90 seconds when a moving object was detected in dark condition. 4. Features Always On Mode. This mode enables the bulb to stay on just like ordinary light. 5. It has a 15000 hours lifespan, base on 3 hours/day."},{"asin":"B08TG5X172","title":"Sengled Smart Light Bulbs, Color Changing Alexa/Bluetooth Mesh, Dimmable LED Bulb A19 E26 Multicolor, High CRI, High Brightness, 8.7W 800LM, 1Pack","price":"$12.29","saving":"-18%","rating":"4.5 out of 5 stars","reviews":"63,774 ratings","image":["https://m.media-amazon.com/images/I/61bJvVFwKOL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"From Sengled - Smart Lighting Expert Since 1997.Sengled is committed to bringing automated whole-house smart living to your Alexa devices.R&D is fully focused on smart home lighting -Sengled integrate seamlessly with alexa Smart Home devices to offer beautiful lighting throughout your home.The alexa devices list that support to connect directly with The New - Sengled Auto Paring Technology.Echo Plus / Echo Studio / Echo Show / Echo Dot / Echo Frams.. (all after 2016 support Bluetooth gateway Alexa Devices)"},{"asin":"B09FPQLMNK","title":"Sengled Smart Recessed Lighting, 5/6 inch, S1 Auto Pairing with Alexa Devices, Led Lights, Smart Can Lights Retrofit Work with Alexa, Smart LED Downlight, ‎Multicolor Dimmable, Conversion Kit,1-Pack","price":"$28.22","saving":"-6%","rating":"4.5 out of 5 stars","reviews":"63,774 ratings","image":["https://m.media-amazon.com/images/I/61OhjA0V2KL._AC_SX425_.jpg"],"availability":"Only 8 left in stock (more on the way).","tag":"","description":"From Sengled - Smart Lighting Expert Since 1997.Sengled is committed to bringing automated whole-house smart living to your Alexa devices.R&D is fully focused on smart home lighting -Sengled integrate seamlessly with alexa Smart Home devices to offer beautiful lighting throughout your home.The alexa devices list that support to connect directly with The New - Sengled Auto Paring Technology.Echo Plus / Echo Studio / Echo Show / Echo Dot / Echo Frams.. (all after 2016 support Bluetooth gateway Alexa Devices)"},{"asin":"B092R8HZWC","title":"Sengled Zigbee Smart Light Bulbs, Smart Hub Required, Work with SmartThings and Echo with Built-in Hub, Voice Control with Alexa and Google Home, Soft White B11 Candelabra Light Bulbs 40W Eqv. 2 Pack","price":"$19.67","saving":"","rating":"4.1 out of 5 stars","reviews":"1,463 ratings","image":["https://m.media-amazon.com/images/I/61Ha-6pOFiL._AC_SX425_.jpg"],"availability":"In Stock","tag":"","description":"Sengled LED Vintage Filament Smart Bulb combines timeless design and modern technology to help make your home look and feel smart. Transform your retrostyle lighting fixtures with Amber smart lighting that mimics the warm glow of vintage edison bulb. Impress company with elegance and style. Enjoy smart convenience for your everyday routines. Use the Sengled Home App to turn your smart lights on/off from anywhere anytime, set brightness, schedule wakeup and sleep routines, and use vacation mode for peace of mind. Smart light bulb that works with Alexa and Google Assistant for voice control, and SmartThings for smart home automation."},{"asin":"B08R5FWMCW","title":"Sengled Zigbee Smart Light Bulbs, Smart Hub Required, Work with SmartThings Hub and Echo with built-in Hub, Voice Control with Alexa and Google Home, Color BR30 Smart Flood Light Bulb, 75W 2 Pack","price":"$39.06","saving":"-13%","rating":"4.2 out of 5 stars","reviews":"1,511 ratings","image":["https://m.media-amazon.com/images/I/6155XdRTWrL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"Sengled Smart LED bulbs offer an easy solution to having app-controllable smart lighting in your home. These bulbs enable you to control your lights in multiple ways-on/off, dimming, schedules,etc, Through the Sengled Home app on your phones or through partner programs like Amazon Alexa or Google Assistant."},{"asin":"B0BXZ6KXGG","title":"Sensi Lite Smart Thermostat, Data Privacy, Programmable, Wi-Fi, Mobile App, Easy DIY, Compatible with Alexa, Energy Star Certified, ST25, C-Wire Not Required on Most Systems **New 2023!**","price":"$72.50","saving":"-19%","rating":"4.3 out of 5 stars","reviews":"456 ratings","image":["https://m.media-amazon.com/images/I/41hms-xFcSL.__AC_SY300_SX300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"About this item                   EASY DIY INSTALLATION: Do it yourself fast with a built-in level and simple step-by-step instructions. Works with the HVAC equipment found in most homes. No common wire (c-wire) required on most systems (only required on heat only and cool only systems)     SAVE ABOUT 23% ON HVAC ENERGY*: ENERGY STAR-certified and packed with features that help you save money, including flexible scheduling, geofencing, remote access and usage reports     PRIVACY PROTECTION*: Sensi won’t sell your personal information to third parties or leverage your thermostat activity data for targeting or advertising purposes     CONTROL FROM ANYWHERE: The top-rated mobile app for Android and iOS devices makes it easy to control your comfort from a smartphone or tablet     SMART MAINTENANCE: Sensi can help monitor the performance and efficiency of your HVAC system by delivering usage reports, alerts about your equipment, and maintenance reminders like filter replacement       \n                    ›  See more product details"},{"asin":"B0C82Z9NZX","title":"Simple Designs LF2000-BSN-2PK Floor Lamp with Reading Light 2 Pack, Brushed Nickel","price":"$64.99","saving":"","rating":"4.4 out of 5 stars","reviews":"22,064 ratings","image":["https://m.media-amazon.com/images/I/614S5r39WUL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"A charming, inexpensive, and practical floor lamp two pack set to meet your basic lighting needs. This simple mother/daughter floor lamp two pack set with reading lights features brushed nickel floor lamps with plastic white shades. Perfect for living room, bedroom, office, kids room, or college dorm."},{"asin":"B0B9WQL3FD","title":"Smart Plug Outlet Extender, USB Surge Protector with 3 Individually Controlled Smart Outlets and 3 Smart USB Ports, Works with Alexa Google Home, Wall Adapter Plug Extender for APP Control,15A/1800W","price":"$23.99","saving":"","rating":"4.3 out of 5 stars","reviews":"1,983 ratings","image":["https://m.media-amazon.com/images/I/51veqzsJz7L.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"Smart Plug Outlet Extender, USB Surge Protector with 3 Smart USB Ports and 3 Individually Controlled Smart Outlets, Works with Alexa Google Home, Wall Adapter Plug Extender for APP Control,15A/1800W"},{"asin":"B09YXPKGY2","title":"Solar Lights Outdoor, 3 Head Solar Motion Lights Outdoor with 2500LM 232 LEDs High Brightness, Built-in Bigger Tempered Glass Solar Panel, Sensitive PIR Motion Inductor(2-Pack)","price":"$38.71","saving":"","rating":"4.4 out of 5 stars","reviews":"4,385 ratings","image":["https://m.media-amazon.com/images/I/71pKj-3o7PL.__AC_SY445_SX342_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"About this item                   【Unique Built-in Tempered Glass Solar Panel】 - Different from other resin-based solar panels on the market, Mihani is the first solar light which has built-in tempered glass for solar panel, with built-in large lithium batteries, and its service life is much longer than other products on the market; in addition, the size of the solar panel is 2-3 times that of other products, the conversion rate of sunlight can reach to 30%, so our brightness is much brighter than other products during use.     【Advanced LED High-Brightness Lamp Beads】- Mihani adopts a new generation of high-quality LED chips and bright micro-electric technology. The lamp beads have high power, low power consumption, no light decay and color difference, good color rendering, long LED life, high brightness, and positive color temperature, and the 232 LEDs quality for brighter and more saturated light with up to 2500 lm. You can view the light covered area easily at night.     【Upgraded More Sensitive and Powerful PIR Motion Detector】- Mihani solar light is equipped with improved motion detection chip and detection angle, adopts improved wireless transmission technology to avoid signal interference from other wireless devices, and has built-in PlR motion sensor with high sensitivity. It able to detect up to 180° with a longer sensor length of 30 ft, therefore providing a broader range of lighting.     【Three Lighting Modes & Multi-Scene Use】- Mihani has 3 lighting modes: Permanent On All Night Mode, Smart Brightness Control Mode and Bright Light Mode, and is also a joy to have with its automatic feature that turns on the light at any sign of movement. It can provide the perfect lighting for your porch, backyard, front door, garage, driveway, walkway, steps and more, and even prevent thieves from entering your door to steal things, giving customers confidence in their safety.     【 All-Weather Resistant& Easy Installation】- Made of durable ABS material, our Mihani solar outdoor lights are designed to withstand extreme weather conditions, and the IP65 waterproof rating ensures that our 3-Head solar safety light won't yield in rain, sleet or snow. The mode button also has a unique IP67 waterproof protective cover located on the back of the device. The package comes with 2X Installing Screws and 2X Expansion Anchors for easy installation in minutes.       \n                    ›  See more product details"},{"asin":"B09ZQQZSQZ","title":"SONOFF Zigbee Bridge Pro Hub, ZigBee 3.0 Smart Gateway, APP Control and Multi-Device Management, Compatible with SONOFF Zigbee Devices","price":"$36.84","saving":"","rating":"4.0 out of 5 stars","reviews":"509 ratings","image":["https://m.media-amazon.com/images/I/41BLJCsSf6L.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"About this item                   【Supports adding up to 128 sub-devices】Zigbee Bridge Pro supports adding sub-devices increased from 32 to 128.     【Smart Home Security】Set up home security modes, such as home mode, away mode, and sleep mode. The bridge can be used as a local alarm.     【Local Smart Scene】Timing and scene linkage between Zigbee devices can be executed normally even if the network is disconnected.     【Wi-Fi & Zigbee Dual-protocol Support】Make communication between Zigbee devices and WiFi devices.     【Strong Connectivity, Limitless Possibility 】The Bridge supports to add ZigBee devices that SONOFF has released, like ZBMINI-L smart switch and S26R2ZB smart plug, making your home smarter.       \n                    ›  See more product details"},{"asin":"B07GYQHWYJ","title":"Stiebel Eltron 239223 Tankless Water Heater – Tempra 29 Plus – Electric, On Demand Hot Water, Eco, White, 23","price":"$779.24","saving":"","rating":"4.6 out of 5 stars","reviews":"1,823 ratings","image":["https://m.media-amazon.com/images/I/51m71-yLWBL._AC_SX425_.jpg"],"availability":"In Stock","tag":"Amazon's  Choice","description":"\"The Stiebel Eltron Tempra 29 Plus Tankless Water Heater features exclusive Advanced Flow Control German patented technology invented by Stiebel Eltron to automatically maintain water temperature for constant comfort. It’ll reduce flow slightly if hot water demand exceeds capacity to ensure that hot showers will never be interrupted. Tempra 29 Plus will typically use 15-20% less energy compared to conventional electric tank water heaters. Although, it’s possible to save significantly more energy depending on personal home usage habits. The difference is that conventional tank water heaters continually store hot water, and as a result, lose 15%-20% of the total energy consumed to the environment around them. This is called standby heat loss. Tank water heaters that use gas or oil are even less efficient, because they also lose heat through their vents to the outdoors. Our tankless water heaters do not need venting, and will not store hot water, waiting for you to use it. They operate on-demand to provide continuous and endless hot water when you need it, and not waste energy when you don’t. CERTIFICATIONS INCLUDE - ANSI/UL Std. 499, CSA Std. C22.2 No. 88, ISO 9001, WQA tested & certified against NSF/ANSI 372 for lead free compliance. TECHNICAL SPECIFICATIONS – Single Phase 50/60 Hz; Voltage: 240 V/208 V; Wattage: 28.8 KW/21.6 KW; Min. recommended household electric service 200 A; Amperage draw: 3 x 40 A 3 x 35 A; Number and min. recommended size of circuit breakers: 3 x 35 A (DP); Number of runs and min. recommended wire size (copper): 3 x 8/2 AWG; Max. temperature rises: 92 F/92 F at 1.50 GPM, 87 F/66 F at 2.25 GPM, 66 F/49 F at 3.00 GPM, 44 F/ 33 F at 4.50 GPM, Min. water flow to activate unit: 0.77 GPM/2.9l/min; Weight: 19.0 lb/8.6 kg; Nominal water volume: 0.39 gal/1.5 l; Max. inlet water temperature: 131 F/55 C; Working pressure: 150 PSI/10 BAR; Tested to pressure: 300 PSI / 20 BAR; Water connections: 3/4\"\" NPT.\""},{"asin":"B07GZ3MFBX","title":"Stiebel Eltron Tankless Heater – Tempra 36 Plus – Electric, On Demand Hot Water, Eco, White","price":"$761.25","saving":"-10%","rating":"4.6 out of 5 stars","reviews":"1,823 ratings","image":["https://m.media-amazon.com/images/I/51m71-yLWBL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"\"The Stiebel Eltron Tempra 36 Plus Tankless Water Heater features exclusive Advanced Flow Control German patented technology invented by Stiebel Eltron to automatically maintain water temperature for constant comfort. It’ll reduce flow slightly if hot water demand exceeds capacity to ensure that hot showers will never be interrupted. Tempra 36 Plus will typically use 15-20% less energy compared to conventional electric tank water heaters. Although, it’s possible to save significantly more energy depending on personal home usage habits. The difference is that conventional tank water heaters continually store hot water, and as a result, lose 15%-20% of the total energy consumed to the environment around them. This is called standby heat loss. Tank water heaters that use gas or oil are even less efficient, because they also lose heat through their vents to the outdoors. Our tankless water heaters do not need venting, and will not store hot water, waiting for you to use it. They operate on-demand to provide continuous and endless hot water when you need it, and not waste energy when you don’t. CERTIFICATIONS INCLUDE - ANSI/UL Std. 499, CSA Std. C22.2 No. 88, ISO 9001, WQA tested & certified against NSF/ANSI 372 for lead free compliance. TECHNICAL SPECIFICATIONS – Single Phase 50/60 Hz; Voltage: 240 V/208 V; Wattage: 36 KW/27 KW; Min. recommended household electric service 300 A; Amperage draw: 150 A/132 A; Number and min. recommended size of circuit breakers: 3 x 50 A (DP); Number of runs and min. recommended wire size (copper): 3 x 8/2 AWG; Max. temperature rises: 92 F/92 F at 1.50 GPM, 92 F/82 F at 2.25 GPM, 82 F/61 F at 3.00 GPM, 55 F/41 F at 4.50 GPM; Min. water flow to activate unit: 0.50 GPM/1.9l/min; Weight: 19 lb/8.6 kg; Nominal water volume: 0.39 gal/1.5l; Max. inlet water temperature: 131 F/55 C; Working pressure: 150 PSI/10 BAR; Tested to pressure: 300 PSI / 20 BAR; Water connections: 3/4\"\" NPT.\""},{"asin":"B09YX6X5WW","title":"SYLVANIA Smart Light Bulb, Bluetooth Mesh LED Bulb, Compatible with Alexa & Google Home, BR30 65W Replacement, E26, RGBW Full Color & Adjustable White - 4 PK [2022 Model]","price":"$21.31","saving":"","rating":"4.2 out of 5 stars","reviews":"21,714 ratings","image":["https://m.media-amazon.com/images/I/619L9LoPtuL._AC_SX425_.jpg"],"availability":"Only 3 left in stock (more on the way).","tag":"","description":"Experience intelligent, connected lighting solutions in your home with SYLVANIA SMART+ Bluetooth mesh connected lights and accessories. Easily pair your lights and accessories to an Amazon Echo or Google Home smart speaker for hands-free lighting control. Not compatible with the Echo Dot 1st Generation. No additional hub or hardware is required. Fits standard medium E26 base socket. For indoor use only. Pick one of 16 million colors or customize your white lighting experience with color temperature control (2700K-6500K). Use SYLVANIA SMART+ lighting to add flexibility to your living space, support your well-being, and boost home security when you are away."},{"asin":"B08FRQFZ3B","title":"SYLVANIA Wifi LED Smart Light Bulb, 65W Equivalent Full Color and Tunable White BR30, Dimmable, Compatible with Alexa and Google Home Only - 4 Count (Pack of 1) (75688)","price":"$53.70","saving":"","rating":"4.5 out of 5 stars","reviews":"6,712 ratings","image":["https://m.media-amazon.com/images/I/6152XO5GxQL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"SYLVANIA SMART+ WiFi products provide dynamic and hands-free home experiences by reimagining lighting with just the sound of your voice – anytime, anywhere. Compatible with Amazon Alexa, Siri Shortcuts, and Google Home, SYLVANIA offers reliable illumination designed to simplify and color your favorite home spaces directly from your smartphone or voice command. With dimmable features, you can customize the brightness to match your mood, an occasion, or the time of day. Use simple commands to turn the lights on and off, dim or brighten, or cover rooms in your favorite color. It’s as easy as, “Alexa, turn the lights to indigo,” or say, “Hey Google, dim the lights to 50%.” With set-up in minutes, use the free SYLVANIA SMART+ WiFi App to begin so you can easily start your home experience via voice control and your smart home assistant. Pick from one of the 16 million colors or tune your white lighting temperatures from soothing soft white to an energetic daylight. Rethink, reimagine, and relive your home experience with SYLVANIA SMART+ lighting."},{"asin":"B0BMP76CMX","title":"TP-Link Tapo Apple HomeKit Smart Plug Mini, Compact Design, 15A/1800W Max, Super Easy Setup, Works with Siri, Alexa & Google Home, UL Certified, 2.4G Wi-Fi Only, White, Tapo P125(4-Pack)","price":"$28.99","saving":"-36%","rating":"4.4 out of 5 stars","reviews":"925 ratings","image":["https://m.media-amazon.com/images/I/41jXeZA1-1L._SY445_SX342_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"Amazon's  Choice","description":"Buy with Confidence Founded in 1996, TP-Link is a global provider of reliable networking and smart home devices, involved in all aspects of everyday life. With a proven heritage of stability, performance and value, TP-Link has curated a portfolio of products that meet the networking needs of all individuals. Now, as the connected lifestyle continues to evolve, the company is expanding today to exceed the demands of tomorrow. Industry-Leading Support TP-Link offers 24/7 technical support and 2-year warranty for most home products. TP-Link Tapo Apple HomeKit Smart Plug Mini, Tapo P125 Live smarter with Tapo P125 smart plug to preset and remote control your lamps, fans, humidifiers, and other home electronic appliances. Fully compatible with Apple HomeKit, Alexa and Google Assistant to enjoy hands-free convenience. The Tapo app contains not only all the features you expect from the TP-Link Tapo family but also guidance for you through each installation step to set up your smart plugs. Tapo P125 also provides an easy Bluetooth setup."},{"asin":"B0B2KY8X4M","title":"TP-Link Tapo RGBWIC Smart LED Light Strip 16.4Ft, 1000 Lumens, 16M Dimmable Colors, 50 Color Zones, Works with Apple HomeKit/Alexa/Google Home, Sync-to-Sound, IP44 PU Coating, Trimmable (Tapo L930-5)","price":"$32.99","saving":"-34%","rating":"4.1 out of 5 stars","reviews":"784 ratings","image":["https://m.media-amazon.com/images/I/51LG8xVkzWL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"Buy with Confidence Founded in 1996, TP-Link is a global provider of reliable networking and smart home devices, involved in all aspects of everyday life. With a proven heritage of stability, performance and value, TP-Link has curated a portfolio of products that meet the networking needs of all individuals. Now, as the connected lifestyle continues to evolve, the company is expanding today to exceed the demands of tomorrow. Industry-Leading Support TP-Link offers 24/7 technical support and 2-year warranty for most home products. TP-Link Tapo Smart LED Light Strip, True White Light RGBWIC, Millions Dimmable Colors with 50 Color Zones, Premium Lighting Quality, Sync-to-Sound, Smart Controls, Tapo L930-5 Our TP-Link Tapo Smart RGBWIC LED light strip gives you TRUE White Lighting with 1000 lumens brightness and 16 millions of 1-100% dimmable colors. Fill the millions of blooming colors in your bedroom, game room, office with our smart light strip. Cut the 16.4 ft. smart light strip to perfectly match your bed frame or cabinets, and choose from unlimited lighting effects with 16 million fully dimmable color choices and advanced animations that can match any mood from a party to unwinding before bed. With its 50 adjustable color zones, the customization on your preferred lighting is endless. Pick up sound through your mobile device and set up the perfect party atmosphere. The lights will sync to the frequency and the beat, keeping pace with the rhythm and get all your senses stirred up at a party! The durable PU Coating along the length of the LED strip protects it from moisture so you can install your light strip with peace of mind."},{"asin":"B0B2KWJLZT","title":"TP-Link Tapo Smart Light Bulbs, 16M Colors RGBW, Dimmable, Compatible with Alexa and Google Home, A19, 60W Equivalent, 800LM CRI>90, 2.4GHz WiFi only, No Hub Required, Tapo L530E(4-Pack)","price":"$25.99","saving":"-35%","rating":"4.5 out of 5 stars","reviews":"13,538 ratings","image":["https://m.media-amazon.com/images/I/619Djd3XXzL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"Buy with Confidence Founded in 1996, TP-Link is a global provider of reliable networking and smart home devices, involved in all aspects of everyday life. With a proven heritage of stability, performance and value, TP-Link has curated a portfolio of products that meet the networking needs of all individuals. Now, as the connected lifestyle continues to evolve, the company is expanding today to exceed the demands of tomorrow. Industry-Leading Support TP-Link offers 24/7 technical support and 2-year warranty for most home products. TP-Link Tapo Smart Light Bulbs, 16M Colors RGBW, Tapo L530E(2-Pack) Choose from 16 millions of colors or set the bulb from warm to cool whites(2500K-6500K) thanks to the RGBW true-white LED. Tapo L530E has 220° beam angle for wider coverage, a color rendering index (CRI) > 90 for truly vibrant colors, and a luminous 800LM brightness level. Fully dim the lights from 1%-100% to match the mood anytime of day. Works with Alexa and Google Home."},{"asin":"B07YKFSWJN","title":"TREATLIFE Smart Dimmer Switch 4 Pack, Smart Light Switch Works with Alexa and Google Assistant, Neutral Wire Needed, 2.4Ghz Wi-Fi, Schedule, Remote Control, Single Pole, FCC Listed","price":"$60.79","saving":"","rating":"4.5 out of 5 stars","reviews":"2,294 ratings","image":["https://m.media-amazon.com/images/I/61x+RR5fmZL._AC_SY300_SX300_.jpg"],"availability":"In Stock","tag":"Amazon's  Choice","description":"About this item                   Easy Installation: Neutral Wire is required, no hub needed, standard wall plate size, the smart switch supports up to 150W LED/CFL or 400W incandescent bulbs, Dimmable bulb only, 2.4G Wi-Fi only (NOT 5G); single-pole use only (NOT 3-way). Step-by-step instructions will guide you through the wiring process.     0% - 100% Dimming: The smart dimmer switch can smoothly adjust the brightness from 1% to 100%, it meets the atmosphere needs of special moments in family life. Dim to a gentle glow to enjoy a candlelight dinner with your families. Brightness memory function will remember and turn back on to the last light setting when powered off.     APP & Voice Control: This led dimmer switch Controls the light from anywhere and anytime by the Smart Life/Treatlife App. Light Switch works with Alexa and Google Assistant. The dimmer switches are easy to control the light with a voice command when your hands are not free, \"Alexa, turn on the bedroom light. \"     Home Automation: Treatlife smart light switch creates schedules (timer or countdown) to automatically turn on and off the light based on everyday routines , It is great when you are on vacation to trick potential intruders. Also your family members can control the dimmer light switch by family sharing function.     Reliable use & Good Service: FCC Certified. Flame-retardant material and built-in overheat protection for added safety. Refer to the PDF attached below in Technical Specification for user manual. Any unexpected quality issues, please contact us in time to activate your warranty service, we always stand behind our customers.       \n                    ›  See more product details"},{"asin":"B083BRRZ4Y","title":"TREATLIFE Smart Light Bulbs 4 Pack, UL Certified 2.4GHz Color Changing Light Bulb, Works with Alexa Google Home, A19 E26 Dimmable LED Light Bulb 9W 800 Lumen for Party Decoration, Smart Home Lighting","price":"$29.99","saving":"-25%","rating":"4.4 out of 5 stars","reviews":"17,029 ratings","image":["https://m.media-amazon.com/images/I/71XlG3+OEdL._AC_SX342_SY445_.jpg"],"availability":"Usually ships within 4 days","tag":"Amazon's  Choice","description":"About this item                   Remote Control with Smart App: Use the free App to control your Alexa light bulb from anywhere, anytime. Set schedules and automate your smart lights to make it seem like someone is home, even when you're away. Requires 2.4GHz Wi-Fi for pairing.     Hands-free Voice Control: Control your smart bulb with your voice via Amazon Alexa and Google Home Assistant. Simply say \"Alexa, turn on my living room lights\" or \"Hey Google, dim the led lights to 80%\". Perfect for when your hands are full or when you enter a dark room.     Multicolor & Tunable White: The Treatlife smart bulbs offer 16 million dimmable colors and warm-to-cool whites (2700K-6500K). Create your favorite lighting effects and adjust the brightness as needed. Ideal for decorating your home during holidays like Halloween, Christmas, and Thanksgiving, etc.     Schedule & Group Control: Use the timer or schedule feature to automatically turn your lights on and off, such as waking up to a soft glow in the morning with sunrise offset. You can also share devices and create groups to control all your lights at once.     Multiscene Purposes: DIY your ideal lighting effects with 8 preset scene modes to achieve the perfect atmosphere for any occasion, including movie night, cocktail party, reading, meeting, and leisure, etc. Make your life more colorful with smart LED light bulbs.       \n                    ›  See more product details"},{"asin":"B0BPSKBLXK","title":"ULTRALOQ Latch 5 World's First Built in WiFi Smart Lock (Black) with Fingerprint ID, 5-in-1 Keyless Entry Electronic Door Handle with Bluetooth, Biometric Fingerprint and Touch Digital Keypad","price":"$199.00","saving":"","rating":"4.1 out of 5 stars","reviews":"1,630 ratings","image":["https://m.media-amazon.com/images/I/61CCQOaT01L._AC_SX425_.jpg"],"availability":"Only 3 left in stock - order soon.","tag":"","description":"About this item                   【Multiple Ways to Unlock】World's first built in WiFi keyless entry smart lock, App（Bluetooth&WiFi）+Fingerprint + Code +Mechanical Key.     【Control From Anywhere】With WiFi (2.4GHz, 802.11b/g/N) you can control Smart Lock from anywhere via the U-tec App. Quickly and easily share codes for permanent, temporary or scheduled access with friends, family, and people you trust.     【Fast Fingerprint Response】Your finger is the key. Ultraloq Smart Lock recognizes your fingerprint in just 0.3 seconds. It auto locks behind you after a specified amount of time for extra peace of mind.     【Superior Build Quality】With a sturdy zinc alloy construction, Ultraloq Smart Lock is tested to handle the access of a busy household. With weatherproof exterior lock, Smart Lock is ready to protect your home rain or shine.     【Easy Installation】Ultraloq Smart Lever Lock is designed to ﬁt any US standard interior and exterior door. No wiring and no drilling. The screwdriver is included. Please scroll down and check the \"Installation Tips (PDF)\" before installation. We promise 30 days worry-free return & exchange service. Plus lifetime mechanical warranty and 18 months electronic warranty.       \n                    ›  See more product details"},{"asin":"B07VX8HZB3","title":"UltraPro 10in. Linkable LED Bright Strips, 6 Pack, 1650 Lumens, 2700K Warm White Light, Low Voltage, Under Cabinet Lighting, Strip Light, Flat Plug, 44415","price":"$38.99","saving":"","rating":"4.5 out of 5 stars","reviews":"864 ratings","image":["https://m.media-amazon.com/images/I/81+-o1V8ZvL._AC_SX425_PIbundle-6,TopRight,0,0_SH20_.jpg"],"availability":"In Stock","tag":"Amazon's  Choice","description":"See your home in a whole new light with a set of 6 UltraPro 10inches Linkable LED Bright Strips. With the option to link multiple strips or mount them end to end, homeowners can give their space the perfect amount of light, no matter the size or setup of the room. These low-voltage lighting strips boast a slim, space-saving design for flexible setup possibilities. They also utilize LEDs, which are setting a new standard in economically and ecologically sound lighting. Brighten up your indoor space with UltraPro 10inches Linkable LED Bright Strips."},{"asin":"B075713NNL","title":"Vitamix A3500 Ascent Series Smart Blender, Professional-Grade, 64 oz. Low-Profile Container, Graphite","price":"$574.95","saving":"-12%","rating":"4.7 out of 5 stars","reviews":"3,428 ratings","image":["https://m.media-amazon.com/images/I/81-f3EpuvGL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"Amazon's  Choice","description":"About this item                   Program Settings: Five program settings (for Smoothies, Hot Soups, Dips & Spreads, Frozen Desserts, and Self-Cleaning) ensure walk-away convenience and consistent results. The A3500 pairs with the Vitamix Perfect Blend App: Unlock the Ascent Series A3500's full potential with 17 programs and 500+ recipes with the iOS + Android app.     Touchscreen Controls give the machine a sleek silhouette and are easily wiped clean.Electrical Ratings - 120 V, 50-60 Hz, 12 Amps. Cord: 4 feet. HP: 2.2-peak     You're in Control: Variable Speed Control and Pulse feature let you manually fine-tune the texture of any recipe     Built-In Wireless Connectivity: The motor base is able to read the container size you’ve chosen and automatically adjust program settings and maximum blending times accordingly. Add a range of compatible container sizes, building a customized blending system designed to fit your needs.     Programmable Timer: A built-in timer helps avoid over- or under-processing your custom recipes. Set the timer to the length of your blend, and it will turn the machine off automatically. What's in the Box: motor base, low-profile 64 oz. container, low-profile classic tamper, Simply Blending Cookbook"},{"asin":"B0B762W5FJ","title":"WiZ 6.5FT + 6.5FT RGB Wi-Fi LED Smart Color Changing Light Strip with Plug - Connects to Your Existing 2.4Ghz Wi-Fi - Control with Wiz Connected App - Works with Google Home, Alexa and Siri Shortcuts","price":"$39.12","saving":"-7%","rating":"4.2 out of 5 stars","reviews":"429 ratings","image":["https://m.media-amazon.com/images/I/61wTJaS0nRL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"Amazon's  Choice","description":"About this item                   EASY SETUP - Works with your existing 2.4Ghz Wi-Fi. Download the WiZ Connected app and you're ready to go.     SMART CONTROL - Control from anywhere with the WiZ Connected app or go hands-free with voice control. The app makes it easy to invite family members and guests to control the lights without changing your settings.     EASY TO USE - Simply stick the flexible strip to any surface you like – tray ceilings or under cabinets.     SMART FEATURES - Schedule your lights to turn on or off to fit your routine or set vacation mode to automate your lights even when you are away from home to mimic presence 16 million colors and adjustable from warm white to daylight.     USER FRIENDLY APP - The free WiZ Connected app is intuitive, user-friendly and includes ready to go presets so that you can begin using your lights immediately. Smart lighting is enjoyable and easy with WiZ.​     IMPROVE WELLBEING - Use the preset rhythm features in the WiZ Connected app. WiZ will provide you bright daylight when you need to get energized and focus, and transition smoothly to soft warm white to help you relax and sleep better.       \n                    ›  See more product details"},{"asin":"B0B9SXM3NW","title":"WiZ Portable Button - Pack of 1 - Switch Your Lights On and Off or Brighten and Dim - Works Only with WiZ Smart Lights - Comes with 2 AAA Alkaline Batteries - Control with Wiz Connected App","price":"$24.80","saving":"-20%","rating":"4.3 out of 5 stars","reviews":"1,234 ratings","image":["https://m.media-amazon.com/images/I/71cFdPtep9L._AC_SX425_.jpg"],"availability":"In Stock","tag":"Amazon's  Choice","description":"Control your lights faster than app and voice with the WiZ smart portable button. Place the portable button in any desired location and customize to control or more lights. AAA batteries included for easy and fast setup."}]},{"name":"Home Security Systems","url":"home-security-systems","category":"home-improvement-amp-maintenance-devices","dontInclude":[""],"keyword":[""],"description":"Buy the top quality home security systems at the best prices.","content":[{"asin":"B07NQVWRR3","title":"ecobee Smart Sensor 2 Pack - Comfort, Security, Energy Savings - Smart Home - Compatible with ecobee Smart Thermostats for Home","price":"$99.00","saving":"","rating":"4.7 out of 5 stars","reviews":"7,039 ratings","image":["https://m.media-amazon.com/images/I/513Xb8ggNaL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"About this item                   Place sensors in the rooms that matter most to experience comfort that stays with you     Works with all ecobee thermostats to deliver comfort where it counts and help manage hot or cold spots     Detects motion to deliver comfort when you’re home, save energy when you’re away, and adjust temperature in rooms that are in use     Works with ecobee Smart Security to send notifications when motion is detected     No wires. Installs in seconds     Use the ecobee app to check and adjust the temperature in important rooms like the nursery. For indoor use only. For indoor use only       \n                    ›  See more product details"},{"asin":"B00R7JVFCE","title":"Kwikset 92640-001 Contemporary Electronic Keypad Single Cylinder Deadbolt with 1-Touch Motorized Locking, Satin Nickel, 8 x 4 x 6","price":"$58.92","saving":"","rating":"4.5 out of 5 stars","reviews":"15,535 ratings","image":["https://m.media-amazon.com/images/I/71Mne+8ZWjL._AC_SY300_SX300_.jpg"],"availability":"In Stock","tag":"Amazon's  Choice","description":"About this item                   Keyless entry with a motorized driven deadbolt for 1-touch locking, low battery indication, and easy install with just a screwdriver.Control Method:Application.Note: Measure your door's backset, cross bore and thickness to ensure you find the right fit.     For use on exterior doors where keyed entry and security is needed.Customizable automatic door locking after 10-99 seconds for peace of mind     6 customizable user codes along with temporary codes that can be used just once, perfect for visitors and service personnel     Single cylinder electronic deadbolt operates by keypad or key outside and thumb turn inside, fits door thickness of 1-3/8 in. to 1-3/4 in. Alarm sounds after 5 consecutive entries and the keypad is deactivated for 45 seconds     Includes an adjustable latch to fit all standard door preparations       \n                    ›  See more product details"},{"asin":"B07DQYFVL3","title":"Kwikset 99160-016 SmartCode 916 Modern Contemporary Touchscreen Smart Lock Deadbolt featuring SmartKey Security and Z-Wave Plus, Satin Nickel","price":"$209.00","saving":"","rating":"4.1 out of 5 stars","reviews":"1,147 ratings","image":["https://m.media-amazon.com/images/I/61g011snlfL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"Only 4 left in stock - order soon.","tag":"","description":"About this item                   SECURE KEYLESS ENTRY: Fast and quiet motorized deadbolt with illuminated touch screen provides keyless door entry to your home, and one-touch locking when leaving.Control Method:Voice     SMART HOME READY: Remote access your lock and connect to your Z-Wave security and smart home systems, works with Alexa, Google Assistant, and more, Z-Wave hub required     30 SECOND AUTO-LOCKING: Setup deadbolt to automatically lock after entry or exit, perfect for keeping your hands free and getting in and out in a hurry     EASY PROGRAMMING: Setup keyless door entry with up to 30 programmable unique custom user codes for anytime access, perfect for family, friends, dog walker, etc.     EASY INSTALL: Do it yourself, installs in minutes with just a screwdriver, fits doors between 1-3/8\"\" and 1-3/4\"\" thick, 4 AA batteries last 12 months or longer     PRODUCT WARRANTY: Locks and handles have a lifetime mechanical and finish warranty, and a 1 year electronics warranty; see Kwikset warranty for full details       \n                    ›  See more product details"},{"asin":"B081FXQH96","title":"Kwikset Halo Touchscreen Wi-Fi Smart Door Lock, Keyless Entry Electronic Deadbolt Door Lock, No Hub Required App Remote Control, With SmartKey Re-Key Security, Matte Black","price":"$199.00","saving":"-20%","rating":"4.1 out of 5 stars","reviews":"6,071 ratings","image":["https://m.media-amazon.com/images/I/614DxLZRkRL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"About this item                   CONTROL FROM ANYWHERE: Wi-Fi enabled (no hub required), you can use the Kwikset app to remotely lock and unlock, share guest access, view activity history, and more     SHARE ACCESS WITH GUESTS: Backlit touchscreen with support for up to 250 access codes. Use the Kwikset app to schedule access windows or share one-time codes with guests     SMART HOME INTEGRATION: Works with Amazon Alexa or Google Home, control your lock with your voice, create smart home automations, and manage all your devices     INTRUSION DETECTION: Instant notifications in the Kwikset app alert you of any unusual lock activity, including invalid code attempts or lock tampering     AUTO-LOCK SECURITY: Set a duration for your door to lock automatically after entry or exit, perfect for keeping your hands free and getting in and out in a hurry     EASY INSTALL: Do it yourself, installs in minutes with just a screwdriver, fits doors between 1-3/8\" and 1-3/4\" thick     PRODUCT WARRANTY: Locks and handles have a lifetime mechanical and finish warranty, and a 1 year electronics warranty; see Kwikset warranty for full details       \n                    ›  See more product details"},{"asin":"B01IVTVK3W","title":"LaMetric TIME Wi-Fi Clock for Smart Home - Social Media Counter - Cinema Lightbox - Digital Alarm Clock with Weather - Retro Pixel Art Bluetooth Speaker with 37x8 LED Display","price":"$198.28","saving":"","rating":"4.2 out of 5 stars","reviews":"628 ratings","image":["https://m.media-amazon.com/images/I/816C5vTvKiL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"About this item                   Make your desk setup smart and stylish with a minimalist pixel clock that fits any interior. Express your mood with thousands of versatile clockfaces or create your own. Festive clockfaces automatically come to life on holidays.     Wake up with your favorite Internet radio stations, listen to Spotify, stream your favorite songs to stereo speakers, enjoy the visual equalizer. Show your personality, create a holiday atmosphere or motivate yourself to work with messages in Cinema-Light-Box style.     Track time, weather and timers, get smartphone notifications on the clock when your phone is not at hand. Display RSS news, subscriber count in social media, important dates, e-commerce sales, cryptocurrency rates, get notified about your appointments and a lot more with apps from LaMetric Market, made by the community.     Get smart home notifications from Sonos, Netatmo Weather Station, Bosch, Siemens, Neff, Gaggenau and Thermador home appliances. Toggle Philips Hue, Lifx and WeMo with a click. Voice-control via Amazon Echo or Google Assistant.     Unique and uncommon gift for influencer, gamer or geek. A smart and useful gift for any employee and coworker.     LaMetric TIME supports 802. 11 b/g/n 2.4 GHz Wi-Fi networks."},{"asin":"B07SNYD5PN","title":"Newhouse Hardware 40TR 24-Volt 40vA Wired Door Bell Transformer for Powering Multiple Smart Doorbells and Thermostats, Gold","price":"$25.73","saving":"","rating":"4.3 out of 5 stars","reviews":"571 ratings","image":["https://m.media-amazon.com/images/I/51qgZktwzVL._SY300_SX300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"","description":"About this item                   24VAC/40VA doorbell transformer for powering single or multiple doorbells and thermostats.     Thermal cut-off switch offers an extra layer of safety, shutting off power in the event of excessive temperature. UL Certified.     Quick and easy installation: simply mount to electrical box via threaded connector or screw down     Eliminate issues caused by underpowered transformers: a lack of power, connection issues, low quality video resolution, and low chime volume may be an indicator of an underpowered transformer     Compatible with Ring Video Doorbell Pro, Nest Hello, Nest thermostats, Zmodo Smart Greet Wi-Fi Doorbell, Sky Bell Doorbell, and more. Brands mentioned for compatibility information only.     Input voltage: 120 Vac, 60Hz | Output voltage: 24 Vac at 40VA     Backed by a 2 year manufacturer"},{"asin":"B085FXFS41","title":"Panasonic HomeHawk Window Home Monitoring Camera for Outdoor Monitoring, Mounts to Inside Window, Color Night Vision, Wide Angle, 24/7 Full HD Recording, Person Detection, Alexa Compatible KX-HNC500","price":"$149.95","saving":"","rating":"4.2 out of 5 stars","reviews":"1,556 ratings","image":["https://m.media-amazon.com/images/I/710yIMSYBQL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"Amazon's  Choice","description":"About this item                   MONITOR THE OUTSIDE, FROM THE COMFORT OF INSIDE: Innovative, discreet, compact outdoor camera is mounted indoors. A powerful suction cup adheres camera to virtually any interior window, no drilling or complicated installation.Connectivity : Bluetooth 5.0, Power source: 120 V AC‚ 60 Hz.     CAMERA STAYS SAFE AND CHARGED: Indoor mount protects HomeHawk from the elements and keeps it safe from theft. The camera plugs into a regular outlet, so no more worrying about battery life. Alexa/Google Assistant compatible     CLEAR 1080p HD VIDEO RECORDING WITH BRIGHT COLOR NIGHT VISION: Get a clear, glare-free view day or night with high definition 1080p recording featuring a 150° wide angle view     DETECTS PEOPLE, NOT CARS: Avoid unnecessary motion alerts. Person Detection Technology sees people and filters out the environment. Set a custom detection area for even more control     NO CONTRACTS OR FEES : Local microSDXC card (sold separately) saves 2 seconds of prerecording after any alert, 24/7. No storage fees or contracts"},{"asin":"B0CCZJWD5Q","title":"Ring Video Doorbell with Ring Stick Up Cam (White) and Ring Alarm 8-piece (White)","price":"$399.99","saving":"","rating":"4.6 out of 5 stars","reviews":"186,353 ratings","image":["https://m.media-amazon.com/images/I/41ANLwsaCXL._SY355_.jpg"],"availability":"This item cannot be shipped to your selected delivery location. Please choose a different delivery location.","tag":"Amazon's  Choice","description":"This bundle contains Ring Video Doorbell , Ring Stick Up Cam (White) and Ring Alarm 8-piece (White).     1080p HD video doorbell with enhanced features that let you see, hear, and speak to anyone from your phone, tablet, or PC.     An update from the original Ring Video Doorbell, enjoy improved motion detection, privacy zones and audio privacy, and crisper night vision.     Receive mobile notifications when anyone presses your doorbell or triggers your built-in motion sensors.     Powered by the built-in rechargeable battery or connects to existing doorbell wires for constant power.     Easily setup by connecting your Ring Video Doorbell to wifi through the Ring app and mounting with the included tools.     With a Ring Protect Plan (subscription sold separately), record all your videos, review what you missed for up to 180 days, and share videos and photos.     Pair with select Alexa-enabled devices to enable announcements and two-way talk for convenient in-home monitoring. With a Ring Protect plan (subscription sold separately), Alexa can also make voice announcements and automatically show live video feed on an Echo Show, Fire TV, or Fire Tablet when your Ring doorbell detects a person or package."},{"asin":"B09C9V5JM3","title":"SimpliSafe 7 Piece Wireless Outdoor Camera Home Security System - Optional 24/7 Professional Monitoring - No Contract - Compatible with Alexa and Google Assistant","price":"$418.61","saving":"-7%","rating":"4.0 out of 5 stars","reviews":"440 ratings","image":["https://m.media-amazon.com/images/I/612kL-qbqzL._AC_SX425_PIbundle-7,TopRight,0,0_SH20_.jpg"],"availability":"In Stock","tag":"","description":"About this item                   Simple to set up. Seriously secure - Get ready to protect right out of the box. Outside, wireless cameras alert you when someone is on your property. Inside, sensors protect your doors, windows and more. Just plug in your Base Station, follow the steps in the SimpliSafe App and start protecting your home. No wiring or drilling required. Or contact SimpliSafe directly if you need help installing your system.     1 FREE Month of 24/7 professional monitoring with Fast Protect Technology for fast police response - With optional monitoring services, our agents keep watch even when you can't, ready to instantly alert emergency responders. Starting at 66c/day with no long-term contracts or hidden fees. (SimpliSafe products and professional monitoring services are only offered for sale and supported in the US)     Complete control of your system with the SimpliSafe App - Arm, disarm and protect anytime, anywhere.     Keep watch outside - Wireless Outdoor Cameras have an ultra-wide wide, 140 degree field of view, 1080p HD resolution and color night vision, you can see what's happening outside, 24/7.     Faster police response - When you enable video verification on your SimpliSafe cameras, our professional monitoring agents can use eyewitness evidence to verify a break-in which can mean priority dispatch for faster police response. (Requires Fast Protect Monitoring plan)     Protection for entry points - Entry Sensors protect windows, doors, and cabinets and alert you when someone tries to enter. Customizable and can send Secret Alerts so you are quietly alerted if someone accesses private areas, without sounding an alarm.     One-touch control in the palm of your hand - Key Fob lets you arm and disarm with just the push of a button from up to 30' away. And its built-in panic button offers additional protection as you enter your home.       \n                           Prepared and built for the unexpected - The Base Station has a battery that lasts up to 24 hours and cellular backup so you stay protected even if you lose power or Wi-Fi.  Smash-safe Keypad - Easily arm and disarm your system with a wireless Keypad that you can place anywhere. And backlit buttons light up when you need to see it and go dark when you don't.  Smart home compatible - Arm your system at home with Google Assistant or Amazon Alexa.      Show more"},{"asin":"B09R38VVXF","title":"Wyze Auto-Lock Bolt, Fingerprint Keyless Entry Door Smart Bluetooth Deadbolt Replacement, Backlit Keypad, IPX5 Weatherproof, in-App History and Scheduled Access, BHMA, UL 20-Min Fire Rated","price":"$73.99","saving":"-7%","rating":"4.6 out of 5 stars","reviews":"1,857 ratings","image":["https://m.media-amazon.com/images/I/71YEc7umwoL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"Only 6 left in stock (more on the way).","tag":"Amazon's  Choice","description":"About this item                   Fingerprint Unlock: Gone are the days of fumbling for keys. Wyze Lock Bolt recognizes your fingerprint and unlocks the door in under a second. Store up to 50 fingerprints in the Wyze app for frequent guests or additional finger options for yourself.Note: Measure your door's backset, cross bore and thickness to ensure you find the right fit.Control Method:Touch     Numbered Keypad (+ Anti-Peep): Use a code to get in and out. Feel free to create unique codes for each person, so you can tell who came in when. Or, decide when they have access. With anti-peeping, don't worry if someone watches you enter your code. Simply add extra digits before or after your code and Wyze Lock Bolt will still unlock.     View the lock/unlock history: Bluetooth connection required. Know who came and went in the Wyze app. You can see how it unlocked, the exact time, and if there were any failed code attempts.     Auto Lock: Never forget to lock the door behind you. By enabling Auto-Lock, Wyze Lock Bolt automatically locks the door after a custom-set amount of time.     Replaces Existing Deadbolt: Wyze Lock Bolt replaces your existing deadbolt in about 20 minutes with easy-to-follow, step-by-step instructions for nearly all standard doors.     Unlock from anywhere with Wyze Doorbell Pro: Pair with Wyze Doorbell Pro to remotely grant access to visitors from anywhere using the Wyze App. Answer your door using Wyze Doorbell Pro and seamlessly unlock your Lock Bolt directly from the Doorbell Pro page wherever you are.       \n                    ›  See more product details"},{"asin":"B09CX7WG82","title":"Zircon Leak Alert Water Leak Detector & Flood Sensor Alarm/Water Leak Sensor with Dual Leak Alarms 90Db Audio/Battery Powered (2 Pack) Batteries Not Included (72311) White","price":"$29.99","saving":"","rating":"4.6 out of 5 stars","reviews":"635 ratings","image":["https://m.media-amazon.com/images/I/71-KmWusACL.__AC_SX300_SY300_QL70_FMwebp_.jpg"],"availability":"In Stock","tag":"Amazon's  Choice","description":"About this item                   Loud (90dB) alarm sounds when even the slightest amount of moisture is detected     In flood situations, the Leak Alert water detector is engineered to float and continue to sound the SOS alarm for up to 72 hours or until the battery is exhausted     Fully automatic battery-powered operation - no wiring required for this leak sensor. Like your smoke and carbon monoxide detectors, a low battery warning chirps an alarm when it is time to replace the 9V battery     Place in basements, bathrooms, kitchens, or wherever there is a potential for leaks. Common placements of the leak detector are near sump pumps, water heaters, washing machines, dishwashers, under sinks, etc     Includes 2 Leak Alert units and detailed instructions       \n                    ›  See more product details"}]},{"name":"Cleaning Supplies","url":"cleaning-supplies","category":"home-improvement-amp-maintenance-devices","dontInclude":[""],"keyword":[""],"description":"Shop for the best cleaning supplies at the best prices.","content":[]},{"name":"Other Home Appliances","url":"other-home-appliances","category":"home-improvement-amp-maintenance-devices","dontInclude":[""],"keyword":[""],"description":"Buy the latest home improvement and maintenance devices at the best prices.","content":[]}],"date":"January 13, 2024","Ads":[{"asin":"B08PBPTQNH","title":"Blink Mini – Compact indoor plug-in smart security camera, 1080p HD video, night vision, motion detection, two-way audio, easy set up, Works with Alexa – 4 cameras (White)","price":"$109.96","saving":"","rating":"4.4","reviews":"264,642 ratings","image":"https://m.media-amazon.com/images/I/41iTPY6vIwL._SY300_SX300_.jpg","availability":"In Stock","tag":"","description":"Monitor the inside of your home day and night with our 1080P HD indoor plug-in smart security camera with motion detection and two-way audio.     See, hear, and speak to people and pets in your home from your smartphone with Blink Mini’s live view and two-way audio.     Get alerts on your smartphone whenever motion is detected or customize motion detection zones so you can see what matters most.     Use Mini as an indoor plug-in chime for Blink Video Doorbell. Hear a real-time alert from Mini when someone presses your Video Doorbell.     Choose to save and share clips with a free 30-day trial of the Blink Subscription Plan or locally with the Sync Module 2 (sold separately).     Set up in minutes — plug in the camera, connect it to wifi, and follow the instructions in the free Blink Home Monitor app.     Works with Alexa — pair Blink Mini with a supported Alexa-enabled device to engage live view, arm and disarm your camera, and more using your voice.     Includes 4 Blink Mini cameras (white), 4 mounting kits with stands, 4 USB cables, and 4 power adapters."},{"asin":"B0BWFL453L","title":"Blink Whole Home Bundle – Video Doorbell system (black), Outdoor 4 camera (black), and Mini camera (white) | HD video, motion detection, Works with Alexa","price":"$101.98","saving":"","rating":"4.4","reviews":"262,068 ratings","image":"https://m.media-amazon.com/images/I/31JcPK4OE6L._SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"Help protect your home inside and out with the Blink Whole Home bundle featuring Video Doorbell, Outdoor 4, Mini, and Sync Module 2.     See and speak from the Blink app — Experience 1080p HD live view, infrared night vision, and crisp two-way audio.     Two-year battery life — Set up yourself in minutes and get up to two years of power on your Outdoor 4 and Video Doorbell with the included AA lithium batteries.     Designed for every home — Go wire-free or connect Video Doorbell to existing wiring to sound your in-home chime. Without wiring, you can use Blink Mini as an indoor chime.     Motion detection alerts — Be alerted to motion and customize motion zones from your phone so you're only notified about the activity that matters to you.     Person detection — With Outdoor 4, recieve alerts when a person is detected with embedded computer vision (CV) as part of an optional Blink Subscription Plan (sold separately).     Save and share clips — Choose to store events in the cloud with a free 30-day trial of the Blink Subscription Plan or locally with the Sync Module 2 (included) plus a USB drive (sold separately).       \n                           Works with Alexa — Connect to an Alexa-enabled device to engage live view, arm and disarm your system, and more using your voice.  Includes one Video Doorbell (black), mounting kit (including corner mount, screws, and anchors), one Outdoor 4 camera (black), four 1.5V non-rechargeable AA lithium metal batteries, mounting kit, Mini plug-in camera (white), Mini stand (attached), two mounting screws, two USB cables, two power adapters, and a Sync Module 2.      Show more"},{"asin":"B0CCZJWD5Q","title":"Ring Video Doorbell with Ring Stick Up Cam (White) and Ring Alarm 8-piece (White)","price":"$399.99","saving":"","rating":"4.6 out of 5 stars","reviews":"186,353 ratings","image":["https://m.media-amazon.com/images/I/41ANLwsaCXL._SY355_.jpg"],"availability":"This item cannot be shipped to your selected delivery location. Please choose a different delivery location.","tag":"Amazon's  Choice","description":"This bundle contains Ring Video Doorbell , Ring Stick Up Cam (White) and Ring Alarm 8-piece (White).     1080p HD video doorbell with enhanced features that let you see, hear, and speak to anyone from your phone, tablet, or PC.     An update from the original Ring Video Doorbell, enjoy improved motion detection, privacy zones and audio privacy, and crisper night vision.     Receive mobile notifications when anyone presses your doorbell or triggers your built-in motion sensors.     Powered by the built-in rechargeable battery or connects to existing doorbell wires for constant power.     Easily setup by connecting your Ring Video Doorbell to wifi through the Ring app and mounting with the included tools.     With a Ring Protect Plan (subscription sold separately), record all your videos, review what you missed for up to 180 days, and share videos and photos.     Pair with select Alexa-enabled devices to enable announcements and two-way talk for convenient in-home monitoring. With a Ring Protect plan (subscription sold separately), Alexa can also make voice announcements and automatically show live video feed on an Echo Show, Fire TV, or Fire Tablet when your Ring doorbell detects a person or package."},{"asin":"B0CCZJWD5Q","title":"Ring Video Doorbell with Ring Stick Up Cam (White) and Ring Alarm 8-piece (White)","price":"$399.99","saving":"","rating":"4.6 out of 5 stars","reviews":"186,353 ratings","image":["https://m.media-amazon.com/images/I/41ANLwsaCXL._SY355_.jpg"],"availability":"This item cannot be shipped to your selected delivery location. Please choose a different delivery location.","tag":"Amazon's  Choice","description":"This bundle contains Ring Video Doorbell , Ring Stick Up Cam (White) and Ring Alarm 8-piece (White).     1080p HD video doorbell with enhanced features that let you see, hear, and speak to anyone from your phone, tablet, or PC.     An update from the original Ring Video Doorbell, enjoy improved motion detection, privacy zones and audio privacy, and crisper night vision.     Receive mobile notifications when anyone presses your doorbell or triggers your built-in motion sensors.     Powered by the built-in rechargeable battery or connects to existing doorbell wires for constant power.     Easily setup by connecting your Ring Video Doorbell to wifi through the Ring app and mounting with the included tools.     With a Ring Protect Plan (subscription sold separately), record all your videos, review what you missed for up to 180 days, and share videos and photos.     Pair with select Alexa-enabled devices to enable announcements and two-way talk for convenient in-home monitoring. With a Ring Protect plan (subscription sold separately), Alexa can also make voice announcements and automatically show live video feed on an Echo Show, Fire TV, or Fire Tablet when your Ring doorbell detects a person or package."},{"asin":"B0CCZJWD5Q","title":"Ring Video Doorbell with Ring Stick Up Cam (White) and Ring Alarm 8-piece (White)","price":"$399.99","saving":"","rating":"4.6 out of 5 stars","reviews":"186,353 ratings","image":["https://m.media-amazon.com/images/I/41ANLwsaCXL._SY355_.jpg"],"availability":"This item cannot be shipped to your selected delivery location. Please choose a different delivery location.","tag":"Amazon's  Choice","description":"This bundle contains Ring Video Doorbell , Ring Stick Up Cam (White) and Ring Alarm 8-piece (White).     1080p HD video doorbell with enhanced features that let you see, hear, and speak to anyone from your phone, tablet, or PC.     An update from the original Ring Video Doorbell, enjoy improved motion detection, privacy zones and audio privacy, and crisper night vision.     Receive mobile notifications when anyone presses your doorbell or triggers your built-in motion sensors.     Powered by the built-in rechargeable battery or connects to existing doorbell wires for constant power.     Easily setup by connecting your Ring Video Doorbell to wifi through the Ring app and mounting with the included tools.     With a Ring Protect Plan (subscription sold separately), record all your videos, review what you missed for up to 180 days, and share videos and photos.     Pair with select Alexa-enabled devices to enable announcements and two-way talk for convenient in-home monitoring. With a Ring Protect plan (subscription sold separately), Alexa can also make voice announcements and automatically show live video feed on an Echo Show, Fire TV, or Fire Tablet when your Ring doorbell detects a person or package."},{"asin":"B0C5K1D8B6","title":"Ring Video Doorbell (Satin Nickel) bundle with Echo Show 5 (3rd Gen)","price":"$139.98","saving":"","rating":"4.6","reviews":"177,457 ratings","image":"https://m.media-amazon.com/images/I/31zgGjU7zyL._SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"This bundle contains Ring Video Doorbell (Satin Nickel) bundle with Echo Show 5 (3rd Gen).     1080p HD video doorbell with enhanced features that let you see, hear, and speak to anyone from your phone, tablet, or PC.     An update from the original Ring Video Doorbell, enjoy improved motion detection, privacy zones and audio privacy, and crisper night vision.     Receive mobile notifications when anyone presses your doorbell or triggers your built-in motion sensors.     Powered by the built-in rechargeable battery or connects to existing doorbell wires for constant power.     Easily setup by connecting your Ring Video Doorbell to wifi through the Ring app and mounting with the included tools.     With a Ring Protect Plan (subscription sold separately), record all your videos, review what you missed for up to 180 days, and share videos and photos.     Pair with select Alexa-enabled devices to enable announcements and two-way talk for convenient in-home monitoring. With a Ring Protect plan (subscription sold separately), Alexa can also make voice announcements and automatically show live video feed on an Echo Show, Fire TV, or Fire Tablet when your Ring doorbell detects a person or package."},{"asin":"B0C59J8FFJ","title":"Ring Video Doorbell with All-new Ring Indoor Cam (White) and Ring Alarm 5-Piece (White)","price":"$319.99","saving":"","rating":"4.6","reviews":"177,457 ratings","image":"https://m.media-amazon.com/images/I/216bIeA18wL._SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"This bundle contains Ring Video Doorbell , All-new Ring Indoor Cam (White) and Ring Alarm 5-Piece (White).     1080p HD video doorbell with enhanced features that let you see, hear, and speak to anyone from your phone, tablet, or PC.     An update from the original Ring Video Doorbell, enjoy improved motion detection, privacy zones and audio privacy, and crisper night vision.     Receive mobile notifications when anyone presses your doorbell or triggers your built-in motion sensors.     Powered by the built-in rechargeable battery or connects to existing doorbell wires for constant power.     Easily setup by connecting your Ring Video Doorbell to wifi through the Ring app and mounting with the included tools.     With a Ring Protect Plan (subscription sold separately), record all your videos, review what you missed for up to 180 days, and share videos and photos.     Pair with select Alexa-enabled devices to enable announcements and two-way talk for convenient in-home monitoring. With a Ring Protect plan (subscription sold separately), Alexa can also make voice announcements and automatically show live video feed on an Echo Show, Fire TV, or Fire Tablet when your Ring doorbell detects a person or package."},{"asin":"B0CCZPPZHW","title":"Ring Video Doorbell with Ring Stick Up Cam (White) and Ring Alarm 8-piece (White)","price":"$399.99","saving":"","rating":"4.6","reviews":"177,457 ratings","image":"https://m.media-amazon.com/images/I/3199J6mbCIL._SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"This bundle contains Ring Video Doorbell , Ring Stick Up Cam (White) and Ring Alarm 8-piece (White).     1080p HD video doorbell with enhanced features that let you see, hear, and speak to anyone from your phone, tablet, or PC.     An update from the original Ring Video Doorbell, enjoy improved motion detection, privacy zones and audio privacy, and crisper night vision.     Receive mobile notifications when anyone presses your doorbell or triggers your built-in motion sensors.     Powered by the built-in rechargeable battery or connects to existing doorbell wires for constant power.     Easily setup by connecting your Ring Video Doorbell to wifi through the Ring app and mounting with the included tools.     With a Ring Protect Plan (subscription sold separately), record all your videos, review what you missed for up to 180 days, and share videos and photos.     Pair with select Alexa-enabled devices to enable announcements and two-way talk for convenient in-home monitoring. With a Ring Protect plan (subscription sold separately), Alexa can also make voice announcements and automatically show live video feed on an Echo Show, Fire TV, or Fire Tablet when your Ring doorbell detects a person or package."},{"asin":"B0C5K4ZPXP","title":"Ring Video Doorbell (Venetian Bronze) bundle with Echo Show 5 (3rd Gen)","price":"$94.98","saving":"","rating":"4.6","reviews":"174,769 ratings","image":"https://m.media-amazon.com/images/I/31njqIoALfL._SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"This bundle contains Ring Video Doorbell (Venetian Bronze) bundle with Echo Show 5 (3rd Gen).     1080p HD video doorbell with enhanced features that let you see, hear, and speak to anyone from your phone, tablet, or PC.     An update from the original Ring Video Doorbell, enjoy improved motion detection, privacy zones and audio privacy, and crisper night vision.     Receive mobile notifications when anyone presses your doorbell or triggers your built-in motion sensors.     Powered by the built-in rechargeable battery or connects to existing doorbell wires for constant power.     Easily setup by connecting your Ring Video Doorbell to wifi through the Ring app and mounting with the included tools.     With a Ring Protect Plan (subscription sold separately), record all your videos, review what you missed for up to 180 days, and share videos and photos.     Pair with select Alexa-enabled devices to enable announcements and two-way talk for convenient in-home monitoring. With a Ring Protect plan (subscription sold separately), Alexa can also make voice announcements and automatically show live video feed on an Echo Show, Fire TV, or Fire Tablet when your Ring doorbell detects a person or package."},{"asin":"B0C59FS2W4","title":"Ring Video Doorbell with All-new Ring Indoor Cam (White) and Ring Alarm 5-Piece (White)","price":"$199.99","saving":"","rating":"4.6","reviews":"174,769 ratings","image":"https://m.media-amazon.com/images/I/21X1hU2b+6L._SY300_SX300_.jpg","availability":"In Stock","tag":"#1 Best Seller","description":"This bundle contains Ring Video Doorbell , All-new Ring Indoor Cam (White) and Ring Alarm 5-Piece (White).     1080p HD video doorbell with enhanced features that let you see, hear, and speak to anyone from your phone, tablet, or PC.     An update from the original Ring Video Doorbell, enjoy improved motion detection, privacy zones and audio privacy, and crisper night vision.     Receive mobile notifications when anyone presses your doorbell or triggers your built-in motion sensors.     Powered by the built-in rechargeable battery or connects to existing doorbell wires for constant power.     Easily setup by connecting your Ring Video Doorbell to wifi through the Ring app and mounting with the included tools.     With a Ring Protect Plan (subscription sold separately), record all your videos, review what you missed for up to 180 days, and share videos and photos.     Pair with select Alexa-enabled devices to enable announcements and two-way talk for convenient in-home monitoring. With a Ring Protect plan (subscription sold separately), Alexa can also make voice announcements and automatically show live video feed on an Echo Show, Fire TV, or Fire Tablet when your Ring doorbell detects a person or package."}],"count":123}