{"name":"Motorola & Lenovo Devices & Accessories","url":"motorola-amp-lenovo-devices-amp-accessories","category":"cell-phones-tablets-laptops-tvs-amp-accessories","necessary":["motorola","lenovo"],"description":"Shop for Motorola and Lenovo smartphones, tablets, laptops and more.","keywords":"moto,motorola,lenovo,smartphone,laptop,smartwatch","content":[{"name":"Smartphones","url":"smartphones","dontInclude":[""],"keyword":["phone","unlocked"],"category":"motorola-amp-lenovo-devices-amp-accessories","description":"Get your hands on the latest Motorola and Lenovo smartphones.","content":[],"count":0,"date":"September 7, 2023"},{"name":"Tablets & Laptops","url":"tablets-amp-laptops","dontInclude":[""],"keyword":["tab","laptop","book","pad"],"category":"motorola-amp-lenovo-devices-amp-accessories","description":"Get your hands on the latest Motorola and Lenovo tablets and laptops.","content":[]},{"name":"Airpods & Headphones","url":"airpods-amp-headphones","dontInclude":[""],"keyword":["pods","buds","headphone","headset"],"category":"motorola-amp-lenovo-devices-amp-accessories","description":"Buy the best Motorola and Lenovo airpods and headphones and enjoy your music.","content":[{"asin":"B00942OFVU","title":"Motorola 1518 Surveillance Headset with PTT Mic, Black, White","price":"$28.42","saving":"-33%","rating":"4.1","reviews":"1,889 ratings","image":"https://m.media-amazon.com/images/I/51wa8cKDmzL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"The Motorola Surveillance Headset with Push-To-Talk microphone is great for covert or stealth missions, allowing discreet operation of most Motorola Talkabout Two-Way Radios. A clear earpiece and coiled cord provides a snug, comfortable fit - even under a motorcycle helmet - and reduces device visibility while hunting, attending a theme park or coordinating a wedding. The 1518 Surveillance Headset delivers crisp, clear sound even in noisy places. The cord length between microphone and earpiece provides flexibility for movement. The PTT microphone can easily attach to your clothing with an accompanying clip. The Motorola Surveillance Headset with PTT Microphone is single-pronged and works with all Motorola Talk about FRS/GMRS radios capable of using a headset. No set up is needed, just plug into your two-way radios and enjoy."},{"asin":"B01N0ZYNV8","title":"Motorola USB-C to 3.5mm Audio Headphone Jack Adapter Cable for Moto Z, Z Force, Z Force Droid, Z2 Force - Black","price":"$12.00","saving":"-20%","rating":"4.3","reviews":"2,062 ratings","image":"https://m.media-amazon.com/images/I/51-Fx2AOkKL.__AC_SY300_SX300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Motorola USB-C to 3.5mm Audio Headphone Jack Adapter Cable allows you to listen to audio on devices that do not have a built in 3.5 mm headphone jack - Model SKN6474A"},{"asin":"B081KJ71K9","title":"Motorola Vervebuds 100 Earbud Headphones, Waterproof True Wireless Earbuds, Bluetooth 5.0 in-Ear with Hands-Free Call Microphone","price":"$50.40","saving":"","rating":"4.1","reviews":"1,558 ratings","image":"https://m.media-amazon.com/images/I/71ByKpMdXPL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"MOTOROLA Vervebuds 100 Earbud Headphones, Waterproof True Wireless Earbuds, Bluetooth 5.0 in-Ear with Hands-Free Call Microphone"}],"count":0,"date":"September 7, 2023"},{"name":"Smartphone, Tablet & Laptop Cases","url":"smartphone-tablet-amp-laptop-cases","dontInclude":[""],"keyword":["case","cover"],"category":"motorola-amp-lenovo-devices-amp-accessories","description":"Protect and make your Moto device look stylish with a case.","content":[{"asin":"B07VTNK549","title":"8-inch Tablet Case, Techcircle Pretty Folio Stand Cover w/ [Pencil Holder] [Card Slots] Magnetic Protective Case for Lenovo/Samsung Galaxy Tab 8.0 Series, iPad Mini 7.9, Fire HD 8, Floral Butterfly","price":"$16.99","saving":"","rating":"4.4","reviews":"685 ratings","image":"https://m.media-amazon.com/images/I/81ekgINv+0L._AC_SY300_SX300_.jpg","availability":"In Stock","tag":"","description":"✪✪✪ Stylish Folio Stand Magnetic Flip Case with Card Slots, Protective Cover for 8 Inch Tablet ✪✪✪  Compatibility: This case is designed for all around 7.5\"-8.5\" tablet, such as: ✔ Apple iPad Mini 5 2019, iPad Mini 4 / 3 / 2 / 1, ✔ Samsung Galaxy Tab A 8.0/ Tab E 8.0 / Tab 4 8.0 / Tab S2 / Tab S2 Nook 8\", ✔ Amazon Kindle Fire HD 8 inch ( 8th/ 7th/ 6th/ 5th Generation ), ✔ Lenovo Tab 4 8 Plus / Yoga Tab 3 8, Huawei MediaPad M3 Lite 8 / M2 8.0 / T1 8.0, ✔ Dragon Touch, ASUS ZenPad, LG G Pad, iRULU eXpro, Hisense SERO and more 8 inch Android tablet.  📣 No camera opening; NOT support auto sleep/wake for any tablets  Features: 🔹 Soft Synthetic PU leather tablet cover gives full protection and easy installation. 🔹 Convenient Card Solts Holder wallet style, manage your various cards while on the go. 🔹 Equipped with 4 flexible clasps, easily clip-on and protect your device from scratches, dust and splashing water. 🔹 Stand feature, prop up the tablet safely and hands free reading or watching videos. 🔹 Reliable magnetic folio case, keeps the front cover sealed and open or shut flexibly. 🔹 Lightweight cover with comfortable grip and many fun colors for option. Ideal for home, work and travel.  Package includes: 1 x Protective Case for All 7.5 - 8.5 inch Tablet 1 x Stylus Pen (random color) 1 x Cleaning Cloth  📣 Please check your device model carefully before purchasing. Any question, feel free to contact us."},{"asin":"B01F6PN226","title":"Arvok 13 13.3 14 Inch Laptop Sleeve Case for MacBook Pro 14 2021/Water-Resistant Notebook Chromebook Computer Pocket Briefcase Carrying Bag Pouch Skin Cover for HP/Dell/Lenovo/Asus/Acer, Wine Red","price":"$13.99","saving":"-40%","rating":"4.6","reviews":"57,121 ratings","image":"https://m.media-amazon.com/images/I/714-WNYnNYL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"About this item                   Compatible Devices: Suitable for MacBook Pro 14 2021/ MacBook Air 2017. Ideal fit for most 13\"-14\" laptops for ACER, APPLE, ASUS, DELL, HP, LENOVO, SONY, SAMSUNG, TOSHIBA and more. Proper fitment varies according to the size of the devices. Please check the dimensions of your device before purchasing. Interior Dimensions: 13.5\" x 0.78\" x 9.5\"/34.3 x 2 x 24.1 cm (L x W x H).     Superior Protection: Premium thickened water-resistant neoprene material offers a ultra slim lightweight design and superior protection to protect laptop/notebook from dust, shocks, bumps, scratches, scuffs and spills. (Thickness: 0.25 inch/0.6 cm)     Ultra-Slim & Lightweight: Easily sliding into your briefcase, backpack or other luggage bags, which make it so convenient for daily use and traveling wherever you go.     Convenient Use: Quick top-loading zipper on the bag glides smoothly, allowing for an easy and convenient access to your laptop computer.     Lifetime Support: Full 12 months Worry-Free warranty with lifetime support! 24/7/365 customer service support, just purchase and enjoy this superior product with confidence and risk-free!"},{"asin":"B087BYCJ9J","title":"CaseBot Case for Lenovo Tab M10 Plus 10.3&quot; (Not for M10 Plus Gen 3rd 10.6&quot; 2022), Lightweight Slim Shell Stand Cover for Lenovo Tab M10 Plus (2020 2nd Gen) TB-X606F/TB-X606X 10.3&quot; FHD Tablet","price":"$12.99","saving":"","rating":"4.5","reviews":"3,650 ratings","image":"https://m.media-amazon.com/images/I/81fx6GxaWsL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"About this item                   Exclusively designed for Lenovo Tab M10 Plus TB-X606F / TB-X606X 10.3 Inch FHD (2020 2nd Gen) Android Tablet. Not fit for Lenovo Tab M10 Plus Gen 3rd 10.6\" 2022 release.     Easy clip-on application. Precise cut-outs and openings for easy access to all tablet features.     This is a one piece case, the front and back does not separate. Cover has flip capability to transform the case into a viewing stand and keyboard stand.     Slim lightweight durable protective hardback with premium quality PU leather. Soft scratch-free microfiber interior adds comfort and an additional layer of protection.     Available in a variety of bright and fun colors."},{"asin":"B08D1VN14Y","title":"Lenovo Tab M8 Folio Case, Polycarbonate and Microfiber Material, Polyurethane Protective Film, ZG38C02862, Black","price":"$14.99","saving":"","rating":"4.5","reviews":"1,103 ratings","image":"https://m.media-amazon.com/images/I/71sXA7EboKL.__AC_SY300_SX300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Protect your Tab M8 from accidental drops, scuffs, and other damage with the Lenovo Tab M8 Folio Case. This convenient fitted case is made with a combination of microfiber and polycarbonate material to keep your tablet safe and secure – and looking great. Also designed to be used as a tablet stand, this tablet case lets you watch videos in the most comfortable position! In addition to the sturdy carrying case, the Tab 8 Folio tablet cover comes with a protective film to guard the screen against scratches. Sleek, slim, and modern, the Tab M8 Folio Case allows you to carry your tablet with pride."},{"asin":"B0BY36Q2J9","title":"Lenovo Yoga Laptop Sleeve 14 Inch Notebook/Tablet Compatible with MacBook Air/Pro - Slim Eco-Friendly Lightweight Case with Accessory Pocket & Magnetic Closure - Teal","price":"$24.96","saving":"","rating":"4.4","reviews":"472 ratings","image":"https://m.media-amazon.com/images/I/51MfysGDfJL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"Made from PET recycled materials, the sleeve not only provides a perfect fit but also takes us one step closer to our environmental aspirations. Sporting a dedicated laptop compartment and accessory pockets sealed by a magnetic flap to keep your devices and accessories safe."}],"count":0,"date":"September 7, 2023"},{"name":"Smartphone, Tablet & Laptop Chargers","url":"smartphone-tablet-amp-laptop-chargers","dontInclude":[""],"keyword":["charger","charging"],"category":"motorola-amp-lenovo-devices-amp-accessories","description":"Get the best suited charger for any Lenovo smartphone, tablet or laptop.","content":[{"asin":"B08L363DGV","title":"65W 45W Universal Laptop Charger USB C Fast Charger,Type C Laptop Power Adapter Laptop Power Supply for Mac Book Pro,Lenovo,Dell,HP,ASUS,Acer,Nintendo Switch and Other Laptops/Smart Phones (Black)","price":"$19.99","saving":"","rating":"4.1","reviews":"814 ratings","image":"https://m.media-amazon.com/images/I/715Px5qeqtL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"About this item                   Broad Compatibility (1): Compatible with all 65W 45W USB-C powered devices（Partial compatible models as follows，more details please to refer the product description page）Compatible for the Apple 30W/61W USB-C Notebook: MacBook (Retina, 12-inch, early 2015–2017) MacBook Air (Retina, 13-inch, 2018 and later)MacBook Pro (13-inch, 2016 and later);Compatible for Lenovo 45W 65W USB-C laptops: ThinkPad T480 T580 T480s, Yoga C940 C740 C930 730 S730 730S 920 Chromebook c330 100e 300e 500e c340 s340 etc.     Broad Compatibility (2): Compatible for HP 45W 65W USB-C laptops: HP Chromebook 14 14A G5 11 11A G6 G7 G8 EE Spectre x360 Elite x2 EliteBook;Compatible for DELL 45W 65W USB-C laptops: Dell XPS 12 9250 XPS 13 9350 9360 9365 9370 9380, Latitude 7370 7280 7480 5480 7275 5290 7490 LA65NM170 2YKOF. Google Pixel/ Pixel 2/XL Pixel Book/ Moto Z / Matebook Samsung Galaxy S9 S9 Plus S8 Chromebook/ASUS/Nintendo Switch and other smart devices with type C     Safety Protection: Design with Automatic thermal, overload cut-off, and short circuit protection. Ensure the safety during the using. And High quality wire with anti-interference magnetic ring. It is safer than other adapters     Fast Charger with PD 3.0: supports power delivery (PD) fast charge model with maximum power up to 65W, The USB-C port with Power Delivery enables compatible devices to charge faster in a short time.Electrical Specifications: AC Input: 100-240V~1.6A 50-60Hz Output: 5V-3A or 9V-3A or 15V-3A or 20V-3.25A Watts: 65 Watts.     Service & Support: 30 Days Money Back Guarantee and 1 year warranty. 1 x AC Adapter & 1 x Power Cord     It has always been our intention to satisfy every buyer of our products! The fastest way to solve your problem is to contact us via email. Within 1 year after you purchase the product, you can contact us via Amazon.com email at any time, and we will give you a solution as soon as we receive the email!"},{"asin":"B09KZQBSDD","title":"65W 45W USB C Laptop Charger for Lenovo ThinkPad T14 T16 gen 1 gen 2 X1 Yoga L13 7i C740 920 C930 C940 Type C AC Power Adapter for Lenovo ThinkPad T480 T490 P52s Chromebook 2nd Gen Laptop Power Cord","price":"$16.99","saving":"","rating":"4.3","reviews":"562 ratings","image":"https://m.media-amazon.com/images/I/61C01TXogNL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"About this item                   [USB-C ThinkPad Laptop Charger Power Specs] Input: 100-240V 50/60Hz ~1.8A, Output: 20V-3.25V/ 20V-2.25A/ 15V-3A/ 9V-2A/ 5V-2A. Watts: 65W(Compatible with 45W USB-C Laptop), Connector Size: USB Type C(Not fit for Square USB Yellow Connector!!!). Cord Length: 10FT.     USB C Charger for Lenovo ThinkPad: For Lenovo Chromebook 100e 300e 500e C330 C340 S330 S340 S345 C630 C340-11 14w 14e S345-14AST, for Lenovo Yoga 7i 9i 14\" 15\" 2 in 1 Laptop, for Lenovo Yoga S730 C930 C940 C740 730 730S 910 920 720-13IKB 730-13IKB 730S-13IWL 730S-13IML S730-13IWL S730-13IML, Lenovo IdeaPad Charger.     Type C Power Cord for Lenovo ThinkBook: Fit for Lenovo ThinkPad P51s P52s P43s P53s T470 T470s T480 T480s T570 T580 T580s T490 T590 T495 E480 E490 E590 L480 L580 ThinkPad X270 X280 X380 X390 X395 Yoga. ThinkPad X1 Carbon 5th 6th 7th Generation, X1 Yoga 2nd 3rd 4th Gen, ThinkPad X1 Tablet 2nd 3rd, ThinkPad Yoga L13 L14 L15 P14s P15s E15 E14 X13 T14 T14s T15 T16 Gen 1 2 3. Lenovo ThinkPad Charger.     ThinkPad Charger for Laptop Compatible with Lenovo Laptop P/N: 4X20E75131 4X20M26252 4X20M26268 4GX20N20876 4X20E75132 4X20E75135 4X20V07881 4X20E75137 GX20P92530 ADLX65YLC2D ADLX65YLCC2D ADLX65NCT2A ADLX65YCC2D ADLX65YDC2D ADLX65YLC2A ADLX65YCC3A ADLX65YDC3A ADLX65YDC2A ADLX65YLC3A ADLX65YDC3D ADLX65YCC3D ADLX65YLC3D ADLX65YAC3A ADLX65YCC2A ADLX65YAC2A ADLX65UCGU2A, fit for Lenovo 100W 300W 500W Gen 3 Laptop Charger     Safety and Guarantee of Lenovo Laptop Charger: 24 Hours On-Line, 12 Months Warranty, 30 Days Money Back or New Replacement.     This Charger is USB C Type C Connector, Not fit for Yellow USB Connector, Please Confirm Carefully!"},{"asin":"B01MXSFTOD","title":"Lenovo 45W Computer Charger - Round Tip AC Wall Adapter (GX20K11838), Black, Lenovo 45W AC Wall Adapter (Round Tip)","price":"$17.94","saving":"-28%","rating":"4.7","reviews":"2,094 ratings","image":"https://m.media-amazon.com/images/I/71xQaor9OWL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"Get power when and where you need it. Keep one in the office, one at home, and another in your carrying case for convenient access to power. Just plug it into an available outlet to deliver AC power to the compatible Lenovo NBs listed below and to recharge the system battery. Lenovo AC adapters are compact, energy efficient and backed by a 1 year warranty."}],"count":0,"date":"September 7, 2023"},{"name":"Other Accessories","url":"other-accessories","dontInclude":[""],"keyword":[""],"category":"motorola-amp-lenovo-devices-amp-accessories","description":"Enhance your Lenovo device with the best accessories.","content":[{"asin":"B07HGDWLNM","title":"iOttie iTap 2 Magnetic Air Vent Car Mount Holder, Cradle for Samsung Galaxy S22, Google Pixel 7, Motorola Moto G, OnePlus 10, Sony Xperia & Other Android Smartphones & Other Smartphones","price":"$24.99","saving":"","rating":"4.2","reviews":"5,325 ratings","image":"https://m.media-amazon.com/images/I/61tCA+1shFL._AC_SY300_SX300_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"The Tap Magnetic 2 Air Vent Mount is a sleek and compact magnetic mounting solution that holds your Android smartphone securely while you drive. Designed for maximum convenience, the iTap 2 features two rare-earth magnets that provide a strong hold for all Android smartphone and case combinations. The included metal plate kit features one small and one large metal plate as wells a protective film that attaches directly on the back of your Android phone or case, and does not interfere with wireless charging when positioned correctly. Install the iTap Magnetic 2 on almost any vehicle air vent using the twist lock that tightens securely onto most vent blades. Enhance your driving experience with the iTap Magnetic 2 air vent mount from iOttie!"},{"asin":"B075Y8294N","title":"Lenovo Laptop Bag T210, Messenger Shoulder Bag for Laptop or Tablet, Sleek, Durable & Water-Repellent Fabric","price":"$15.26","saving":"-24%","rating":"4.7","reviews":"12,329 ratings","image":"https://m.media-amazon.com/images/I/81dhV4bNrIL.__AC_SX395_SY395_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"The Lenovo 15.6\" r T210 seamlessly blends style and functionality. Its water-repellent fabric, optimal laptop protection, spacious storage, thoughtful organization, and travel-friendly design make it a versatile accessory for the modern individual. Whether you're headed to the office, a café, or a business trip, this sleek laptop bag ensures you're well-prepared and looking stylish. Dimensions: Fits Up To (L x D x H): 362 x 22 x 250 mm (14.2 x 0.8 x 9.8 in) Weight: 0.465kg"},{"asin":"B01CQMXCRM","title":"Lenovo ThinkPad Basic Backpack 39.6 cm / 15.6 Inch","price":"$35.66","saving":"","rating":"4.4","reviews":"418 ratings","image":"https://m.media-amazon.com/images/I/51B+-HUFvKL._AC_SY300_SX300_.jpg","availability":"In Stock","tag":"","description":"Lenovo ThinkPad Basic Backpack 39.6 cm / 15.6 Inch"},{"asin":"B0BY395PWX","title":"Lenovo Yoga Laptop Sleeve 14 Inch Notebook/Tablet Compatible with MacBook Air/Pro - Slim Eco-Friendly Lightweight Case with Accessory Pocket & Magnetic Closure - Grey","price":"$25.37","saving":"","rating":"4.4","reviews":"472 ratings","image":"https://m.media-amazon.com/images/I/61IQRDx2P9L.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"Made from PET recycled materials, the sleeve not only provides a perfect fit but also takes us one step closer to our environmental aspirations. Sporting a dedicated laptop compartment and accessory pockets sealed by a magnetic flap to keep your devices and accessories safe."}],"count":5,"date":"September 7, 2023"}],"date":"January 15, 2024","count":15,"Ads":[{"asin":"B01F6PN226","title":"Arvok 13 13.3 14 Inch Laptop Sleeve Case for MacBook Pro 14 2021/Water-Resistant Notebook Chromebook Computer Pocket Briefcase Carrying Bag Pouch Skin Cover for HP/Dell/Lenovo/Asus/Acer, Wine Red","price":"$13.99","saving":"-40%","rating":"4.6","reviews":"57,121 ratings","image":"https://m.media-amazon.com/images/I/714-WNYnNYL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"About this item                   Compatible Devices: Suitable for MacBook Pro 14 2021/ MacBook Air 2017. Ideal fit for most 13\"-14\" laptops for ACER, APPLE, ASUS, DELL, HP, LENOVO, SONY, SAMSUNG, TOSHIBA and more. Proper fitment varies according to the size of the devices. Please check the dimensions of your device before purchasing. Interior Dimensions: 13.5\" x 0.78\" x 9.5\"/34.3 x 2 x 24.1 cm (L x W x H).     Superior Protection: Premium thickened water-resistant neoprene material offers a ultra slim lightweight design and superior protection to protect laptop/notebook from dust, shocks, bumps, scratches, scuffs and spills. (Thickness: 0.25 inch/0.6 cm)     Ultra-Slim & Lightweight: Easily sliding into your briefcase, backpack or other luggage bags, which make it so convenient for daily use and traveling wherever you go.     Convenient Use: Quick top-loading zipper on the bag glides smoothly, allowing for an easy and convenient access to your laptop computer.     Lifetime Support: Full 12 months Worry-Free warranty with lifetime support! 24/7/365 customer service support, just purchase and enjoy this superior product with confidence and risk-free!"},{"asin":"B075Y8294N","title":"Lenovo Laptop Bag T210, Messenger Shoulder Bag for Laptop or Tablet, Sleek, Durable & Water-Repellent Fabric","price":"$15.26","saving":"-24%","rating":"4.7","reviews":"12,329 ratings","image":"https://m.media-amazon.com/images/I/81dhV4bNrIL.__AC_SX395_SY395_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"The Lenovo 15.6\" r T210 seamlessly blends style and functionality. Its water-repellent fabric, optimal laptop protection, spacious storage, thoughtful organization, and travel-friendly design make it a versatile accessory for the modern individual. Whether you're headed to the office, a café, or a business trip, this sleek laptop bag ensures you're well-prepared and looking stylish. Dimensions: Fits Up To (L x D x H): 362 x 22 x 250 mm (14.2 x 0.8 x 9.8 in) Weight: 0.465kg"},{"asin":"B07HGDWLNM","title":"iOttie iTap 2 Magnetic Air Vent Car Mount Holder, Cradle for Samsung Galaxy S22, Google Pixel 7, Motorola Moto G, OnePlus 10, Sony Xperia & Other Android Smartphones & Other Smartphones","price":"$24.99","saving":"","rating":"4.2","reviews":"5,325 ratings","image":"https://m.media-amazon.com/images/I/61tCA+1shFL._AC_SY300_SX300_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"The Tap Magnetic 2 Air Vent Mount is a sleek and compact magnetic mounting solution that holds your Android smartphone securely while you drive. Designed for maximum convenience, the iTap 2 features two rare-earth magnets that provide a strong hold for all Android smartphone and case combinations. The included metal plate kit features one small and one large metal plate as wells a protective film that attaches directly on the back of your Android phone or case, and does not interfere with wireless charging when positioned correctly. Install the iTap Magnetic 2 on almost any vehicle air vent using the twist lock that tightens securely onto most vent blades. Enhance your driving experience with the iTap Magnetic 2 air vent mount from iOttie!"},{"asin":"B087BYCJ9J","title":"CaseBot Case for Lenovo Tab M10 Plus 10.3&quot; (Not for M10 Plus Gen 3rd 10.6&quot; 2022), Lightweight Slim Shell Stand Cover for Lenovo Tab M10 Plus (2020 2nd Gen) TB-X606F/TB-X606X 10.3&quot; FHD Tablet","price":"$12.99","saving":"","rating":"4.5","reviews":"3,650 ratings","image":"https://m.media-amazon.com/images/I/81fx6GxaWsL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"About this item                   Exclusively designed for Lenovo Tab M10 Plus TB-X606F / TB-X606X 10.3 Inch FHD (2020 2nd Gen) Android Tablet. Not fit for Lenovo Tab M10 Plus Gen 3rd 10.6\" 2022 release.     Easy clip-on application. Precise cut-outs and openings for easy access to all tablet features.     This is a one piece case, the front and back does not separate. Cover has flip capability to transform the case into a viewing stand and keyboard stand.     Slim lightweight durable protective hardback with premium quality PU leather. Soft scratch-free microfiber interior adds comfort and an additional layer of protection.     Available in a variety of bright and fun colors."},{"asin":"B01MXSFTOD","title":"Lenovo 45W Computer Charger - Round Tip AC Wall Adapter (GX20K11838), Black, Lenovo 45W AC Wall Adapter (Round Tip)","price":"$17.94","saving":"-28%","rating":"4.7","reviews":"2,094 ratings","image":"https://m.media-amazon.com/images/I/71xQaor9OWL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"Get power when and where you need it. Keep one in the office, one at home, and another in your carrying case for convenient access to power. Just plug it into an available outlet to deliver AC power to the compatible Lenovo NBs listed below and to recharge the system battery. Lenovo AC adapters are compact, energy efficient and backed by a 1 year warranty."},{"asin":"B01N0ZYNV8","title":"Motorola USB-C to 3.5mm Audio Headphone Jack Adapter Cable for Moto Z, Z Force, Z Force Droid, Z2 Force - Black","price":"$12.00","saving":"-20%","rating":"4.3","reviews":"2,062 ratings","image":"https://m.media-amazon.com/images/I/51-Fx2AOkKL.__AC_SY300_SX300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Motorola USB-C to 3.5mm Audio Headphone Jack Adapter Cable allows you to listen to audio on devices that do not have a built in 3.5 mm headphone jack - Model SKN6474A"},{"asin":"B00942OFVU","title":"Motorola 1518 Surveillance Headset with PTT Mic, Black, White","price":"$28.42","saving":"-33%","rating":"4.1","reviews":"1,889 ratings","image":"https://m.media-amazon.com/images/I/51wa8cKDmzL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"The Motorola Surveillance Headset with Push-To-Talk microphone is great for covert or stealth missions, allowing discreet operation of most Motorola Talkabout Two-Way Radios. A clear earpiece and coiled cord provides a snug, comfortable fit - even under a motorcycle helmet - and reduces device visibility while hunting, attending a theme park or coordinating a wedding. The 1518 Surveillance Headset delivers crisp, clear sound even in noisy places. The cord length between microphone and earpiece provides flexibility for movement. The PTT microphone can easily attach to your clothing with an accompanying clip. The Motorola Surveillance Headset with PTT Microphone is single-pronged and works with all Motorola Talk about FRS/GMRS radios capable of using a headset. No set up is needed, just plug into your two-way radios and enjoy."},{"asin":"B081KJ71K9","title":"Motorola Vervebuds 100 Earbud Headphones, Waterproof True Wireless Earbuds, Bluetooth 5.0 in-Ear with Hands-Free Call Microphone","price":"$50.40","saving":"","rating":"4.1","reviews":"1,558 ratings","image":"https://m.media-amazon.com/images/I/71ByKpMdXPL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"MOTOROLA Vervebuds 100 Earbud Headphones, Waterproof True Wireless Earbuds, Bluetooth 5.0 in-Ear with Hands-Free Call Microphone"},{"asin":"B08D1VN14Y","title":"Lenovo Tab M8 Folio Case, Polycarbonate and Microfiber Material, Polyurethane Protective Film, ZG38C02862, Black","price":"$14.99","saving":"","rating":"4.5","reviews":"1,103 ratings","image":"https://m.media-amazon.com/images/I/71sXA7EboKL.__AC_SY300_SX300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Protect your Tab M8 from accidental drops, scuffs, and other damage with the Lenovo Tab M8 Folio Case. This convenient fitted case is made with a combination of microfiber and polycarbonate material to keep your tablet safe and secure – and looking great. Also designed to be used as a tablet stand, this tablet case lets you watch videos in the most comfortable position! In addition to the sturdy carrying case, the Tab 8 Folio tablet cover comes with a protective film to guard the screen against scratches. Sleek, slim, and modern, the Tab M8 Folio Case allows you to carry your tablet with pride."},{"asin":"B08L363DGV","title":"65W 45W Universal Laptop Charger USB C Fast Charger,Type C Laptop Power Adapter Laptop Power Supply for Mac Book Pro,Lenovo,Dell,HP,ASUS,Acer,Nintendo Switch and Other Laptops/Smart Phones (Black)","price":"$19.99","saving":"","rating":"4.1","reviews":"814 ratings","image":"https://m.media-amazon.com/images/I/715Px5qeqtL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"About this item                   Broad Compatibility (1): Compatible with all 65W 45W USB-C powered devices（Partial compatible models as follows，more details please to refer the product description page）Compatible for the Apple 30W/61W USB-C Notebook: MacBook (Retina, 12-inch, early 2015–2017) MacBook Air (Retina, 13-inch, 2018 and later)MacBook Pro (13-inch, 2016 and later);Compatible for Lenovo 45W 65W USB-C laptops: ThinkPad T480 T580 T480s, Yoga C940 C740 C930 730 S730 730S 920 Chromebook c330 100e 300e 500e c340 s340 etc.     Broad Compatibility (2): Compatible for HP 45W 65W USB-C laptops: HP Chromebook 14 14A G5 11 11A G6 G7 G8 EE Spectre x360 Elite x2 EliteBook;Compatible for DELL 45W 65W USB-C laptops: Dell XPS 12 9250 XPS 13 9350 9360 9365 9370 9380, Latitude 7370 7280 7480 5480 7275 5290 7490 LA65NM170 2YKOF. Google Pixel/ Pixel 2/XL Pixel Book/ Moto Z / Matebook Samsung Galaxy S9 S9 Plus S8 Chromebook/ASUS/Nintendo Switch and other smart devices with type C     Safety Protection: Design with Automatic thermal, overload cut-off, and short circuit protection. Ensure the safety during the using. And High quality wire with anti-interference magnetic ring. It is safer than other adapters     Fast Charger with PD 3.0: supports power delivery (PD) fast charge model with maximum power up to 65W, The USB-C port with Power Delivery enables compatible devices to charge faster in a short time.Electrical Specifications: AC Input: 100-240V~1.6A 50-60Hz Output: 5V-3A or 9V-3A or 15V-3A or 20V-3.25A Watts: 65 Watts.     Service & Support: 30 Days Money Back Guarantee and 1 year warranty. 1 x AC Adapter & 1 x Power Cord     It has always been our intention to satisfy every buyer of our products! The fastest way to solve your problem is to contact us via email. Within 1 year after you purchase the product, you can contact us via Amazon.com email at any time, and we will give you a solution as soon as we receive the email!"}]}