{"name":"Smart Home","url":"smart-home","category":"amazon-devices","necessary":[""],"description":"Create a smart and connected home with Alexa and products from Amazon.","keywords":"smart home,smart appliances,smart tv,smart lightning","content":[{"name":"Smart Plugs, Appliances & Wifi","url":"smart-plugs-appliances-amp-wifi","dontInclude":[""],"keyword":["smart plug","smart appliance","smart wifi","kasa","smart outlet","socket"],"category":"smart-home","description":"Control your appliances smartly with compatible connected devices.","content":[{"asin":"B07PFSRMV4","title":"Avatar Controls Smart Plugs Wi-Fi Outlet 4 Pack - Smart Plugs That Work with Alexa/Google Home/Smart Life, Timer ON/Off Plug, Schedule Built-in App, Mini Wireless Socket, No Hub Required","price":"$24.80","saving":"","rating":"4.2","reviews":"1,743 ratings","image":"https://m.media-amazon.com/images/I/41aUe5lYdML._SY445_SX342_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"About this item                   【Important Note】 1.Most of wifi plug smart outlet currently on market all only support wi-fi 2.4 GHz at first connection. 2.Make sure your smart outlet plug and your router have a good transmission of signals, avoid strong electromagnetic interference and reinforced concrete blocking wifi broadcasting     【Timer Schedule Feature】 The wifi outlet plug was programmable by app, you will never come home to a dark house. Lights will turn on at dusk and turn off at dawn automatically everyday when you set the schedule with specific times     【Voice Control Supported by Hub】 These smart outlets that work with alexa and google assistant, good compatibility let you can easily control your smart devices by giving simple voice commands to your smart dot or google home which linked to the smart wifi plugs     【Group Control & Family Sharing】 These smart plugs that work with alexa based on Tuya smart life app with 30 group timing, you can easily set up your smart home devices group in app, and one tap to share devices group to your family members and share happiness and convenience     【Wide Applications WiFi Outlets】 These smart outlets that work with alexa can be installed in many places indoor, as a switch for bed lamps, reading lamps, a table lights, TV, floor fans, etc. Just Note: Maximum 1100 Watts, so don’t use it for high-power appliances such as air conditioners"},{"asin":"B07361JZ2H","title":"Enbrighten Z-Wave Plus Smart Receptacle, Works with Alexa, Google Assistant, Tamper-Resistant, 1 Z-Wave Outlet & 1 Always On Outlet, Hub Required, White, Smart Outlet, Lamps, Small Appliances, 55256","price":"$42.46","saving":"","rating":"4.4","reviews":"880 ratings","image":"https://m.media-amazon.com/images/I/81zjscQjLoL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Life is automatic with the Enbrighten Z-Wave Plus In-Wall Smart Tamper-Resistant Outlet. When paired with a compatible hub, the smart outlet controls and schedules plug-in devices through ON/OFF commands and programmed settings. Wirelessly operate lamps, fans, small appliances and more for effortless management of your home. Your automation possibilities are seemingly infinite when connected to hubs from Wink, SmartThings, HomeSeer, Vera, Nexia and more."},{"asin":"B07SV59WXL","title":"Feit Electric Smart Plug, WiFi Plug Works with Alexa and Google Home, Indoor Plug, No Hub Required, 2.4Ghz Network, Remote Control from Anywhere, 15 AMP, Smart Outlet Plug, White","price":"$9.99","saving":"-33%","rating":"4.4","reviews":"1,527 ratings","image":"https://m.media-amazon.com/images/I/71+hsAMjrPL._AC_SY300_SX300_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"This Feit Electric PLUG/WIFI Wi-Fi enabled smart plug turns any device into a smart device. Control you devices from anywhere together with one smart plug. Ideal for home appliances, lights and more. Control from anywhere - turn on or off, set schedules or timers with an intuitive smartphone app. Combine devices together for unified control with one single tap. Combine living room bulbs, plugs and switches together for more convenient access. Use simple voice commands with your smart plug and Alexa or Google Assistant. Buyer it from SHIPS FROM AND SOLD BY AMAZON.COM to ensure genuine product."},{"asin":"B0948L7Z5W","title":"GE CYNC Smart Plug, Indoor Bluetooth and Wi-Fi Outlet Socket, Works with Alexa and Google (1 Pack)","price":"$20.26","saving":"-9%","rating":"4.3","reviews":"2,313 ratings","image":"https://m.media-amazon.com/images/I/61SMnjg+x3L._AC_SY300_SX300_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"The Cync Smart Plug makes any lamp or device that plugs into a wall smart. The built-in Wi-Fi bridge adds out-of-home control for your lighting and devices and voice control when paired with a voice assistant. The plug also enables scheduling and scene setting to traditional bulbs and devices. The Smart Plug adds smart functionality to fixtures where smart bulbs won't fit or match the look of the fixture. Pair the Smart Plug with Cync or C by GE Smart Bulbs in other fixtures and Smart Switches to control all your lights together. Use the Smart Plug with other devices like curling irons, fans and electronic devices to turn them on or off remotely or schedule them to operate around your routine. The Smart Plug connects directly with Google Home and Amazon Alexa devices without a hub required. Simply plug into a standard wall socket and you're ready to go."},{"asin":"B09LXPK5XM","title":"GHome Smart Mini Plug Compatible with Alexa and Google Home, WiFi Outlet Socket Remote Control with Timer Function, Only Supports 2.4GHz Network, No Hub Required, ETL FCC Listed (1 Pack), White","price":"$7.99","saving":"","rating":"4.3","reviews":"1,318 ratings","image":"https://m.media-amazon.com/images/I/31+XlEqnSML._SX342_SY445_.jpg","availability":"Only 5 left in stock - order soon.","tag":"","description":"Mini Smart WiFi Socket - Make Your home smarter, Manage Your home appliance smartly. A Must Have App Download : Search on App store, Google Play, or Scan the Qr code on the User Manual and install it. Easy to Set Up - Works with App Step 1: Download the App; Step 2: Plug the Smart Wi-Fi Plug into any outlet; Step 3: Configure Smart Wi-Fi Plug preferences on the App.- Set up with Amazon Alexa Step 4: Set Your Echo Speaker by Alexa App Step 5: Enable Our Skill in Alexa APP Note: Please keep in mind that the App should be set up first before setting up the Alexa device,  please also refer to user manual for more detailed steps. Mini Socket works with your existing home Wi-Fi (2.4 GHz band) without the need for a separate hub.Enjoy Piece of Mind You can use the free app to create schedules for connected electronics based on your daily and weekly routines. Scheduling also helps lower your electricity bill by keeping power-hungry devices off when they are not needed.Certified SafeMulti Protect safety system (Fire Prevention & Over load protection) and approved certifications (Fcc Etl Ce RoHS) ensures complete protection for you and your devices.What You Get Mini Socket * 1, User Manual * 1, Worry-Free 7×24 hrs friendly customer service.Technical SpecificationsModel Number: WP3WiFi Requirement: 2.4Ghz OnlyRated Voltage: 120V Rated Current: 10A Max Ac Frequency: 2.4 Ghz Max power: 1200W Note: The maximum power changed as the local voltage."},{"asin":"B09JZKK3KS","title":"GHome Smart Mini Plug Compatible with Alexa and Google Home, WiFi Outlet Socket Remote Control with Timer Function, Only Supports 2.4GHz Network, No Hub Required, ETL FCC Listed (4 Pack), White","price":"$19.96","saving":"-17%","rating":"4.4","reviews":"869 ratings","image":"https://m.media-amazon.com/images/I/31Cb0KVz5IL._SY445_SX342_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"About this item                   SAFE DESIGNED&QUICK CONNECTION: Simply plugin and keep the smart outlet connected to your stable 2.4GHz network, the improved WiFi technology let you quick connection and stay stable.     HAND-FREE VOICE CONTROL: Smart plugs that work with Alexa and Google Home Assistant. Just give a simple voice command to Alexa or Google Assistant to control your connected home devices.     APP REMOTE CONTROL FROM ANYWHERE: You also can control your Alexa smart plug via the APP directly when you are away, so long as your phone access a secure network (2.4G,4G, or 5G Wi-Fi).     SCHEDULES&AUTO-OFF TIMER: Easy to set timers and add schedules to connected devices circularly or randomly, making them work as scheduled like auto-off and auto-on.     GROUPING CONTROL & SHARING: Set a group for all wifi smart plugs and control them with simply one tap. Share your wifi plug smart outlets with all family members in a minute."},{"asin":"B09LXGHR5X","title":"GHome Smart Mini Smart Plug, WiFi Outlet Socket Works with Alexa and Google Home, Remote Control with Timer Function, Only Supports 2.4GHz Network, No Hub Required, ETL FCC Listed (4 Pack),White","price":"$19.98","saving":"-20%","rating":"4.2","reviews":"8,201 ratings","image":"https://m.media-amazon.com/images/I/61zNryo7KsL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"The WP3 is GHome smallest mini smart plug. You can use it controlling lamps, fans, heating, kettle, coffee maker, humidifiers and other home electronic appliances.Smart plugs that work with Alexa and Google Home Assistant. You can enjoy the hands-free convenience with its voice control, just give a simple voice command and you enjoy smart and better life. You can control your Alexa smart plug via the APP(OUR APP and Smart Life), also it support Tuya APP."},{"asin":"B09JZDL3JN","title":"GHome Smart Mini Smart Plug, WiFi Plug Outlet Timer Smart Socket Works with Alexa and Google Home, APP Control, No Hub Required, ETL FCC Listed, 2.4GHz WiFi Only","price":"$19.98","saving":"-13%","rating":"4.4","reviews":"1,549 ratings","image":"https://m.media-amazon.com/images/I/31Q+q0TePhL._SX342_SY445_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"Smart Plug, Mini WiFi Outlet Socket Works with Alexa and Google Home, Remote Control, Timer Function, No Hub Required ETL and FCC Listed(4 Pack)"},{"asin":"B0B9WYXN8X","title":"GHome Smart P2-BK Smart Outlet, Black","price":"$23.99","saving":"","rating":"4.3","reviews":"1,970 ratings","image":"https://m.media-amazon.com/images/I/71JGpcW0XrL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Smart Plug Outlet Extender, USB Surge Protector with 3 Smart USB Ports and 3 Individually Controlled Smart Outlets, Works with Alexa Google Home, Wall Adapter Plug Extender for APP Control,15A/1800W"},{"asin":"B09JZCXQNY","title":"GHome Smart Plug Outlet Extender, Surge Protector with 3 Individually Controlled Smart Outlets and 3 Smart USB Ports, Works with Alexa Google Home, Wall Adapter Plug for APP Control,15A/1800W","price":"$19.99","saving":"","rating":"4.2","reviews":"2,953 ratings","image":"https://m.media-amazon.com/images/I/31ThocAKmSL._SY445_SX342_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Why Choose US?More Convenience---3 smart AC plug and 3 smart usb port support Voice Control and Remote Control ,there are also 3 always-on plugs to provide more convenience.High Quality---The updated version of wall outlet extender brings you the best shopping experience, fireproof materials ensure the safety of your electrical appliances.Safety---The safety of hardware and the anti-oxidation of materials have been tested by a large number of safety teams of professional R&D teams."},{"asin":"B099KLNM24","title":"Kasa Outdoor Smart Plug, Smart Home Wi-Fi Outlet Timer, Max Load 15A/1875W, IP64 Weather Resistance, Compatible with Alexa, Google Home & SmartThings, No Hub Required, ETL Certified(KP401)","price":"$22.38","saving":"","rating":"4.6","reviews":"26,830 ratings","image":"https://m.media-amazon.com/images/I/613VWkNY3ZL.__AC_SY300_SX300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Extend your Smart Home to the outdoors with the Kasa Smart Outdoor Plug KP401 with landscape lighting, swimming pool pumps, holiday lights, or other appliances. Use the sunrise/sunset offsetting to better schedule your connected device. The Kasa app contains not only all the feature you expect from TP-Link Kasa family include smart actions, but also guidance for you through each step of the installation to connect your smart plug with your home Wi-Fi, Alexa or Google assistant."},{"asin":"B091FXH2FR","title":"Kasa Outdoor Smart Plug, Smart Home Wi-Fi Outlet with 2 Sockets, IP64 Weather Resistance, Compatible with Alexa, Google Home & IFTTT, No Hub Required, ETL Certified(EP40), Black","price":"$24.99","saving":"","rating":"4.6","reviews":"13,802 ratings","image":"https://m.media-amazon.com/images/I/61soGaMHzrL.__AC_SY300_SX300_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"Extend your Smart Home to the outdoors with the Kasa Smart Outdoor Plug EP40 with landscape lighting, swimming pool pumps, holiday lights, or other appliances. Use the sunrise/sunset offsetting to better schedule your connected device. The Kasa app contains not only all the feature you expect from TP-Link Kasa family include smart actions, but also guidance for you through each step of the installation to connect your smart plug with your home Wi-Fi, Alexa or Google assistant."},{"asin":"B01EZV35QU","title":"Kasa Smart Light Switch HS200, Single Pole, Needs Neutral Wire, 2.4GHz Wi-Fi Light Switch Works with Alexa and Google Home, UL Certified, No Hub Required , White","price":"$14.99","saving":"-25%","rating":"4.6","reviews":"38,410 ratings","image":"https://m.media-amazon.com/images/I/41i+z-JR+zL._SX342_SY445_.jpg","availability":"In Stock","tag":"#1 Best Seller","description":"Control your lights, ceiling fans, and other fixtures from anywhere with the HS200. The smart switch replaces any standard light switch, and connects to your home Wi-Fi in no time through the free Kasa app. Kasa also lets you manage connected fixtures with your smartphone or tablet, including setting schedules, timers and countdowns. For added convenience, you can use your voice to control the HS200 when paired with works with Amazon Alexa, Google assistant and Microsoft cortana.Input Voltage: 100 - 120 VAC, 50/60 Hz, 15 A."},{"asin":"B07S57PQSM","title":"Kasa Smart Plug HS103P3, Smart Home Wi-Fi Outlet Works with Alexa, Echo, Google Home & IFTTT, No Hub Required, Remote Control,15 Amp,UL Certified, 3-Pack , White","price":"$24.99","saving":"","rating":"4.6","reviews":"27,327 ratings","image":"https://m.media-amazon.com/images/I/51Xu+cW-bWL._AC_SY300_SX300_.jpg","availability":"In Stock","tag":"","description":"The HS103 Kasa smart plug is the easiest way you can start controlling lamps, fans, humidifiers and other home electronic appliances. With it adds voice control to any outlet, you could also enjoy the hands-free convenience. The Kasa app contains not only all the feature you expect from TP-Link Kasa family, but also guidance for you through each step of the installation to connect your smart plug with your home Wi-Fi, Alexa or Google assistant."},{"asin":"B07RCNB2L3","title":"Kasa Smart Plug HS103P4, Smart Home Wi-Fi Outlet Works with Alexa, Echo, Google Home & IFTTT, No Hub Required, Remote Control, 15 Amp, UL Certified, 4-Pack, White","price":"$29.99","saving":"","rating":"4.6","reviews":"53,342 ratings","image":"https://m.media-amazon.com/images/I/51zoLDBO0wL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"Only 5 left in stock - order soon.","tag":"","description":"The HS103 Kasa smart plug is the easiest way you can start controlling lamps, fans, humidifiers and other home electronic appliances. With it adding voice control to any outlet, you could also enjoy the hands-free convenience. The Kasa app contains not only all the feature you expect from TP-Link Kasa family, but also guidance for you through each step of the installation to connect your smart plug with your home Wi-Fi, Alexa or Google assistant."},{"asin":"B07N3CK3MM","title":"Kasa Smart Plug KP200, In-Wall Smart Home Wi-Fi Outlet Works with Alexa, Google Home & IFTTT, No Hub Required, Remote Control, ETL Certified , White, 1 Pack","price":"$19.99","saving":"-33%","rating":"4.6","reviews":"29,473 ratings","image":"https://m.media-amazon.com/images/I/51HjZJoJdYL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"#1 Best Seller","description":"It started in 2015 with a very smart plug. But, before that very smart plug, Kasa Smart was TP-Link Research America - TP-Link’s think tank for all things smart home. Building our name in the land of innovation, known as Silicon Valley, we were tasked with doing a deep dive into the smart home market to create customer-centric, reliable and quality products."},{"asin":"B08LN3C7WK","title":"Kasa Smart Plug Mini with Energy Monitoring, Smart Home Wi-Fi Outlet Works with Alexa, Google Home & IFTTT, Wi-Fi Simple Setup, No Hub Required (KP115), White – A Certified for Humans Device","price":"$12.00","saving":"-48%","rating":"4.4","reviews":"15,939 ratings","image":"https://m.media-amazon.com/images/I/31E320aBTCL._SY445_SX342_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Control lighting, fans, humidifiers and other appliances from anywhere with the Kasa Smart Wi-Fi Plug KP115 with Energy Monitoring. Monitor every consumption of your plug-in devices and set times and schedules to avoid waste. Add voice control to any outlet when paired with Alexa or Google assistant. The Kasa app contains not only all the feature you expect from TP-Link Kasa family, but also guidance for you through each step of the installation to connect your smart plug with your home Wi Fi, Alexa or Google assistant."},{"asin":"B07G95FFN3","title":"Kasa Smart Plug Power Strip HS300, Surge Protector with 6 Individually Controlled Smart Outlets and 3 USB Ports, Works with Alexa & Google Home, No Hub Required , White","price":"$59.99","saving":"-25%","rating":"4.6","reviews":"7,545 ratings","image":"https://m.media-amazon.com/images/I/61PI8akrKOL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"With independent control of 6 devices and extra USB ports to charge 3 others, the kasa smart Wi-Fi power strip is ideal for your family rooms, home office or small business, power up your office remotely and even your holiday lights. Remotely control each outlet with the kasa smart app or use voice commands with Alexa, Google assistant, or Microsoft cortana. Kasa app system requirement: iOS 10 or Android 4.4 or higher."},{"asin":"B091699Z3W","title":"Kasa Smart Plug Ultra Mini 15A, Smart Home Wi-Fi Outlet Works with Alexa, Google Home & IFTTT, No Hub Required, UL Certified, 2.4G WiFi Only, 1-Pack(EP10), White","price":"$9.99","saving":"","rating":"4.6","reviews":"2,045 ratings","image":"https://m.media-amazon.com/images/I/51420cbALHS.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"The EP10 Kasa mini smart plug is the easiest way you can start controlling lamps, fans, humidifiers and other home electronic appliances. With it adding voice control to any outlet, you could also enjoy the hands-free convenience. The Kasa app contains not only all the feature you expect from TP-Link Kasa family include smart actions, but also guidance for you through each step of the installation to connect your smart plug with your home Wi-Fi, Alexa or Google assistant."},{"asin":"B08RRVKL3S","title":"Leviton Decora Smart Plug, Wi-Fi 2nd Gen, Works with Matter, My Leviton, Alexa, Google Assistant, Apple Home/Siri & Wire-Free Anywhere Companions for Switched Outlet, D215P-2RW, White","price":"$27.24","saving":"","rating":"4.4","reviews":"3,251 ratings","image":"https://m.media-amazon.com/images/I/31Vka6DTmTL._SY445_SX342_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"Decora Smart Wi-Fi 2nd Gen devices connect to a Wi-Fi network and the My Leviton app to provide wireless lighting control for the whole home. The Leviton Decora Smart Wi-Fi 2nd Gen Mini Plug-In Switch is an affordable solution that makes it easier than ever to control plug-in lamps, holiday lighting, electronics, and small appliances. Add smart lighting control to any room or home. Firmware update available via the My Leviton app to enable Matter connectivity - connect locally to any Matter enabled Smart Home platform of your choice. Use your voice with Amazon Alexa, Google Assistant, or Apple Siri. Use the My Leviton app on a smartphone, tablet or computer to control lighting or adjust schedules when away from home or anywhere you have access to the internet.The 2nd Gen mini plug-in design allows for smart plugs to be plugged into a 120V standard, AFCI or GFCI outlet – ideal for controlling multiple devices in areas like living rooms, bedrooms, and kitchens. The integrated button provides manual ON/OFF control at any time. Add optional wire-free 3-way/multi-location where you need it, simply pair with wire-free DAWSC Anywhere Switch Companion (no wiring required). 15A General Use, 5A LED/CFL, 1500W Incandescent/Halogen, 15A Magnetic, 3/4 HP Motor. Decora Smart Wi-Fi 2nd Gen devices operate on 2.4 GHz."},{"asin":"B08YPFFM58","title":"Lutron Caséta Weatherproof+ Outdoor Smart Plug On/Off Switch | Works with Alexa, Google Assistant, Ring, Apple HomeKit (Smart hub Required) | for Landscape and String Lighting | PD-15OUT-BL | Black","price":"$79.95","saving":"","rating":"4.8","reviews":"1,070 ratings","image":"https://m.media-amazon.com/images/I/51dv+GhOpSL._AC_SY300_SX300_.jpg","availability":"In Stock","tag":"","description":"The Caseta Weatherproof+ Outdoor Smart Plug is IP66-rated, which means it is protected against dust, dirt, and severe rainfall. It is built to last, rated to withstand temperatures from -4 to 122 F, and its black, polycarbonate body delivers long-term durability, UV resistance, and full protection of its internal electronics. Smart home - meet your smart yard. With the Lutron Caseta Smart Hub (L-BDG2-WH, sold separately), you can toss your traditional timer - effortlessly schedule and control your outdoor lights year-round, without any need for manual adjustments. The plug will not lose its place as the sun rises and sets, as the seasons change, and as you gain or lose an hour with Daylight Savings. The plug is perfect for landscape lighting, patio string lighting/holiday lights (1,000s of ft of LED and 100s of ft of incandescent), as well as inflatables, and small pumps and motors (up to 1/2 HP). You can also add a Lutron Caseta Smart Hub (sold separately) to unlock smart control of your Outdoor Smart Plug. The Plug works with Alexa, the Google Assistant, Apple Home, Ring, and more. Control the plug in a variety of ways, via your preferred voice assistant, the Lutron app, or a Pico remote (sold separately)."},{"asin":"B07VCDFM53","title":"meross Outdoor Smart Plug, Outdoor Wi-Fi Outlet with 2 Grounded Outlets, Remote Control, Timer, Waterproof, Works with Amazon Alexa, Google Home, SmartThings, 2.4Ghz only, FCC Certified, Non-HK","price":"$17.20","saving":"-22%","rating":"4.4","reviews":"6,422 ratings","image":"https://m.media-amazon.com/images/I/41OgvqWbbfL._SY445_SX342_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"About this item                   Remote and Voice Control: Control the two sockets individually from anywhere anytime. Compatible with Aamzon Alexa and Google Home, simply use your voice command to control each individual socket. All data is securely transmitted and stored using AWS servers in US. Note: Connect your Phone to 2.4GHz home Wi-Fi while setting up the outdoor Wi-Fi plug.     Schedule and Timer Setting: Schedule each socket to turn on and off automatically. Added benefit of saving energy when the plugged-in appliances are not needed or are left on by accident. Support sunrise and sunset setting.     Reliable Connection: Meross smart outdoor plug has longer WiFi connection range and lower offline rate. Perfect for your Garden, Backyard, Porch, Balcony, Garage or Basement where the home WiFi may not be well covered.     For Outdoor and Indoor: IP44 weatherproof housing and sockets cover. Ideal for Garden, Backyard, Christmas tree, Kitchen, Landscape lighting, Bathroom, Porch, Balcony, Garage, Basement, Patio or Electric grill, Sprinkler, Lamps and other outdoor or indoor-use electric appliances, etc. Do not use it for pump.     Safety: Certified by FCC/ETL(Control Number 5012797). Enhanced waterproof design. Equipped with fire-retardant housing and overload protection circuit. Never allow other low quality plug endanger the safety of your family."},{"asin":"B08BFGRY9C","title":"meross Outdoor Smart Plug, Outdoor Wi-Fi Outlet with 3 Independent Sockets Compatible with Apple Homekit, Alexa and SmartThings, Voice & Remote Control, Timer, 2.4 GHz only","price":"$32.99","saving":"-11%","rating":"4.3","reviews":"4,252 ratings","image":"https://m.media-amazon.com/images/I/41cV9rRaqgL._SY445_SX342_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"About this item                   3 Independent Outlets Design: Equipped with 3 individually controlled sockets. 3 outlets WORK INDEPENDENTLY of one another. Powered by Mediatek IoT chipset, meross outdoor smart outlet has longer Wi-Fi connection range and lower offline rate. Please also make sure connect your Phone to 2.4GHz home Wi-Fi while setting up the outdoor Wi-Fi plug.     Ideal for Outdoor Use: IP44 weatherproof housing and sockets cover which help prevent rain from getting in. Outdoor smart plug is made for Garden, Backyard, Christmas tree, Kitchen, Landscape lighting, Bathroom, Porch, Balcony, Garage, Basement, Patio or Electric grill, Sprinkler, Lamps and other outdoor or indoor-use electric appliances, etc. DO NOT USE IT FOR PUMP and EXTREME CONDITION     Remote Control: To enable HomeKit remote control, you need a HomePod, an Apple TV 4K, Apple TV HD. Set any of these Apple devices in your house as a HomeKit bridge and connect it to your home Wi-Fi network. Keep in mind that once your HomeKit bridge is set up, it has to be kept online. If it is powered off or disconnected from the Wi-Fi, it will fail to respond when try to control the device remotely.     Schedule and Timer: Schedule each socket to turn on and off automatically. You can prepare your schedule in advance and will not forget to turn off the outdoor plug, decreasing electrical waste and environmentally friendly. Support sunrise and sunset setting.     Voice Control: Control your devices via voice command, Note: HomeKit remote control requires additional Apple device as a home hub such as HomePod or Apple TV. Control your devices via voice command, just say:“Hey siri, turn on the Sprinkler.”     For Android users: It works with any Android smartphone or tablet with OS 4.1 or higher. Android users will have an effortless experiences when configure with Meross app. Then skill 'meross' with your smart speakers as you wish."},{"asin":"B0BJF1Z8TL","title":"meross Outdoor Smart Plug, WiFi Outdoor Outlet Work with Apple HomeKit, Amazon Alexa,SmartThings,2.4Ghz Waterproof Smart Outdoor Plug with Voice & Remote Control, Schedule Timer","price":"$23.85","saving":"","rating":"4.4","reviews":"2,628 ratings","image":"https://m.media-amazon.com/images/I/41CpXE4J9+L._SX342_SY445_.jpg","availability":"In Stock","tag":"","description":"About this item                   Voice Control: Compatible with Alexa, and Apple HomeKit（Apple HomeKit sold separately). Perfect for parents, the elderly, the disabled, or if the plug is hard-to-reach.     Remote Control & Local Control: Simply plug in a device and control the weather-resistant outlet with the home app or Meross app, remotely adjust turn on/off from anywhere with 2.4 GHz Wi-Fi Internet access at any time. Additionally, enjoy millisecond response and no drop-off with superfast local control when you're at home. NO hub required.     Schedule & Routine Offline Execution: You can create customized schedules(including sunrise and sunset) according to your daily routines, the schedules can still perform even if the internet is down. Not only more convenient but also energy-saving and environmentally friendly.     Multi-compatible & Safety: The WiFi plug is compatible with a variety of light bulbs: LED CFL and INC. Certified by FCC/ETL(Control Number 5012797). Upgrade Version WiFi outdoor plug equipped with fire-retardant housing and overload protection circuit.     Ideal for Outdoor Use: IP44 waterproof housing and sockets cover help to protect your dimmer plug against splashes of water and dust. Designed for indoor and outdoor use. Ideal for Garden, Backyard, Christmas tree, Holiday lights, Kitchen, Landscape lighting, Bathroom, Porch, Balcony, Garage, Basement, Patio, etc. Do not use it for a pump."},{"asin":"B087CR6S12","title":"meross Smart Plug Mini, 15A & Reliable Wi-Fi, Support Apple HomeKit, Siri, Alexa, Echo, Google Assistant and Nest Hub, App Control, Timer, No Hub Needed, 2.4G WiFi Only, 1 Pack","price":"$15.99","saving":"","rating":"4.1","reviews":"767 ratings","image":"https://m.media-amazon.com/images/I/31lHffM0-RL._SX342_SY445_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"About this item                   Remote Control: To enable HomeKit remote control, you need a HomePod, an Apple TV 4K, Apple TV HD, or an iPad. Set any of these Apple devices in your house as a HomeKit bridge and connect it to your home 2.4GHz Wi-Fi network. Keep in mind that once your HomeKit bridge is set up, it has to be kept online. If it is powered off or disconnected from the Wi-Fi, it will fail to respond when you intend to control the device remotely.     Voice Control: You can control your devices hands free, just give voice commands to turn on/off the connected devices. Compatible with Apple HomeKit, Apple Watch, Siri, Carplay, Amazon Alexa, Google Assistant.     Compact Size: Smart plug occupies only one socket, the device allows you to stack two mini smart plugs in the same outlet, which is convenient and practical.     Schedule: You can schedule connected devices to turn on and off automatically by smart plugs. Save energy when lights are not needed or left on by accident. Sunrise and sunset setting are supported.     Quality and Service : The mini plug is made of PC flame retardant material, and has been approved for safety and quality assurance. Certified by ETL and FCC, it supports home appliance up to 15A."},{"asin":"B074K3NFZQ","title":"meross Wi-Fi Smart Plug Mini, 15 Amp & Reliable Wi-Fi Connection, Alexa and Google Voice Control, App Remote Control, Timer, Occupies Only One Socket, No Hub Needed","price":"$9.99","saving":"","rating":"4.4","reviews":"11,186 ratings","image":"https://m.media-amazon.com/images/I/31DvdMp+OyL._SX342_SY445_.jpg","availability":"In Stock","tag":"","description":"About this item                   APP Remote Control: Turn electronics on/off from anywhere on your smart phone with the Meross app. You can check to see the status of connected devices from anywhere any time. All data is securely transmitted and stored using AWS servers in US.     Voice Control: You can control your devices hands free, just make a voice commands to turn on/off the connected devices. Compatible with the Amazon Alexa, Google Assistant and SmartThings.     Compact Size: Occupies only one socket, allows you to stack two Mini Smart Plugs in the same outlet, more convenient and practical.     Schedule and Timmer Setting: You can schedule connected device to turn on and off automatically. Added benefit of saving energy when lights are not needed or are left on by accident. Support sunrise and sunset setting.     Quality and Service : The mini plug is made of PC flame retardant material, has been approved for safety and quality assurance. Certified by ETL(5009830) and FCC(2AMUU-MSS110) in USA, PSE(18031354) and Telec(Mark Number JN0810 i01) in Japan. And it supports any home device up to 15A. Any problem, please feel free to contact us without any hesitation and we’ll find a solution until you are satisfied."},{"asin":"B07XD578LD","title":"Philips Hue Smart Plug, White - 1 Pack - Turns Any Light Into a Smart Light - Control with Hue App - Compatible with Alexa, Google Assistant, and Apple HomeKit","price":"$34.99","saving":"","rating":"4.7","reviews":"9,745 ratings","image":"https://m.media-amazon.com/images/I/61NMjz4Tm3L.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Transform any light in your home into a convenient smart light with the Philips Hue Smart Plug. Compatible with both Bluetooth and the Hue Bridge (sold separately), this compact and unassuming accessory allows you to control your lights with the Hue app or your voice. Use Bluetooth for instant light control or connect to a Hue Bridge to unlock the full power of Hue. With the Bridge, you can take advantage of advanced features like multiple room control, out-of-home control, automations, and compatibility with Matter, all while enjoying reliable and secure connectivity that won't slow down your Wi-Fi. Plus, the plug's sleek and unobtrusive design blends seamlessly into any home or office environment, so you can enjoy the benefits of smart lighting without sacrificing style. Upgrade your home lighting with the Philips Hue Smart Plug."},{"asin":"B0B9WQL3FD","title":"Smart Plug Outlet Extender, USB Surge Protector with 3 Individually Controlled Smart Outlets and 3 Smart USB Ports, Works with Alexa Google Home, Wall Adapter Plug Extender for APP Control,15A/1800W","price":"$23.99","saving":"","rating":"4.3","reviews":"1,970 ratings","image":"https://m.media-amazon.com/images/I/51veqzsJz7L.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"Only 8 left in stock (more on the way).","tag":"","description":"Smart Plug Outlet Extender, USB Surge Protector with 3 Smart USB Ports and 3 Individually Controlled Smart Outlets, Works with Alexa Google Home, Wall Adapter Plug Extender for APP Control,15A/1800W"},{"asin":"B07JB5TQSG","title":"Smart Plug, Smart Home Outdoor Etekcity WiFi Outlet with 2 Sockets for Outdoor Lights, Timer Function & Energy Monitoring, Works with Alexa & Google Home, Wireless Remote Control, ETL Listed","price":"$25.99","saving":"","rating":"4.6","reviews":"4,351 ratings","image":"https://m.media-amazon.com/images/I/61srharATLL.__AC_SY300_SX300_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"Once you set up your Smart Outdoor Wi-Fi Outlet, you won't have to take another step outside to manage them. With two outlets (which can be programmed and controlled individually), you enjoy twice the smarts in one device. Try plugging seasonal string lights into one socket, and a year-round fountain in the other. Whether you're indoors or out of town, all the power is in your hands. Take control with your phone in the free VeSync app."},{"asin":"B09LGZNQD8","title":"SONOFF S40 WiFi Smart Plug with Energy Monitoring, 15A Smart Outlet Socket ETL Certified, Work with Alexa & Google Home Assistant, IFTTT Supporting, 2.4Ghz WiFi Only -A Certified for Humans Device","price":"$11.02","saving":"-35%","rating":"4.2","reviews":"2,057 ratings","image":"https://m.media-amazon.com/images/I/51gLaKRTpWL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"About this item                   [Monitor Energy Consumption]:Keep track of real-time power, current and voltage of your appliances on App.and Measure your appliances’ power consumption for 100-day daily/monthly energy usage data and total electricity cost.     [Works with Alexa & Google Home,IFTTT Supporting]: Link \"eWeLink Smart Home\" skill. You can directly ask Amazon Echo/Echo Dot/Amazon Tap to turn on/off your SONOFF devices.Link \"eWeLink Smart Home\" on Google Home app, start to voice control your SONOFF devices on Google Home.     [Smart Remote Control Plug]: You can remotely/timely control ON/OFF any connected home appliance via APP eWeLink on your smart phone or tablet. No distance/time limitation.     [Set time schedules for the lights and home appliances]: You can set countdown/single/repeat timers to auto-turn on/off the WiFi controlled outlet on App. One tap ON/OFF Energy Saving.     [Share control of devices to others]: You can simply share control of your home appliances to others so that they can also turn on/off the devices remotely.       \n                    ›  See more product details"},{"asin":"B0BMWFQNDC","title":"TP-Link Tapo Apple HomeKit Smart Plug Mini, Compact Design, 15A/1800W Max, Super Easy Setup, Works with Siri, Alexa & Google Home, UL Certified, 2.4G Wi-Fi Only, White, Tapo P125(2-Pack)","price":"$19.99","saving":"-20%","rating":"4.4","reviews":"900 ratings","image":"https://m.media-amazon.com/images/I/41Hs2lzprCL._SY445_SX342_QL70_ML2_.jpg","availability":"Available to ship in 1-2 days","tag":"","description":"Buy with Confidence Founded in 1996, TP-Link is a global provider of reliable networking and smart home devices, involved in all aspects of everyday life. With a proven heritage of stability, performance and value, TP-Link has curated a portfolio of products that meet the networking needs of all individuals. Now, as the connected lifestyle continues to evolve, the company is expanding today to exceed the demands of tomorrow. Industry-Leading Support TP-Link offers 24/7 technical support and 2-year warranty for most home products. TP-Link Tapo Apple HomeKit Smart Plug Mini, Tapo P125 Live smarter with Tapo P125 smart plug to preset and remote control your lamps, fans, humidifiers, and other home electronic appliances. Fully compatible with Apple HomeKit, Alexa and Google Assistant to enjoy hands-free convenience. The Tapo app contains not only all the features you expect from the TP-Link Tapo family but also guidance for you through each installation step to set up your smart plugs. Tapo P125 also provides an easy Bluetooth setup."},{"asin":"B0BXMNJDW3","title":"TP-Link Tapo Matter Supported Smart Plug Mini, Compact Design, 15A/1800W Max, Super Easy Setup, Works with Apple Home, Alexa & Google Home, UL Certified, 2.4G Wi-Fi Only, White, Tapo P125M(3-Pack)","price":"$26.71","saving":"","rating":"4.4","reviews":"900 ratings","image":"https://m.media-amazon.com/images/I/41juKnsq04L._SY445_SX342_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"Benefits of Matter smart devices: 1. Interoperability: Matter devices will be able to communicate with each other regardless of the brand or manufacturer, making it easier for consumers to build and expand their smart home ecosystems. 2. Enhanced functionality: Matter devices will offer advanced functionality such as improved security, increased energy efficiency, and better connectivity, making it easier to control your home's devices remotely and more efficiently. 3. Greater convenience: With Matter devices, you can control all your smart home devices from a single app, reducing the need for multiple apps for different devices. 4. Improved user experience: The Matter protocol is designed to provide a seamless and user-friendly experience for consumers, allowing for easy setup and management of smart home devices. 5. Future-proofing: Matter devices will be compatible with future updates and advancements in technology, ensuring that your smart home system remains up-to-date and compatible with new devices and features. Overall, Matter smart devices offer a more efficient, convenient, and streamlined way to control your home's devices and build your smart home ecosystem."},{"asin":"B08HG81H3W","title":"UltraPro Smart Plug WiFi Outlet, Smart Home, Smart Switch, Smart Outlet, Works With Alexa, Echo & Google Home, No Hub Required, App Controlled, ETL Certified, Electrical Outlet Switch, 4 Pack, 51411","price":"$21.61","saving":"","rating":"4.2","reviews":"1,282 ratings","image":"https://m.media-amazon.com/images/I/61g3T0zhX3L.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"Enjoy professional automation with DIY ease from the UltraPro Mini Plug-in Wi-Fi Smart Switch 4 Pack. Connect the smart switches to a 2.4GHz Wi-Fi network to control and schedule plug-in lights and other indoor devices. By supporting dual- and tri-band routers, the switches are ideal for the latest equipment. The easy-to-use UltraPro app with hassle-free pairing options is available on the Apple App Store and Google Play. Direct compatibility with Amazon Alexa and Google Assistant allows convenient voice commands without a hub. Each switch works with all bulb types and features one grounded outlet as well as a manual ON/OFF button. To fully automate your life, connected appliances are controlled by scheduled settings, weather changes, location and full-range countdowns. Custom ON/OFF commands support operation around the clock while preset automations allow lighting control at the perfect time of day. Smart is simple with the UltraPro Mini Plug-in Wi-Fi Smart Switch 4 Pack."},{"asin":"B08NXY7WWX","title":"Wyze Plug Outdoor, Dual Outlets Energy Monitoring, IP64, 2.4GHz WiFi Smart Plug, Works with Alexa, Google Assistant, IFTTT, No Hub Required, Black – A Certified for Humans Device","price":"$17.99","saving":"","rating":"4.5","reviews":"2,571 ratings","image":"https://m.media-amazon.com/images/I/51N4mIL+E+L._AC_SY300_SX300_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"Control from Anywhere Quickly turn your devices on/off, set or edit schedules, and see the current status of your Wyze Outdoor Plug from anywhere with the Wyze app. Two for One Control Wyze Plug Outdoor has two individually controlled outlets allowing you to plug two different devices into each Wyze Plug Outdoor. Voice Assistant Ready Wyze Plug Outdoor works with Amazon Alexa and the Google Assistant. Built-in Light Sensor With a built-in light sensor, Wyze Plug Outdoor can turn on and off based on the environmental light so lights can turn on when it's dark and off when it's bright. And since the sensor is built-in, Wyze Plug Outdoor can do all of this without a WiFi connection. Energy Monitoring Wyze Plug Outdoor monitors the energy used and can even send notifications if the monthly consumption exceeds a specified level. IP64 Rated Wyze Plug Outdoor is ready to face whatever Mother Nature throws at it. It can handle rain, wind, snow, and dust and operates from -4°F - 120°F. Wyze Plug Outdoor also has rubber outlet covers that can be used when the device doesn't have anything plugged in to protect the hardware. Vacation Mode Wyze Plug Outdoor can make it look like you're home by automatically turning your devices on/off at random times."},{"asin":"B07XZT24B8","title":"Wyze Plug, 2.4GHz WiFi Smart Plug, Works with Alexa, Google Assistant, IFTTT, No Hub Required, Two-Pack, White","price":"$16.99","saving":"-15%","rating":"4.3","reviews":"11,613 ratings","image":"https://m.media-amazon.com/images/I/61WfQ4LSdyL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Compact Wi-Fi smart plug. Switches are a thing of the past."}]},{"name":"Smart Lighting","url":"smart-lighting","dontInclude":[""],"keyword":["led","bulb"],"category":"smart-home","description":"Configure your rooms and offices with smart lighting and control all kind of lights by just one command to Alexa.","content":[{"asin":"B08WWTWXQJ","title":"Armacost Lighting 423500 RibbonFlex Home 16ft. RGB+W Smart LED Tape Light Kit, multi-color and white","price":"$36.20","saving":"-40%","rating":"4.5","reviews":"699 ratings","image":"https://m.media-amazon.com/images/I/61lMZw3WVVL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"The Armacost Lighting RibbonFlex Home Multicolor RGB+ White Smart LED strip light kit is the perfect solution for versatile indoor accent lighting including under cabinets, shelving, decks and patios. Full-range brightness and color control with included wireless remote; RF technology works through walls up to 50 ft. away. Adhesive backing for easy installation."},{"asin":"B0C4159QZH","title":"BLACK+DECKER Works with Alexa Smart LED Under Cabinet Lighting Kit, Motion Sensor, Dimmable, 3 Color Settings, for Kitchen, Cabinets and Closets, (4) 9&quot; Bars, White, A Certified for Humans Device","price":"$111.23","saving":"-7%","rating":"4.6","reviews":"1,150 ratings","image":"https://m.media-amazon.com/images/I/61YsvRBfT+L._AC_SX300_SY300_.jpg","availability":"In Stock","tag":"","description":"Light up your kitchen with the simple tap of an app or voice command. Create a lighting and ambient experience unlike any other with our under cabinet lighting that’s compatible with Alexa devices; making it a Certified for Humans device with no third-party app required. Whether you're in the living room and want to turn the lights on in your kitchen without getting up from the couch, or you're on your way home from work and want to walk in to a lit-up house, you can virtually turn your under cabinet lights on from anywhere. Dim the lights or set a routine with the app or voice control without leaving your bed. The best part? You can even pair these lights with other smart devices in your kitchen, closet, garage, workshop or anywhere in your home, for easy lighting control in any area of your house! This 4-pack of 9” ultra-thin light bars illuminate a wide, flicker-free zone that can be changed from full brightness with soft white, white or daylight white to night mode in a matter of seconds. Worried about installation? This voice-activated smart LED lighting solution can be easily installed in a matter of minutes with no stress, no tools and no confusion for frustration-free installation. You can even turn the lights on and off by waving your hand under the motion sensor for touch-free activation that leaves your lights bright and your kitchen clean."},{"asin":"B084FLHDDM","title":"Catalina Lighting 96&quot; Track Ceiling Light, Oil Rubbed Bronze, Transitional 5-Light LED Flex Track, Bulb Included, for Kitchen, Living Room, Home Lighting","price":"$136.79","saving":"-32%","rating":"4.2","reviews":"507 ratings","image":"https://m.media-amazon.com/images/I/51xNZWRjynL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Brighten your space just the way you want it with the Catalina Transitional 5-Light Flex Track Ceiling Light. This light fixture comes ready for application, with five highly efficient GU10 LED lights that come integrated into the track to save you time, energy, and money. Made from durable metal materials with a dark bronze finish, this fixture is both beautiful and long-lasting. The flexible track rail can be bent, arched, and angled to fulfill your exact interior design vision, and the adjustable cylinder shades offer even more freedom in directing and positioning illumination to your liking. Connect this lighting fixture to a standard dimmer switch, and the luminary settings can be adjusted and customized until you reach your preferred level of brightness. This light is also smart home compatible, and can be plugged into a smart outlet or smart switch to connect with Alexa, Google Home, or other smart home devices. With articulate provided instructions in English, Spanish and French, this ceiling light features a center canopy which can be mounted to any ceiling or wall junction box with the included installation and mounting kit. To build onto this track light, additional fixtures with joiners may be purchased and added, resulting in a brilliant light display with few limits. This impressive light fixture measures 96\" x 10.25\" x 4.38\"."},{"asin":"B07QR11G4M","title":"Ciata Rechargeable Light Bulbs - Power Outage Supplies, Battery Operated Light Bulb with Rechargeable Battery Powered - Lasts 3-4 Hours - with a Hook for Camping, Cordless Rechargeable - Pack of 4","price":"$30.18","saving":"","rating":"4.6","reviews":"423 ratings","image":"https://m.media-amazon.com/images/W/MEDIAX_792452-T1/images/I/61PRQvfWYTL.__AC_SY445_SX342_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Tired of getting caught unaware by power outages? No one can really say when power outages can happen. But suddenly getting left sitting in the dark can be scary, or worse, dangerous, especially if the blackout is the result of an earthquake or hurricane. Many opt to use flashlights, smartphones, or even light up candles. But flashlights can be unwieldy, especially if you need to keep your hands free in the dark. Smartphone batteries are better saved for critical communication. Candles can be downright dangerous when left unattended. Light up using a safe, reliable power source with Ciata Lighting's LED Smart Emergency Light Bulb! Each one of our light bulbs can illuminate any given area with 900 Lumens intensity and can light up an entire room for almost 4 hours when they’re unplugged. Our product is most especially helpful in urgent situations to prevent panic and for you to perform the necessary steps to cope with the first few disorienting hours of power outages. Our bulbs are also a suitable, more portable alternative to heavy lanterns when roughing it out in the wilderness. Each purchase comes with 2 bulbs, which will give you roughly 6 to 8 hours of illumination. When the battery-powered bulb is not in use, you can connect them to any socket just like any regular light bulb. The bulb’s clear bright light will definitely light up even the darkest corners of any room. Still not convinced? Here are more reasons to help you make a decision:  ✅ Energy-saving without compromising our light bulb’s illuminating capacity ✅ Fits any medium size bulb fixture ✅ Compact size ✅ More environment-friendly Be 100% ready for the next power outage! Add Ciata Lighting’s LED Emergency Light Bulb to your Cart NOW!"},{"asin":"B09XYXVZH9","title":"Cree Lighting Connected Max Smart Led Bulb A19 60W Tunable White + Color Changing, 2.4 Ghz, Compatible with Alexa and Google Home, No Hub Required, Bluetooth + WiFi, 3Pk (CMA19-60W-AL-9ACK-B3)","price":"$27.40","saving":"-5%","rating":"4.4","reviews":"1,488 ratings","image":"https://m.media-amazon.com/images/I/81q2kOEdxwL.__AC_SY300_SX300_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"Exceptional smart lighting made simple. Turn on, off or dim your favorite shade of white light for everyday use or get the party started with millions of colors. Control and manage your Cree Lighting Connected Max LED Smart Bulbs from anywhere. Control on the app or with your favorite voice assistant. Set up is fast and easy – pair your bulbs quickly using Bluetooth and then control with WiFi. Enable “Follow the Sun” and your lights will gradually shift throughout day to mimic natural sunlight, which can improve your mood, well-being & productivity."},{"asin":"B08978J94N","title":"Cree Lighting Connected Max Smart Led Bulb A21 100W Tunable White + Color Changing, 2.4 Ghz, Works With Alexa And Google Home, No Hub Required, Bluetooth + Wifi, 1Pk","price":"$12.99","saving":"","rating":"4.1","reviews":"1,169 ratings","image":"https://m.media-amazon.com/images/I/81h-F+G8+YL._AC_SY300_SX300_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"Exceptional smart lighting made simple. Turn on, off or dim your favorite shade of white light for everyday use or get the party started with millions of colors. Control and manage your Cree Lighting Connected Max LED Smart Bulbs from anywhere. Control on the app or with your favorite voice assistant. Set up is fast and easy – pair your bulbs quickly using Bluetooth and then control with WiFi. Enable “Follow the Sun” and your lights will gradually shift throughout day to mimic natural sunlight, which can improve your mood, well-being & productivity."},{"asin":"B08J1D51LC","title":"Cree Lighting Connected Max Smart Led Bulb Par38 Outdoor Flood Tunable White + Color Changing, 2.4 Ghz, Compatible With Alexa And Google Home, No Hub Required, Bluetooth + Wifi, Pack of 4","price":"$65.96","saving":"","rating":"4.2","reviews":"757 ratings","image":"https://m.media-amazon.com/images/W/MEDIAX_792452-T1/images/I/81JxiMvutzL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"Exceptional smart lighting made simple. Turn on, off or dim your favorite shade of white light for everyday use or get the party started with millions of colors. Control and manage your Cree Lighting Connected Max LED Smart Bulbs from anywhere. Control on the app or with your favorite voice assistant. Set up is fast and easy – pair your bulbs quickly using Bluetooth and then control with WiFi. Enable “Follow the Sun” and your lights will gradually shift throughout day to mimic natural sunlight, which can improve your mood, well-being & productivity."},{"asin":"B089SJVP52","title":"Dimunt Floor Lamp LED Floor Lamps for Living Room Bright Lighting, 27W/2000LM Main Light and 7W/350LM Side Reading Lamp, Adjustable 3 Colors Tall Lamp with Remote & Touch Control","price":"$71.56","saving":"-33%","rating":"4.6","reviews":"7,197 ratings","image":"https://m.media-amazon.com/images/W/MEDIAX_792452-T1/images/I/61R1Plt4HxL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"About this item                   【SUPER BRIGHT LED LIGHTING】 Dimunt floor lamp build-in 126+28 high brightness LEDs, Up to 2350 Lumen is enough to light your living room. 34 watts LED floor light instead of halogen lamps burning 200 watts, and you don't need to replace any bulb, very convenient and saving energy.     【MOTHER DAUGHTER FLOOR LAMP】 This modern floor lamp comes with mother daughter lamp heads with different functions. The 27W main lamp effortlessly brightens up the entire space, the 7W side lamp with flexible neck can be freely adjusted up and down within a certain distance, perfect for any task, such as reading, working or sewing. Perfect for friends, grandmas, Mother's Day gifts     【ADJUSTABLE COLORS & BRIGHTNESS】 Both of the light have 3 color temperature 3000K Warm light, 4500K Cool Light ,6000K White light ,3 colors mode which take on greater as your own characteristics choose and personality for your place. Adjustable brightness(10%-100%) can meet the demands of the changing requirement for different scene.     【REMOTE CONTROL & TOUCH CONTROL】 You can easily control the floor lamp without leaving the sofa and warm bed with the remote control, control range is about 32.8ft. You also can control it by touch switch when the remote is broken.     【CERTIFICATION & 3 YEARS QUALITY PROMISE】 Dimunt floor lamp have ETL Certification, we can offers 3 YEARS QUALITY PROMISE, please contact us if you have any questions/concerns. Our customer service team will always react within 24 hours.       \n                    ›  See more product details"},{"asin":"B09V8CR3BC","title":"Enbrighten Premium LED Smart Garden Lights, 12 Landscape Lights, 110ft Cord plus 22ft Lead Wire, Compatible with Alexa and Google Play, Color Changing, App Control, Outdoor Landscape Lighting, 58105","price":"$299.99","saving":"","rating":"4.3","reviews":"617 ratings","image":"https://m.media-amazon.com/images/I/91MnoX+ld5L._AC_SY300_SX300_.jpg","availability":"Only 19 left in stock (more on the way).","tag":"","description":"Experience the future of lighting with the Enbrighten Smart LED Wi-Fi Landscape Lights! Once installed, pair them with the free Enbrighten app — available in the Apple App Store or on Google Play (2.4GHz Wi-Fi required). Within the app, you can fully personalize your space using an impressive variety of colors, preset modes, dimming options and scheduling. There is also the option for full voice control through Amazon Alexa and Google Home. In addition to 56 single colors, six shades of white light, holiday themes and more, you can create your own modes with the app’s deep customization feature. Installation is simple and easy — no matter the location or time of year. Boasting a bold yet sleek design, each puck can be placed directly on the ground, securely planted in the soil via stake and even mounted up above with the included mounting hardware. Each 150-lumen puck is connected by burial-grade cable — perfect for maintaining a clean appearance. To ensure long-life fidelity and your peace of mind, each light is created to last in any environment, fully tested and certified for safety. Enjoy endless possibilities and the convenience of smart controls with the Enbrighten Smart LED Wi-Fi Landscape Lights!"},{"asin":"B07GFV1Y9C","title":"Feit Electric BR30 Smart Flood Light Bulb,2.4GHz WiFi Color Changing and Dimmable, No Hub, Works with Alexa or Google Assistant, BR30/RGBW/CA/AG, 65W, Multi-Color (RGBW), 1 Count (Pack of 1)","price":"$9.84","saving":"-45%","rating":"4.2","reviews":"4,319 ratings","image":"https://m.media-amazon.com/images/I/71XSrsoWqOL.__AC_SY445_SX342_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"The Feit Electric color changing BR30 smart WiFi LED light bulb works with Alexa or Google Assistant (sold separately) and the Feit Electric Android and iOS mobile app. Easily turn lights on/off, dim, set Groups and schedules using your smartphone or control lighting with simple voice commands. The tunable light feature lets you adjusts light color temperature from relaxing 2700K soft white to energizing 6500K daylight. or you can increase the fun and celebrate by choosing light colors. Set up is simple with no special smart home hub required. The LED light bulb connects directly to your 2. 4 GHz WiFi at home and can be controlled from anywhere as long as you have access to WiFi or a cellular network. Designed to fit standard light sockets, the E26 medium base light bulb is an easy and cost-effective way to introduce smart lighting to your recessed and track lighting. This reliable BR30 flood/spot bulb is RoHS and California Energy Commission title 20 compliant, 100% mercury free and will shine for a decade or more without needing to be replaced. Now you can enjoy the advantages of energy saving LED with the convenience of smart home technology. Feit is a leader in first to market lighting innovations and driven to deliver the latest breakthrough in interior and exterior illumination. To us, lighting is everything. The right light can turn a house into a home, make an unsafe area feel more secure, and make navigating your way back to bed a lot easier. Our LED product portfolio includes a full line of energy efficient LED bulbs and retrofit kits. Feit Electric also manufactures energy-efficient LED luminaire including ultra-slim edge-lit ceiling fixtures, lightweight utility shop lights, and weatherproof outdoor LED fixtures. Family owned and operated. Based in Los Angeles, California since 1978. Visit our store and see more of our Feit Electric products by clicking on our brand hyperlink at the top of this page."},{"asin":"B07ZWSZ431","title":"Feit Electric Smart Light Bulbs with RGB Color Changing and Tunable White, 2.4Ghz WiFi Light Bulbs, No Hub Needed, Works with Alexa and Google, Dimmable 60 Watt = LED 9W, OM60/RGBW/CA/AG/3, 3 Pack","price":"$17.88","saving":"-28%","rating":"4.5","reviews":"3,681 ratings","image":"https://m.media-amazon.com/images/I/71YiYDhTlML.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"This versatile OM60/RGBW/CA/AG/3 three-pack of smart LED light bulb works with Alexa or Google Home. Easily turn lights on/off, dim, set groups and schedules. Choose energizing daylight or wind down with relaxing soft white light. Get creative with color, it’s all up to you. Control lighting with simple voice commands and an intuitive mobile app. Set up is simple. The bulbs connect directly to your Wi-Fi at home and can be controlled from anywhere. It has never been easier to customize your home’s lighting to suit your lifestyle."},{"asin":"B07ZWTFLCF","title":"Feit Electric Smart Recessed Light, Fits Most 5-6&quot; Can Housing, Works with Alexa or Google Assistant, 75W Equiv, 2.4GHz WiFi Color Changing and Tunable White, Dimmable, No Hub Needed, LEDR6/RGBW/AG","price":"$14.37","saving":"-42%","rating":"4.3","reviews":"1,043 ratings","image":"https://m.media-amazon.com/images/I/71wMPbKrutL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Convert your old recessed downlights to advanced LED energy-saving technology with the LEDR6/RGBW/AG smart recessed downlight from Feit Electric. Fitting most 5-6 inch recessed can housings, this dimmable color-changing light produces 1000 lumens using only 11. 1 watts - up to 84% less energy than an equivalent 75 watt incandescent. The wireless smart recessed light required 2.4GHz WIFI network. These smart downlights connect directly to your Wi-Fi at home, allowing control over color, dimming, schedules and more with an intuitive mobile app, or your Alexa or Google device. Use AP mode to connect when you are having challenges connecting to the 2.4GHz WiFi network."},{"asin":"B09487WZ51","title":"GE CYNC Smart LED Light Bulb, Color Changing Lights, Bluetooth and Wi-Fi Lights, Works with Alexa and Google Home, A19 Light Bulb (1 Pack)","price":"$12.99","saving":"","rating":"4.3","reviews":"1,417 ratings","image":"https://m.media-amazon.com/images/W/MEDIAX_792452-T2/images/I/71Wc889YZXL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Use Full Color Smart Bulb to change the vibe of any space in seconds. Use millions of colors to change a kids' room with their interests, to create a next level movie night, and support your team on game day. The tunable white spectrum supports your sleep/wake cycle and creates the perfect scene for winding down or waking up. Get added confidence by scheduling your lights so you never coming home to a dark house. With voice control and the ability to control your lights away from home, you'll get the added convenience of controlling your lights while away on vacation or when your hands are full."},{"asin":"B0B3S62CSS","title":"GE CYNC Smart LED Light Bulbs, Bluetooth and Wi-Fi Enabled, Alexa and Google Assistant Compatible, Soft White, A19 Light Bulb (4 Pack), 9.5W","price":"$39.60","saving":"","rating":"4.2","reviews":"1,261 ratings","image":"https://m.media-amazon.com/images/I/71Bub5TGIwL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Smart bulbs that work with Alexa: Select Frustration Free Setup at checkout to have your device automatically paired with your Amazon Alexa device when it arrives. Wi-Fi light bulbs: Easily connect these smart light bulbs directly to your Wi-Fi router, providing voice control for your Cync and C by GE smart bulbs through voice assistants (sold separately) and control away from home - no hub or bridge required. Manage your smart bulbs away from home: Get added home security and convenience by controlling your Wi-Fi light bulbs with the Cync mobile app. With these Cync smart lights, never come home to a dark house or disrupt your comfort from bed. LED light bulbs with optimal daytime light: These dimmable LED light bulbs make warm, soft white light that feels just right. Set scenes for your smart bulbs in the Cync app, such as dimmed light for movie time or bright lights when you get home. LED smart bulbs: These smart lights fit medium base sockets for 60W incandescent A19 bulbs, helping make your house a smart home. These smart LED light bulbs use 84% less energy and last 15 times longer than a 60W incandescent bulbs."},{"asin":"B09ZPZ1FZ3","title":"GE CYNC Smart LED Light Bulbs, Color Changing Lights, Bluetooth and Wi-Fi Lights, Compatible with Alexa and Google Home, BR30 Indoor Floodlight Bulbs (4 Pack) White","price":"$75.99","saving":"","rating":"4.3","reviews":"440 ratings","image":"https://m.media-amazon.com/images/I/71k426E6jLL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"Only 10 left in stock (more on the way).","tag":"Amazon's  Choice","description":"Works with Alexa: Directly connect these smart LED bulbs to your Google Assistant or Amazon Alexa (sold separately) for voice control. With Google Assistant or Alexa, light bulbs with voice control will help create your smart home. Wi-Fi light bulbs: Easily connect these smart light bulbs directly to your Wi-Fi router, providing voice control for your Cync and C by GE smart bulbs through voice assistants (sold separately) and control away from home - no hub or bridge required. Manage smart flood light away from home: Get added home security and convenience by controlling your Wi-Fi light bulbs with the Cync mobile app. With these Cync smart lights, never come home to a dark house or disrupt your comfort from bed. Color changing light bulbs with app: Millions of colors change kids' rooms with their interests, create next level movie nights, and support your team on game day. Adjust the smart bulbs' white to any color between warm, amber and cool, bluish tones. LED smart bulbs: These smart lights fit medium base sockets for 65W incandescent BR30 bulbs, helping make your house a smart home. These smart LED flood light bulbs use 84% less energy and last 15 times longer than 65W incandescent bulbs."},{"asin":"B09ZPX5LWB","title":"GE LED+ Color Changing LED Light Bulbs with Remote, 15W, No App or Wi-Fi Required, PAR38 Outdoor Floodlights (3 Pack)","price":"$45.49","saving":"-5%","rating":"4.5","reviews":"501 ratings","image":"https://m.media-amazon.com/images/I/81HsMhJDqGL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Provides nearly the same light output as a 60-Watt incandescent bulb. Color control your mood with 9 different color settings and with a touch of the remote, this simple LED changes between two everyday dimmable light temperatures (soft white and daylight) and 8 vivid colors. One bulb, one function and no hub or Wi-Fi required. Brightness of 760 lumens and estimated energy cost $1.08 per year. Perfect for parties, holidays, or creating the right moods in your home. Go ahead, add a little color to your life. Simply screw in this LED bulb to enjoy. One remote can control additional GE LED+ color bulbs. Rated to lasts 13 years, based on 3 hours per day use. Electricity cost savings based on using the bulb for 15,000 hours rated life at 11 cent per kilowatt hour compared to fifteen 60-Watt incandescent bulbs and saves $84 on energy costs."},{"asin":"B08T4XD31S","title":"GE LED+ Dusk to Dawn LED Light Bulbs, 8.5W, Automatic On/Off Outdoor Light, Soft White, A19 (2 Pack)","price":"$14.99","saving":"-21%","rating":"4.6","reviews":"3,124 ratings","image":"https://m.media-amazon.com/images/W/MEDIAX_792452-T2/images/I/71nFpYY7cUL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"Stay bright when the sun goes down. Light + Dusk to Dawn. This simple LED is up all night, so you can rest. With a built-in light sensor, this long lasting and energy efficient bulb automatically illuminates to brighten the night. Add to any outdoor fixture for an easy sense of security. Simply screw in this LED bulb to get. Automatic on/off light control from Dusk to Dawn. Simple built-in sensor detects ambient light. Upgrade your home with sunlight sensor light bulbs. The LED+ Dusk to Dawn light bulbs (outdoor) are the perfect upgrade for your fixtures that automatically turn on and off with daylight. Energy efficient LED lights. The Dusk to Dawn light bulbs (outdoor) perfectly replace your outdoor 60 watt light bulbs and were designed to use only 8 watts, extending the life of your sunlight sensor lights and reducing your energy costs. Automatic Dusk to Dawn LED outdoor lighting: These LED light bulbs feature a simple, built-in sensor that detects ambient light to calculate when to power on and off with no scheduling required. Outdoor light bulbs (60-Watt equivalent): Get the efficiency of low wattage light bulbs. The Dusk to Dawn light bulbs are the easiest way to cut costs without sacrificing brightness or automated functionality. LED lights that keep things bright: The Dusk to Dawn LED outdoor lighting will automatically turn on when it gets dark, giving off the appearance that someone is always home."},{"asin":"B09J4HJHFF","title":"GHome Smart Light Bulbs, E26 A19 LED Smart Home Lighting Bulb Works with Alexa & Google Home, 2700K Warm White, 800 LM 8W Dimmable, App Remote Control, 2.4GHz WiFi, No Hub Required, 4 Pack","price":"$16.89","saving":"","rating":"4.1","reviews":"3,515 ratings","image":"https://m.media-amazon.com/images/I/61sX7m1zi8L.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"The Smart bulbs have a variety of features that effectively facilitate your life. Our light bulbs can be used in any place, such as bedroom, living room, study, playroom, baby room, bar, cafe, dining room, and so on. With voice and App control, you no longer have to get up in the winter to turn off the lights or worry about leaving the house without turning them off. Start your smart life now!Features:Voice ControlApp ControlDimmable 1~100%Timer &SchedulesGroup Control80% Energy SavingSpecifications:Color Temp: 2700KLight Emitting Mode: Warm WhitePower Rating: 8WEquivalent: 75WBase Type: E26Brightness:800 lmNote: Wi-Fi Network: 2.4GHz(only)"},{"asin":"B0B71JRMMR","title":"GHome Smart TV LED Backlight, 9.2ft WiFi Strip Light Compatible with Alexa & Google Assistant, App Control, Music Sync 16 Million RGB Color Changing Dimmable for 30-60in TV PC, Home Lighting Decor","price":"$12.98","saving":"","rating":"4.1","reviews":"2,364 ratings","image":"https://m.media-amazon.com/images/W/MEDIAX_792452-T1/images/I/41Zyzzr-HBL._SY445_SX342_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"The App can be downloaded by scanning the QR code of the product manual with smartphone. If your router is dual-band, ensure that 2.4G and 5G networks have different network names - SSID;App connection method can refer to the VideoSuitable for 30-60 inchesNote: Please keep surface clean and dry before sticking the strip light on your TV."},{"asin":"B092CQWFJB","title":"GU10 Smart Bulb 4 Pack, RGBCW Color Changing Alexa LED Light Bulbs 5W - WiFi Halogen Lights Dimmable Music Sync 2.4G WiFi Smart Bulbs Compatible with Google Assistant for Track Lighting","price":"$23.00","saving":"","rating":"4.3","reviews":"2,608 ratings","image":"https://m.media-amazon.com/images/I/61qFCT-IXML.__AC_SY445_SX342_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"About this item                   💡 FASTER TO INSATLL& CONTROL ANYWHERE💡: Just install the AvatarControls APP, open the Bluetooth and connect to 2.4GHz WIFI, it will find the gu10 smart bulb automatically, and start to enjoy smart life, control the smart bulbs anywhere anytime.(the Bluetooth just use for set up)     🎼 SYNC WITH MUSIC 🎼: Smart light bulbs GU10 sync bias lighting to your favorite song and shows how neon changing with the rhythm. It provides 16 million colors, 8 scenes,make a stronger viewing experience     ❤️SMART VOICE CONTROL❤️: Avatar Controls gu10 smart bulbs work with Alexa, Google Home, voice control and hand free. “Alexa, turn on the string light” “Google, turn to blue”     ⏲SET SCHEDULES & TIMERS⏲: Set the WiFi halogen lights to come on in the morning, wake up by a smooth light. Set the lights turn off gradually in the night, so you never have to worry whether you've left any lights on.     ❤️DIMMABLE & GROUP CONTROL❤️: You can set the all Avatar Controls smart item a group, One key control. Also, the gu10 smart bulbs temperature is 2700-6500K, you can adjust brightness, warm white or cool white or RGB lights to meet your need.       \n                    ›  See more product details"},{"asin":"B086QYXRBT","title":"helloify GU10 LED Smart, WiFi Light Bulb Compatible with Alexa Google Home, RGBCW Color Changing, Cool Warm White Dimmable, No Hub Required, 40W Equivalent, RGB+2700K-6500K, 2 Pack","price":"$8.64","saving":"","rating":"4.0","reviews":"531 ratings","image":"https://m.media-amazon.com/images/I/51b1ekF8QTL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Voice Control in Smart Home: Works with Alexa and Assistant, allows you to control this smart light hand-free with simple voice commands. (e.g. \"Alexa, dim the bedroom lights to 30%\")"},{"asin":"B0888BCN3Z","title":"HitLights Smart LED Strip Lights, Music Sync WiFi APP Control Smart LED Strip Lights, Waterproof16 Million Colors RGB Tape Lights (32.8FT Remote)","price":"$33.90","saving":"","rating":"4.3","reviews":"1,472 ratings","image":"https://m.media-amazon.com/images/W/MEDIAX_792452-T2/images/I/81a3kqm42WL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"Only 15 left in stock (more on the way).","tag":"","description":"About this item                   ✨【SUPER BRIGHT LED STRIPS】- Hitlights Dimmable LED Strip Light Kit with SMD 5050 RGB 300 LEDs, is ultra brighter and more durable than others. All in one kit, comes with a roll of 10M light strip, 44-key remote and IR receiver, adapter and some accessories.     ✨【CUSTOM DIY COLORS】- Save Up to 6 DIY CUSTOMIZE Modes of your own! 20 multi-colors and several dynamic modes, brightness and speed adjustment just for your selection with simply a fingertag on the remote.     ✨【STRONG SELF ADHESIVE】- Super Strong Self-adhesive Backing will keep your strip forever only if you use included cleaning pad to clean the surfaces where you plan to adhere the strip first. No worries of the strips falling down again!     ✨【UL-LISTED POWER SUPPLY】- This 12V DC Premium Adapter / Transformers with overload protection, overvoltage and short-circuit protection is UL-Listed certification which makes it safer and more durable for you.     ✨【12-MONTH WARRANTY】- Hitlights High Quality LED Strip Lights are Backed by a 12-month for a peace of mind. Contact our US-based customer service team at any time for no-hassle troubleshooting       \n                    ›  See more product details"},{"asin":"B08Y127DZY","title":"Juno WF6 SWW5 90CRI MW M6 Round Baffle LED Downlight, 120 Volts, 2700K/3000K/3500K/4000K/5000K, Triac Dimming, 6-Inch, Matte White","price":"$19.85","saving":"-24%","rating":"4.6","reviews":"452 ratings","image":"https://m.media-amazon.com/images/W/MEDIAX_792452-T1/images/I/41a75u4H3cL.__AC_SY300_SX300_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"The 6-inch Juno Wafer™ LED Downlights with Switchable White provides high-quality light output and efficiency and features a switch for easy color temperature adjustment, while eliminating the need for recessed housings. The innovative Switchable White feature incorporates a switch on each fixture for simple color temperature adjustment. Too warm or too cool? Simply toggle the integrated switch to your desired setting (3000K factory default) and you are done! Whatever your application, luminaires with Switchable White are sure to give you the feel and flexibility that you need."},{"asin":"B0973VWHBD","title":"Kasa Smart Bulbs, 850 Lumens, Full Color Changing Dimmable WiFi LED Light Bulb Compatible with Alexa and Google Home, A19, 9.5W,2.4Ghz only, No Hub Required, 4-Pack(KL130P4)","price":"$36.99","saving":"-18%","rating":"4.5","reviews":"4,945 ratings","image":"https://m.media-amazon.com/images/W/MEDIAX_792452-T1/images/I/51wsoxOYSeL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Smart Wi-Fi LED bulb with color changing Hue protocols supported: IEEE 802.11b/g/n System requirement: Android 4.1 or higher iOS 9.0 or higher Wireless type: 2.4GHz 1T1R A19, 8.8 W, 850 Lumens, 2500-9000K, CRI≥90, 2 year warranty."},{"asin":"B09BG9B2JQ","title":"Kasa Smart LED Light Strip, 16.4ft WiFi LED Strip Works with Alexa, Google Home, SmartThings, High Brightness with 16 Million Colors, RGB, Grouping, Adjustable Length, Up to 25,000 Hours (KL400L5)","price":"$19.99","saving":"-20%","rating":"4.4","reviews":"3,789 ratings","image":"https://m.media-amazon.com/images/I/61ul+J5L+FL._AC_SX300_SY300_.jpg","availability":"In Stock","tag":"","description":"Paint your home in endless colors with Kasa Smart multicolor light strip. Transform your home into the ultimate entertainment destination with LED strip light features 16 million colors with high brightness & saturation to suit every mood and scene, and take control of your light strip with just your voice or Kasa App. Important Information: This device complies with part 15 of the FCC Rules. Operation is subject to the following two conditions: (1) This device may not cause harmful interference, and (2) This device must accept any interference received, including interference that may cause undesired operation."},{"asin":"B09QBD5J7S","title":"Kasa Smart LED Light Strip, 50 Color Zones RGBIC, 16.4ft Wi-Fi LED Strip Works w/ Alexa, Google Home & SmartThings, High Brightness, 16M Colors, PU Coating, Trimmable, 2 Yr Warranty (KL420L5)","price":"$29.99","saving":"-25%","rating":"4.5","reviews":"3,422 ratings","image":"https://m.media-amazon.com/images/W/MEDIAX_792452-T2/images/I/71N1ACuZ00L.__AC_SY445_SX342_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Transform the ambiance of your bedroom, gaming area, work station, and more with the Kasa Smart WiFi RGBIC LED Light strip. Cut the 16.4 ft. smart light strip to perfectly match your bed frame or cabinets, and choose from unlimited lighting effects with 16 million fully dimmable color choices and advanced animations that can match any mood from a party to unwinding before bed. With its 50 adjustable color zones, the customization on your preferred lighting is endless. The durable PU Coating along the length of the LED strip protects it from moisture so you can install your light strip with peace of mind. 2 year warranty. (Light strip has IP44 rating. Connection points and power adapter do not have protective coating.)."},{"asin":"B08YP6T6GK","title":"Kasa Smart Light Bulbs that works with Alexa and Google Home, Dimmable Smart LED Bulb, A19, 9W, 800Lumens, Soft White(2700K), CRI≥90, WiFi 2.4Ghz only, No Hub Required, 4-Pack(KL110P4)","price":"$29.99","saving":"-33%","rating":"4.5","reviews":"14,459 ratings","image":"https://m.media-amazon.com/images/I/61cXAPt6PwL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"With a dimming range from 1% up to 100%, the Kasa Smart Light Bulb, Dimmable helps you set the right brightness for any mood or activity such as kitchen light, reading light, living room light or bedroom lamp. The Kasa app contains not only all the feature you expect from TP-Link Kasa family, but also guidance for you through each step of the installation to connect your smart bulb with your home Wi-Fi, Alexa or Google assistant.Con un rango de atenuación de 1% hasta 100%, la bombilla inteligente Kasa, regulable te ayuda a establecer el brillo adecuado para cualquier estado de ánimo o actividad como luz de cocina, luz de lectura, luz de salón o lámpara de dormitorio. La aplicación Kasa contiene no solo toda la característica que espera de la familia TP-Link Kasa, sino también orientación para usted a través de cada paso de la instalación para conectar su bombilla inteligente con su hogar Wi-Fi, Alexa o asistente de Google."},{"asin":"B08TB6VXFL","title":"Kasa Smart Light Bulbs, Full Color Changing Dimmable Smart WiFi Bulbs Compatible with Alexa and Google Home, A19, 60 W 800 Lumens,2.4Ghz only, No Hub Required, 2-Pack (KL125P2), Multicolor","price":"$24.99","saving":"","rating":"4.5","reviews":"13,745 ratings","image":"https://m.media-amazon.com/images/I/51CZ4AyIiKL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Dimmable 16 million colors and warm to cool whites(2500K-6500K), E26 A19 base. Explore endless lighting possibilities to create your favorite light effects for every scene you need. The Kasa app contains not only all the feature you expect from TP-Link Kasa family, but also guidance for you through each step of the installation to connect your smart bulb with your home Wi-Fi, Alexa or Google assistant."},{"asin":"B08TB8Z5HF","title":"Kasa Smart Light Bulbs, Full Color Changing Dimmable WiFi Bulbs Compatible with Alexa and Google Home, A19, 9W 800 Lumens,2.4Ghz only, No Hub Required, 4 Count (Pack of 1), Multicolor (KL125P4)","price":"$39.99","saving":"","rating":"4.5","reviews":"7,567 ratings","image":"https://m.media-amazon.com/images/I/61Y-TtwpVIL.__AC_SY445_SX342_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"Dimmable 16 million colors and warm to cool whites(2500K-6500K), E26 A19 base. Explore endless lighting possibilities to create your favorite light effects for every scene you need. The Kasa app contains not only all the feature you expect from TP-Link Kasa family, but also guidance for you through each step of the installation to connect your smart bulb with your home Wi-Fi, Alexa or Google assistant."},{"asin":"B08FW7ZNC2","title":"LIFX Color, 1100 lumens BR30 E26, 2.4GHz Wi-Fi Smart LED Light Bulb, Billions of Colors and Whites, No Bridge Required, Works with Alexa, Hey Google, HomeKit and Siri, Multicolor (2-Pack)","price":"$59.98","saving":"","rating":"4.4","reviews":"586 ratings","image":"https://m.media-amazon.com/images/I/71t1AXzftTL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Meet LIFX Color BR30. The LIFX Color BR30 is a modern, powerful bulb for every space, inside and out. With billions of colours plus massive cool to warm white range, the BR30 can reach up to 1100 lumens. Add endless smart integrations for better gaming, working, and more."},{"asin":"B07M68DL8F","title":"Lithonia Lighting WF4 27K30K35K 90CRI MW M6 LED color Temperature Selectable Ultra Thin Recessed Downlight, 2700K | 3000K | 3500K, White","price":"$27.08","saving":"","rating":"4.7","reviews":"2,226 ratings","image":"https://m.media-amazon.com/images/W/MEDIAX_792452-T2/images/I/51Vf4umXRuL.__AC_SY300_SX300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"The 4-inch round Wafer™ LED Downlight with Switchable White provides high-quality light output and efficiency featuring a switch for easy color temperature adjustment from soft white to neutral white during installation - while eliminating the need for recessed housings. The innovative, slim design allows for easy retrofit, remodel or new construction installation from below the ceiling. The Wafer LED downlight is wet location listed – making it ideal for use in a breadth of outdoor residential, hospitality, commercial and multifamily applications."},{"asin":"B0BFHP9V2R","title":"Lumary 100FT Smart Outdoor String Lights with APP/Remote/Voice Control, RGBAI Color Changing Patio Lights with Warm White 30+2 LED Bulbs, IP65 Waterproof Permanent Outdoor Lights Work with Alexa","price":"$89.99","saving":"","rating":"4.3","reviews":"473 ratings","image":"https://m.media-amazon.com/images/I/71nVPnY9J7L.__AC_SY445_SX342_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"About this item                   【Voice/APP/Remote/Control Box Control】①Lumary patio string light work with Alexa/Google Assistant/Siri. A simple command can turn your smart outdoor string lights on/off or change the color. ②Download the Lumary APP to connect and enjoy smart control. NOTE: Only applicable to 2.4G Wi-Fi. ③Upgrade version comes with remote control. ④Control Box control     【RGBAIWW Technology】Lumary smart string light comes with RGBAI technology, which makes multiple colors show on the string light at same time, flowing like a rainbow. 16 million colors can be selected. It can also be set to warm white mode to match any occasion.     【Single & Group Control】Each bulb can be controlled individually (on/off， color program, 1-100% brightness adjustable). Also, you can create a group to manage your smart outdoor lights for patio in 1 key.     【Parallel Technology】Lumary led string lights design of the parallel connection, if 1 of the bulbs is broken, the others bulbs still work well. so it is superior to other string lights in series.     【Heavy Duty Smart Colored Lights】Lumary string light for outside made of the stronger（3-core）22AWG cable, which is patio lights outdoor waterproof, no afraid of the wind, rain, and snow day. The sturdy PC plastic bulb is shatterproof to survive knocks and falls.     【Preset & DIY Scene Modes】Lumary smart patio string lights come with 8+ scene modes via Lumary APP, you can customize and modify the color and brightness in the preset scene, and you can also add more scenes.     【Timer & Schedule】You can easily preset the outdoor led lights on/off in the APP, whether you want it to wake you up in the morning or light up at nightfall.       \n                           【Music Sync】The color-changing string lighting can also change color to match the beat of the music or the sound of a game to enhance your entertainment experience.  【Replaceable Bulbs】56Ft Lumary String lights comes with 15pcs 1W dimmable LED bulbs. The lights are installed quickly (1* bulb spare). 100-240V AC with UL plug. 7.8fFT length from the adapter to the first light.  【Holidays Lights】Explore more lighting possibilities such as year-round Christmas lights, Halloween lights, wedding decorative lights, party lights, balcony lights, backyard lights, etc. Create ambiance scenes in your outdoor space with Lumary string lights.      Show more"},{"asin":"B086HLBHJB","title":"Lumary LED Recessed Lighting Slim 6 Inch Smart LED Recessed Lights 13W 1000lm Wi-Fi LED Retrofit Downlight with Junction Box Work with Alexa/Google Assistant(6 Inch-1PCS)","price":"$35.00","saving":"","rating":"4.1","reviews":"1,506 ratings","image":"https://m.media-amazon.com/images/I/61skc3aHbaL.__AC_SY445_SX342_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"About this item                   【Voice Control】 Compatible with Alexa and Google Assistant. A simple dialogue can turn your LED Recessed Lighting on or off and adjust more colors. Release your hands.     【2700-6500k Adjustable and Brightness】Smart recessed lighting 6 inch supports 1%-100% brightness adjustment and provides warm white and cool white from 2700K to 6500K to meet your different lighting needs. (Note: Not compatible with any dimmer switch that will affect the service life.)     【RGB & 16 Million Colors】Lumary smart wifi recessed lights offer 16 million colors and 8 scene modes to create the perfect lighting atmosphere. You can DIY lighting scenes to create your own LED recessed lighting scenes or choose from various preset lighting scenes to complement your mood or activities throughout the day.     【Music & Mic Snyc】 ①The smart recessed lighting can change color with the beat of the music or the sound of the game. ②This function is only applicable to APP, with no built-in microphone or speaker.     【High Quality & Easy Installation】 13W (1100LM), ultra-thin body, no flicker, silent, instant start. With a junction box, easy to install. Connect the Jbox to the cable; Use a spring clip to fix it on the ceiling.     【Lumary APP Control】Download Lumary App, You just lay on the sofa and you can easily control all of the Lumary smart recessed lighting functions through the app, enjoying the convenience and fun of smart lighting. Note: only support 2.4 GHz Wi-Fi.     【Group control】You may control the recessed lights in several rooms at the same time, such as the living room, kitchen, bedroom, soffit, etc. Save you more time!       \n                           【Schedule & Remote Control】You can set this mode to turn on or off the canless Wafer Downlight according to your wake-up and sleep time. When you turn on this mode, you don't have to turn the lights on and off manually. You control your lamps remotely anytime, anywhere through the app.  【Share the device & Memory Function】You can share the device with your family, and family members can all control the smart led recessed lighting together and enjoy the smart fun. With memory, the function will stay at the last setting you choose while turned on again, no need to reset it.  【After-sales service】Lumary has a professional after-sales team, if you encounter any problems in the follow-up use, please feel free to contact us will provide you with technical support in a timely manner.      Show more"},{"asin":"B017LRCHU0","title":"Lutron Caseta Smart Lighting Switch for All Bulb Types or Fans | Neutral Wire Required | PD-6ANS-IV | Ivory","price":"$59.95","saving":"","rating":"4.8","reviews":"2,723 ratings","image":"https://m.media-amazon.com/images/W/MEDIAX_792452-T1/images/I/71P4UAyW0cL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"Experience the ultimate convenience in lighting control with Lutron's family of Caseta dimmers, switches, and smart phone control. The Caseta by Lutron In-Wall Switch provides switching of multiple load types and, when paired with Pico remote controls, allows remote control from anywhere in the space. Use the Pico remote control either in your hand, on a tabletop pedestal or by mounting the remote directly to the wall (remote control and accessories sold separately). You can even use the Pico remote to control the lights from your car as you arrive home. This switch works with up to 720-Watt of incandescent, halogen, ELV and MLV, 6 Amp of dimmable LED/CFL and 3.6 Amp of general purpose fans. Neutral wire required. Coordinating wall plate sold separately."},{"asin":"B0C1JD5YXW","title":"Nanoleaf Essentials Smart LED Color-Changing Light Bulb (60W) - RGB & Warm to Cool Whites, App & Voice Control (Works with Apple Home, Google Home, Samsung SmartThings) (Matter A19 (3 Pack))","price":"$39.99","saving":"-20%","rating":"4.1","reviews":"1,358 ratings","image":"https://m.media-amazon.com/images/I/71AUqh9Zl8L.__AC_SY445_SX342_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"About this item                   [Use with a Matter Hub & Thread Border Router] A Matter compatible hub, thread border router, and iOS/tvOS 16.5+ or Android OS 8.1+ is required to connect this bulb to a smart home ecosystem. See requirements below. For control with just the Nanoleaf App, only Bluetooth is required.     [16M+ RGBW Colors] Virtually limitless color options. Enjoy the brightest white lighting with extended temperature range from the coolest to warmest whites or fully immerse yourself in a world of colors.     [Simple Setup] Scan the Matter QR code to pair your bulb and easily add it to your home.     [Color-Changing Animations] Customize with colors and motions like Fade, Highlight, and Random. Transition colors slowly for an ambience that sets the perfect mood, or turn up the speed to get the party started.     [Set Schedules] Automate your lights to turn on/off at specific times and days to make your daily routines a little easier. Set your schedule using the Apple Home app, Google Home app or any other Matter-compatible app or voice assistant.     [Maximize Comfort and Productivity] With Circadian Lighting, set your lights to automatically adjust to your timezone. This feature naturally prepares you for restful sleep by removing blue light as day turns into night.     [App & Voice Control] Go deep into customizing your lights with the Nanoleaf App (colors, lighting animations, schedules and more) or connect it with a smart home assistant for hands-free control.       \n                    ›  See more product details"},{"asin":"B08P2D215V","title":"Philips Hue 65&quot; Smart TV Light Strip - White and Color Ambiance LED Color-Changing TV BackLight - Sync with TV, Music, and Gaming - Requires Bridge and Sync Box - Control with App or Voice Assistant","price":"$262.49","saving":"-14%","rating":"4.5","reviews":"1,437 ratings","image":"https://m.media-amazon.com/images/I/71fJ3cJekrL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock  Only 1 left in stock - order soon.","tag":"","description":"The product voltage arrange is 120V"},{"asin":"B091D5FMXR","title":"Philips Hue 7W ST19 White Ambiance LED Smart Vintage Edison Filament Bulb, Warm - Pack of 1 - E26 - Control with App - Compatible with Alexa, Google Assistant and Apple HomeKit","price":"$44.99","saving":"","rating":"4.7","reviews":"583 ratings","image":"https://m.media-amazon.com/images/I/61k6CHWmDJL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"Only 2 left in stock (more on the way).","tag":"","description":"Vintage style meets modern control with Philips Hue White ST19 smart bulb, whose redesigned filament features an all-around glow. This Edison-style LED bulb offers dimmable, tunable soft white light, an E26 base, and all the benefits of a smart bulb. The smart bulb can be used with Bluetooth or paired with a Philips Hue Bridge (sold separately) for ultimate smart lighting control."},{"asin":"B07NDGD11D","title":"Philips Hue Discover Outdoor Smart Flood Light Fixture, Black - 15W, White and Color Ambiance LED Color-Changing Light - 1 Pack - Requires Hue Bridge - Control with Hue App and Voice - Weatherproof","price":"$137.99","saving":"-23%","rating":"4.5","reviews":"728 ratings","image":"https://m.media-amazon.com/images/W/MEDIAX_792452-T2/images/I/711QltpzD0L.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Bring the Philips Hue experience outdoors with the Discover Smart LED Floodlight. Designed to connect to your existing Hue Bridge (required, sold separately), this weatherproof floodlight offers millions of colors and shades of warm-to-cool white light to create any ambiance you desire. The Discover floodlight connects to the mains and is weatherproof for long lasting use in any season all year long. Constructed with high-quality aluminum and superior synthetics, the Discover Floodlight is built to last in any season and comes with a UL Wet Location rating for use in wet locations. Illuminate a large portion of your outdoor space with the powerful LED light source and easily find your way to your driveway, front or back door with the right amount of light. Never lose track of what is happening around your house with this powerful Philips Hue light. Connect the Discover outdoor floodlight to a Hue Bridge (sold separately) to unlock the full power of Philips Hue, including the ability to control up to 50 lights and accessories, automations, Matter compatibility and smart control from anywhere in the world. Looking for a smart light that works with Alexa and Google Assistant? Set up voice control with the Hue app and use simple voice commands to control your Hue lights. Enhance your outdoor ambiance and feel more secure with smart LED light from Hue. Whether you need lighting for your pathways, entries, patios, or landscaping, Hue offers a range of options that complement your outdoor decor and provide the convenience of smart control."},{"asin":"B07NDF3VPH","title":"Philips Hue Econic Square Outdoor Smart Wall Light, Black - White and Color Ambiance LED Color-Changing Light - 1 Pack - Requires Hue Bridge - Control with Hue App and Voice - Weatherproof","price":"$169.99","saving":"","rating":"4.8","reviews":"1,273 ratings","image":"https://m.media-amazon.com/images/W/MEDIAX_792452-T1/images/I/71fZECTf6BL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"The Philips Hue Econic family offers 16 million colors to enhance the beauty of your porch or yard, and to create any ambiance you like to optimize your smart home. 50,000 shades of white are also available to brighten your outdoor space for evening activities or to enhance security. Easily connect to your existing Philips Hue Hub to get all the smart features including away from home control, geofencing, scheduling, or linking to the Philips hue Outdoor Motion Sensor. The Econic family is fully weather-proof and must be hard-wired. Hue hub not included."},{"asin":"B09BDLCTZC","title":"Philips Hue Indoor 3-Foot Smart LED Light Strip Extension - Flowing Multicolor Effect - Requires Base Kit - 1 Pack - Control with Hue App - Works with Alexa, Google Assistant and Apple HomeKit","price":"$69.98","saving":"","rating":"4.4","reviews":"6,474 ratings","image":"https://m.media-amazon.com/images/I/618l3SOi1NL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Use this Hue gradient ambiance light strip extension with your Hue gradient ambiance base kit (sold separately) to extend your light strip. Use multiple extensions to extend up to 33 feet. With this color changing light strip you can enjoy a seamless blend of multiple colors of light at the same time in a single LED strip. The colors flow naturally together while casting a diffused rainbow of light to enhance your ambiance and room decor. The light strip has a premium silicone sleeve with a milky white finish and blends in neatly wherever the light strip is placed. The sleeve diffuses the light so that all you see is the beautiful ambiance of light with no harsh reflections. Place your light strips under or above kitchen cabinets, furniture, along a hallway or stairs, or anywhere your imagination takes you. When looking for LED lights for bedrooms, light strips can be placed under a bed to provide the right light for going to sleep or easing into the morning. The flexible design can bend to fit and can be cut or extended. When connected to a base kit you can control up to 10 lights in a room with Bluetooth to instantly set the mood. Add or connect to a Hue Bridge to unlock the full power of Philips Hue smart home lighting, including the ability to control up to 50 lights and accessories, automations, and smart control from anywhere in the world. Pair your light strip with any compatible Amazon Echo or Google Home device for hands-free help in any room, or use Apple HomeKit when paired with a Hue Bridge (sold separately)."},{"asin":"B07DBLWB3V","title":"Philips Hue Lily Outdoor Smart Spot Light - White and Color Ambiance LED Walkway Lights - Low Voltage Lighting - 1 Pack - Requires Bridge and Power Supply - Control with App and Voice - Weatherproof","price":"$99.97","saving":"","rating":"4.6","reviews":"709 ratings","image":"https://m.media-amazon.com/images/I/71Dxm8kV1XL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Product Description          Philips Hue Lily White & Color Outdoor Smart Spot Light Extension (Hue Hub & Power Source Required), 1 Hue White & Color Smart Spot Light + Mount kit, Works with Alexa, HomeKit & Google Assistant.             Set Contains:          Set Contains: Hue White & Color Ambiance Spot light x 1, Spike x 1, Mounting bracket x 1, Cable extension x 1"},{"asin":"B08VDPG111","title":"Philips Hue Lily Outdoor Smart Spot Light Base Kit - White and Color Ambiance LED Walkway Lights - Low Voltage Landscape Lighting - 3 Pack - Requires Bridge - Control with App and Voice - Weatherproof","price":"$339.99","saving":"","rating":"4.6","reviews":"756 ratings","image":"https://m.media-amazon.com/images/I/71gJBh5vM7L.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Plug in and light up your outdoors with Philips Hue outdoor lighting. Requires Hue hub to use, sold separately. Simply plug in and connect to your existing Hue hub to enjoy the 16 million colors available to enhance the beauty of your yard or create any ambiance you like. This dusk to dawn light bulbs base kit provides 3 light points and Power supply plus all cables you need to get started. Lily landscape spots are fully weather-proof."},{"asin":"B095KV6RFY","title":"Philips Hue Smart 100W A21 LED Bulb - White and Color Ambiance Color-Changing Light - 1 Pack - 1600LM - E26 - Indoor - Control with Hue App - Works with Alexa, Google Assistant and Apple Homekit","price":"$64.98","saving":"","rating":"4.6","reviews":"3,552 ratings","image":"https://m.media-amazon.com/images/W/MEDIAX_792452-T1/images/I/61ibAm31w-L.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Go bright by giving your largest spaces this bright, colorful smart light. With a brightness equivalent to a traditional 100 W bulb, this bulb can tastefully illuminate living rooms, kitchens, and more with color. Dimmable features allow you to control the level of brightness. Own our Hue Hub? You can set timers to dim your smart bulbs as the day goes by."},{"asin":"B07WSK5TWJ","title":"Philips Hue Smart 40W B39 Candle-Shaped LED Bulb - Soft Warm White Light - 2 Pack - 450LM - E12 - Indoor - Control with Hue App - Works with Alexa, Google Assistant and Apple Homekit","price":"$32.99","saving":"-6%","rating":"4.7","reviews":"3,442 ratings","image":"https://m.media-amazon.com/images/I/6142XzBTq3L.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"These Philips Hue White E12 smart LED decorative candle bulbs offer soft white light to transform your home decor and the way you feel. Perfect for use in decorative lighting fixtures like chandeliers and wall sconces with a narrow E12 or candelabra socket. With smart control, you can dim, brighten, and set the mood with your voice, the Hue app, or Hue switches and controls (sold separately). These smart LED candles feature Bluetooth capability for instant light control in one room, making it easy to get started with smart lighting immediately. Bluetooth makes it easy to get started with Philips Hue. Simply screw in the candle bulb, download the Hue app, and start enjoying the convenience of smart lighting today. Want to get more from your Hue system? Connect the Hue White smart candle bulb to a Hue Bridge (sold separately) to unlock the full power of Philips Hue, including the ability to control up to 50 lights and accessories, automations, Matter compatibility and smart control from anywhere in the world. Looking for a smart light that works with Alexa and Google Assistant? Set up voice control with the Hue app and use simple voice commands to control your Hue lights. Whether you need smart LED accent lights for bedrooms, your dining room, or hallway, Hue complements your home decor while offering the convenience of smart control."},{"asin":"B08BNNHLNS","title":"Philips Hue Smart 40W B39 Candle-Shaped LED Bulb - White and Color Ambiance Color-Changing Light - 1 Pack - 450LM - E12 - Control with Hue App - Works with Alexa, Google Assistant and Apple Homekit","price":"$54.97","saving":"","rating":"4.7","reviews":"3,462 ratings","image":"https://m.media-amazon.com/images/I/71Dvt0ggbJL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"Only 18 left in stock - order soon.","tag":"","description":"This Philips Hue White and color ambiance E12 1-pack smart LED decorative candle bulb offers millions of shades of warm-to-cool white and color changing light to transform your home decor and the way you feel. Perfect for use in decorative lighting fixtures like chandeliers and wall sconces with a narrow E12 or candelabra socket. This 9W smart RGB light features Bluetooth capability for instant light control in one room and offers up to 450 lumens of brightness. Bluetooth makes it easy to get started with Philips Hue. Simply screw in the bulb, download the Hue app and start enjoying the convenience of smart lighting immediately. This decorative accent light can dim, brighten and set the mood right out of the box. With Bluetooth you can control up to 10 lights in a single room. It's easy to have the right light for routines throughout the day with Hue light scenes. Or create the ultimate mood lighting with dynamic light effects that show subtle changes in color or brightness that you can customize in the app. Looking for smart bulbs that work with Alexa and Google Assistant? It's easy to set up voice control with the Hue app and use simple voice commands to control your lights. Whether you need smart LED accent lights for bedrooms, your dining room, or hallway, Hue complements your room decor while offering the convenience of smart control. Already have a Bridge or ready to get more from your Hue system? Connect this E12 smart candle to a Hue Bridge (sold separately) to unlock the full power of Philips Hue, including the ability to control up to 50 lights and accessories, automations, and smart control from anywhere in the world."},{"asin":"B07WVNBWJH","title":"Philips Hue Smart 50W GU10 LED Bulb - White and Color Ambiance Color-Changing Light - 1 Pack - 400LM - Indoor - Control with Hue App - Works with Alexa, Google Assistant and Apple Homekit","price":"$39.99","saving":"-27%","rating":"4.7","reviews":"854 ratings","image":"https://m.media-amazon.com/images/I/617PuqdQW8L.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"Only 16 left in stock (more on the way).","tag":"","description":"Experience ultimate smart lighting control and bring vintage style to your smart home with this fully dimmable smart light bulb featuring a coiled filament design. The smart bulb can be used with Bluetooth or paired with a Philips Hue Hub (sold separately) for ultimate smart lighting control."},{"asin":"B07QWB3J8W","title":"Philips Hue Smart 60W A19 LED Bulb - Soft Warm White Light - 4 Pack - 800LM - E26 - Indoor - Control with Hue App - Works with Alexa, Google Assistant and Apple Homekit","price":"$49.98","saving":"","rating":"4.7","reviews":"7,793 ratings","image":"https://m.media-amazon.com/images/I/61TphR55n9L.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"New to smart lighting? Get started with easy smart lighting with this Hue smart bulbs Just using Bluetooth, without the Hue Hub, you can control up to 10 lights in 1 room. Comfy on the couch? No need to get up to change your lights. Control your lights using the (free) Hue Bluetooth app or with just your voice with Alexa or Google Assistant. Works with all Echo smart speakers/displays and Google Nest devices, (Hue Hub required for Echo (1st Gen) and Echo Dot (1st Gen)). Certified for Humans: struggle-free, tinker-free, stress-free. No patience needed-they’re actually simple. Want to upgrade your whole home with smart lighting? Add a Hue Hub to control up to 50 light points, get access the full Hue capabilities (Home and away control, timers/routines, more smart home partners) and extended product portfolio (indoor/outdoor smart lighting and accessories). Already a Philips Hue customer? This bulbs is also compatible with the Hue Hub. Philips Hue, the creator of Smart Lighting, brings you the most comprehensive, up-to-date and secure smart lighting ecosystem."},{"asin":"B095KSHGYW","title":"Philips Hue Smart 75W A19 LED Bulb - White and Color Ambiance Color-Changing Light - 1 Pack - 1100LM - E26 - Indoor - Control with Hue App - Works with Alexa, Google Assistant and Apple Homekit","price":"$54.98","saving":"","rating":"4.7","reviews":"1,209 ratings","image":"https://m.media-amazon.com/images/I/71jAmbyN1UL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Go bright by giving your largest spaces this bright, colorful smart light. With a brightness equivalent to a traditional 75-Watt bulb, this bulb can tastefully illuminate living rooms, kitchens, and more with color. Dimmable features allow you to control the level of brightness. Own our Hue Hub? You can set timers to dim your smart bulbs as the day goes by."},{"asin":"B095KSZQGD","title":"Philips Hue Smart 75W A19 LED Bulb - White and Color Ambiance Color-Changing Light - 2 Pack - 1100LM - E26 - Indoor - Control with Hue App - Works with Alexa, Google Assistant and Apple Homekit","price":"$99.99","saving":"","rating":"4.6","reviews":"11,023 ratings","image":"https://m.media-amazon.com/images/W/MEDIAX_792452-T1/images/I/61tBWcMl1EL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Go bright by giving your largest spaces this bright, colorful smart light. With a brightness equivalent to a traditional 75-Watt bulb, this bulb can tastefully illuminate living rooms, kitchens, and more with color. Dimmable features allow you to control the level of brightness. Own our Hue Hub? You can set timers to dim your smart bulbs as the day goes by."},{"asin":"B096YFWVVS","title":"Philips Hue Smart Light Starter Kit - Includes (1) Bridge and (2) 60W A19 LED Bulb, White and Color Ambiance Color-Changing Light, 800LM, E26 - Control with App or Voice Assistant","price":"$129.99","saving":"","rating":"4.6","reviews":"547 ratings","image":"https://m.media-amazon.com/images/W/MEDIAX_792452-T1/images/I/71Xwa1ySl6L.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"This Philips Hue White and color ambiance E26 2-Pack starter kit with Bridge has everything you need. Getting started is simple. Simply screw in the bulbs, download the Hue app, connect your Bridge and start enjoying the convenience of smart lighting immediately. The Bridge is the heart of the Hue smart lighting system and unlocks the full power of Philips Hue, including the ability to control up to 50 lights and accessories, control multiple rooms and zones, set custom automations, and have smart control from anywhere in the world. The Bridge has a stable and secure connection that remembers your settings, even if the power goes out, and won't put a strain on your Wi-Fi. It's a premium experience that only Philips Hue can offer. It's easy to transform your home decor and the way you feel with millions of shades of warm-to-cool white and color changing light. They can dim, brighten, and set the mood for any moment from birthday celebrations to morning meditation. It's easy to have the right light for routines throughout the day with Hue light scenes. Or create the ultimate mood lighting with dynamic light effects that show subtle changes in color or brightness that you can customize in the app. Looking for smart bulbs that work with Alexa and Google Assistant? It's easy to set up voice control with the Hue app and use simple voice commands to control your lights. Whether you need smart LED lights for bedrooms, your living room, or even kids rooms, Hue complements your room decor while offering the convenience of smart control."},{"asin":"B07XC2CXKK","title":"Philips Hue Smart Light Starter Kit Old Version - Includes (1) Bridge, (1) Smart Button and (3) Smart 60W A19 LED Bulb, Soft Warm White Light, 1100LM, E26 - Control with Hue App or Voice Assistant","price":"$99.99","saving":"","rating":"4.6","reviews":"998 ratings","image":"https://m.media-amazon.com/images/I/61nfgAQNFjL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Take smart light with you indoors and outside: With the Philips Hue Go portable table lamp, you can take smart light with you. Rated for outdoor use and featuring a handy silicone grip, it's easy to carry where you need light most: inside to read or outside to illuminate a dinner party. Its 48-hour battery life means its light will last, too -- and recharging is easy with the included charging base. Use the button on top of the lamp to cycle through preset light scenes or the Hue app to play with millions of colors of white and color light."},{"asin":"B07GX9YG1H","title":"Philips Hue Smart Play Light Bar Base Kit, Black - White & Color Ambiance LED Color-Changing Light - 1 Pack - Requires Bridge - Control with App - Works with Alexa, Google Assistant and Apple HomeKit","price":"$89.99","saving":"","rating":"4.7","reviews":"11,218 ratings","image":"https://m.media-amazon.com/images/W/MEDIAX_792452-T2/images/I/71ceMUf31yL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"Connect it to Hue Hub (sold seperately) in order to control lights with your Hue App, Voice or Smart Home device. Compact design, full light experience. Create a vibrant ambiance with the Hue Play light bars. Choose from 16 million colors to experience different light effects. Lay it on the floor, let it stand on the cabinet, or mount it on the back of the TV and paint your wall with light. Sync your lights to music or movies using the Hue Sync app. This base kit provides 1 black Play light bars with 80-inch cable 1 table stand with screw 1 mounting clip with double-sided tape (suitable for TV) 1 power supply unit (suitable to connect up to 3 Play light bars) 1 Allen wrench. Requires the Hue Hub (sold Separately) for the full Hue experience and to take advantage of voice activation. Purchase the Philips Hue Hub (Model: 458471). Search \"Philips Hue Hub\" or \"B016H0QZ7I\" to find this product on Amazon."},{"asin":"B0BCXGLT1H","title":"Philips Hue Smart Slim 6 Inch LED Downlight - White and Color Ambiance Color-Changing Light - 1 Pack - 1200LM - Indoor - Control with Hue App - Works with Alexa, Google Assistant and Apple Homekit","price":"$59.99","saving":"-14%","rating":"4.6","reviews":"1,732 ratings","image":"https://m.media-amazon.com/images/I/71P7y669VZL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"The new Philips Hue slim downlight makes it possible to add downlights to any room in your home — especially where traditional can lights just can't fit."},{"asin":"B0BBXRQ3FH","title":"Philips Hue White Ambiance BR30 LED Smart Bulbs (Bluetooth Compatible), Compatible with Alexa, Google Assistant, and Apple HomeKit, 2-Pack","price":"$33.99","saving":"-32%","rating":"4.7","reviews":"594 ratings","image":"https://m.media-amazon.com/images/W/MEDIAX_792452-T1/images/I/71Gdg6HKSNL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"Only 3 left in stock - order soon.","tag":"Amazon's  Choice","description":"Philips Hue White Ambiance BR30 2pk LED Smart Bulbs (Bluetooth Compatible), Works with Amazon Alexa, Google Assistant, and Apple HomeKit"},{"asin":"B0956VQ256","title":"Sengled Alexa Light Bulb, BR30, S1 Auto Pairing with Alexa Devices, Smart Flood Light Bulb That Work with Alexa, Warm Light Bulbs, E26, Led Lights, 65W Equivalent Recessed, No Hub Required, 4-Pack,","price":"$40.97","saving":"-9%","rating":"4.1","reviews":"812 ratings","image":"https://m.media-amazon.com/images/W/MEDIAX_792452-T2/images/I/510NB34x-RS.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"Only 8 left in stock (more on the way).","tag":"","description":"From Sengled - Smart Lighting Expert Since 1997.Sengled is committed to bringing automated whole-house smart living to your Alexa devices.R&D is fully focused on smart home lighting -Sengled integrate seamlessly with alexa Smart Home devices to offer beautiful lighting throughout your home.The alexa devices list that support to connect directly with The New - Sengled Auto Paring Technology.Echo Plus / Echo Studio / Echo Show / Echo Dot / Echo Frams.. (all after 2016 support Bluetooth gateway Alexa Devices)"},{"asin":"B08DJBDG5L","title":"Sengled Alexa Light Bulb, S1 Auto Pairing with Alexa Devices, Warm Smart Light Bulbs, Bluetooth Mesh Smart Home Lighting, E26 60W Equivalent, 800LM, 1-Pack","price":"$7.89","saving":"-21%","rating":"4.4","reviews":"105,046 ratings","image":"https://m.media-amazon.com/images/W/MEDIAX_792452-T2/images/I/61h2NO0RajL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"From Sengled - Smart Lighting Expert Since 1997.Sengled is committed to bringing automated whole-house smart living to your Alexa devices.R&D is fully focused on smart home lighting -Sengled integrate seamlessly with alexa Smart Home devices to offer beautiful lighting throughout your home.The alexa devices list that support to connect directly with The New - Sengled Auto Paring Technology.Echo Plus / Echo Studio / Echo Show / Echo Dot / Echo Frams.. (all after 2016 support Bluetooth gateway Alexa Devices)"},{"asin":"B091FV4XMC","title":"Sengled Alexa, WiFi, Smart Light Bulbs that Work with Alexa & Google Assistant,A19 Soft White(2700K)No Hub Required,800LM 60W Equivalent HighCRI)90,4Count(Pack of 1)","price":"$23.99","saving":"","rating":"4.3","reviews":"7,608 ratings","image":"https://m.media-amazon.com/images/I/51H4GUSoqnS.__AC_SY300_SX300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"From Sengled: Smart Lighting Expert. Lighting up the world since 1997Sengled WiFi Classic Smart Light Bulbs are the simplest way to get started with smart lighting.No hub is required — just install the LED bulb like a standard light bulb and connect it to your home's 2.4GHz Wi-Fi network. Control the bulb through the Sengled Home app (iOS and Android) to manage the smart lights, including adjusting the brightness, setting schedules, creating scenes and monitoring energy.You can also control the lights with your voice when paired to your Amazon Alexa devices or Google Assistant smart speakers."},{"asin":"B0B9GKJ6NC","title":"Sengled Ambient TV LED Backlights with Camera, Smart Strip Light for 50-60 inch TVs PC, (TV Sync Supports Off-line) WiFi RGB Lights, Works with Alexa & Google Assistant, App Control, Vision G2","price":"$75.70","saving":"-5%","rating":"4.1","reviews":"1,347 ratings","image":"https://m.media-amazon.com/images/I/811M2Ell1qL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"From Sengled - Smart Lighting Expert Since 1997.R&D is fully focused on smart home lighting -Sengled integrate seamlessly with alexa Smart Home devices and Google Home to offer beautiful lighting throughout your home.Sengled Vision G2Let us take a look at what advantages it has.(1) Sengled strip lighting compared to the previous generation of camera strip and HDMI BOX, our Brightness is almost 15% higher than them(2) Prefer blue when the TV is not displayed or other base colors can make the visual effect more Calm and Comfortable(3) Off-line Mode: Localized Information Security, When Video Sync or Gaming Sync is on, you can turn off your network. (Remote control still requires a 2.4Ghz Wi-Fi connection, The camera is only used to scan the screen for color.)(4) Remote Control:Even if you're not at home, you can control your strip lighting remotely directly from your Sengled Smart Home APP."},{"asin":"B08P21VS1Q","title":"Sengled Color Changing Bulbs That Works with Alexa, Google Home, 3 Pack Starter Kit with Smart Switch, RGB Light A19 E26 Dimmable LED 60W Equivalent, 800LM, 5 Piece Set, White, 3 Count","price":"$65.46","saving":"","rating":"4.2","reviews":"2,597 ratings","image":"https://m.media-amazon.com/images/W/MEDIAX_792452-T2/images/I/61svlfzT2nL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"New to smart lighting Get started with easy smart lighting with this Sengled smart bulb. Just using Smart Light Bulbs, with the Sengeld Hub, you can control up to 10 lights in 1 room. Comfy on the couch? No need to get up to change your lights. Control your lights using the (free) Sengled Home app or with just your voice with Alexa or Google Assistant. Works with all Echo smart speakers/displays and Google Nest devices, (Sengled Hub required for Echo (1st Gen) and Echo Dot (1st Gen). Want to upgrade your whole home with smart lighting Add a Sengled Hub to control up to 64 light points, get access the full Sengled capabilities (Home and away control, timers/routines, more smart home partners) and extended product portfolio (indoor/outdoor smart lighting and accessories). This bulb is also compatible with the Sengled Hub. Sengled is the Expert of Smart Lighting, brings you the most comprehensive, up-to-date and secure smart lighting ecosystem."},{"asin":"B0C9YZ7T2G","title":"Sengled Dusk to Dawn Light Bulbs, A19 10.5W (75W Eqv.) LED Auto On Off Light Bulbs, 1200 Lumens, E26 Base, 3000K Warm White Bulb for Outdoor Lighting, Pack of 6, UL Listed","price":"$24.99","saving":"","rating":"4.7","reviews":"6,035 ratings","image":"https://m.media-amazon.com/images/I/512xjguGojL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"Available to ship in 1-2 days","tag":"","description":"‎✔ Auto On-Off ✔ Dusk to Dawn Light Sensor Bulb ✔ A19 Lamp Shape ✔ 75 Watt Equivalent ✔ 1200 lumen ✔ LED 10.5 Watt ✔ Instant On ✔ Non-Dimmable ✔ Warm White 3000K ✔ No Flicker & Noise-Free ✔ 25000+Hours Lifespan ✔ 3-YEAR Warranty"},{"asin":"B096WXN9VN","title":"Sengled LED Light Bulbs 100W Equivalent, 1500LM Bluetooth Mesh, Smart Bulbs That Work with Alexa Only, A19 5000K Dimmable, High Brightness, No Hub Required, 4 Pack","price":"$39.99","saving":"","rating":"4.3","reviews":"19,580 ratings","image":"https://m.media-amazon.com/images/W/MEDIAX_792452-T1/images/I/61VWkoFOtGL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"From Sengled - Smart Lighting Expert Since 1997, From Sengled - Smart Lighting Expert Since 1997, Sengled smart bulb integrate seamlessly with Alexa smart home devices to offer beautiful lighting throughout your home.Let us take a look at what advantages it has. (1) Remote Control:Even if you're not at home, you can control your smart light bulb remotely directly from your mobile APP.(2 )Dim or brighten color changing light bulb as you like, create a relaxing and comfortable atmosphere.(3) The installation and setup is very simple, it only takes one minute to complete. Campatible with Alaxe assistant only, it is easier to use. Smart flood light bulbs specifications:Lumens: 1500lm dimmable Watts: 12WBase Type: E26Bulb Type: A19Voltage: 120VacColor temperature: DaylightApp: Sengled/Alexa Sengled smart light bulbs are very suitable for people who are just starting to use smart lighting. It is a very good choice. Start your smart lighting lifestyle now."},{"asin":"B0892LXT7J","title":"Sengled Motion Sensor Flood Lights Outdoor Dusk to Dawn Security Light Bulbs, E26 PAR38 Motion Activated 3000K Warm White, 1050LM, Waterproof LED Light Bulbs for Porch, Driveways, 4 Pack 4rd Gen","price":"$54.44","saving":"","rating":"4.5","reviews":"3,595 ratings","image":"https://m.media-amazon.com/images/I/61MHFt0YT6L.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"Only 1 left in stock (more on the way).","tag":"","description":"Main Features 1. 3000K soft white and 1050 lm brightness 2. Built-in Photocell Sensor, which enables the bulb to stay off during the day and automatically light up at night. 3. Built-in PIR Motion Sensor. When in Motion Detection Mode, it will light on automatically and last for 90 seconds when a moving object was detected in dark condition. 4. Features Always On Mode. This mode enables the bulb to stay on just like ordinary light. 5. It has a 15000 hours lifespan, base on 3 hours/day."},{"asin":"B0719RXRBZ","title":"Sengled Smart Bulb, Zigbee Hub Required, Smart Light Bulb Works with Alexa, Google Home, SmartThings, Homekit and Siri, BR30 Dimmable Flood Light Bulb for Cans, Soft White 2700K, 650 LM, 9W, 1 Pack","price":"$12.99","saving":"","rating":"4.2","reviews":"3,080 ratings","image":"https://m.media-amazon.com/images/I/41syPX2QDQL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"Only 13 left in stock - order soon.","tag":"","description":"Do more with your lighting Transform your space with a single tap in the app or a simple voice command Sengled Smart LEDs fit seamlessly into your existing smart home Compatible with Alexa Google Assistant SmartThings and Wink it's simple to add smart lighting in any room Create scenes set schedules dim or brighten and more with the Sengled Home app (iOS/Android)"},{"asin":"B074M3XST3","title":"Sengled Smart Light Bulb Starter Kit, Smart Bulbs that Work with Alexa, Google Home, 2700K Soft White Alexa Light Bulbs, A19 E26 Dimmable Bulbs 800LM, 9 (60W Equivalent), 4 Bulbs with Hub, New","price":"$30.66","saving":"-8%","rating":"4.3","reviews":"2,182 ratings","image":"https://m.media-amazon.com/images/W/MEDIAX_792452-T1/images/I/51zSkApDaTL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Do more with your lighting. Use the Sengled Smart LED Starter kit to transform your space with a single tap in Sengled Home app (iOS/Android) or a simple voice command. Compatible with Alexa and Google Assistant, it's simple to add smart lighting in any room. Create scenes, set schedules, dim or brighten, and more with the app. Lifetime: 25000 hrs, input: 100-130V AC, 60Hz, beam angle: 240º, communication protocol: Zigbee."},{"asin":"B097D1PNNC","title":"Sengled Smart Light Bulbs, LED Candelabra Bulbs E12 Base, Smart Bulbs That Work with Alexa Google, Dimmable, 5W (40W Equivalent) 450LM, No Hub Required, Only 2.4GHz WiFi Support, 2 Pack","price":"$31.61","saving":"-10%","rating":"4.3","reviews":"4,644 ratings","image":"https://m.media-amazon.com/images/W/MEDIAX_792452-T2/images/I/61P77nNPQwL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"Only 1 left in stock (more on the way).","tag":"","description":"From Sengled: Smart Lighting Expert. Lighting up the world since 1997"},{"asin":"B097CYHRZJ","title":"Sengled Smart Light Bulbs, Updated FFS Smart Bulb That Work With Alexa, Google, Smart Recessed Light Bulbs 65W Equivalent, 7.5W, Color Changing Light Bulb, 2.4GHz WiFi Only, No Hub Required, 2 Pack","price":"$31.17","saving":"-11%","rating":"4.2","reviews":"2,237 ratings","image":"https://m.media-amazon.com/images/W/MEDIAX_792452-T1/images/I/51mfaU2RrBL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"From Sengled - Smart Lighting Expert Since 1997,From Sengled - Smart Lighting Expert Since 1997,Sengled Color Changing Light Bulb BR30 integrate seamlessly with Alexa smart home devices to offer beautiful lighting throughout your home.  Let us take a look at what advantages it has. (1) Remote Control:Even if you're not at home, you can control your recessed led flood light bulbs remotely directly from your mobile APP. (2 )Dim or brighten light bulb as you like,create a relaxing and comfortable atmosphere. (3) The installation and setup is very simple, it only takes one minute to complete. Campatible with Alaxe & Google assistant, it is easier to use.   BR30 smart color bulb specifications: Lumens:650lm dimmable  Watts:7.5W Wi-Fi:2.4 GHz, 802.11b/g/n PS: Don't support 5 GHz WiFi. Type: BR30 E26 smart bulb Color Temperature: Multicolored& soft white and daylight App: Alexa & Google assistant Sengled smart bulb WiFi BR30 are very suitable for people who are just starting to use smart lighting. It is a very good choice. Start your smart lighting lifestyle now!  If you have any qestion about this br30 smart light bulb,welcome to contact us."},{"asin":"B08L35SLTY","title":"Sengled Smart Light Bulbs, WiFi Light Bulbs No Hub Required, Smart Bulbs That Work with Alexa, Google Home, Smart LED Light A19 Daylight (5000K), 800LM 60W Equivalent, 2 Pack","price":"$19.22","saving":"","rating":"4.3","reviews":"7,198 ratings","image":"https://m.media-amazon.com/images/W/MEDIAX_792452-T2/images/I/61ig2Tv8bYL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Sengled smart Wi-Fi LED bulbs are the simplest way to get started with smart lighting. No hub is required — just install the LED bulb like a standard light bulb and connect it to your home’s 2.4 GHz Wi-Fi network. Control the bulb through the Singled home app to manage your lights, including adjusting the brightness, setting schedules, creating scenes and monitoring energy. You can also control the light with your voice when paired to your Amazon Alexa device."},{"asin":"B09FPQLMNK","title":"Sengled Smart Recessed Lighting, 5/6 inch, S1 Auto Pairing with Alexa Devices, Led Lights, Smart Can Lights Retrofit Work with Alexa, Smart LED Downlight, ‎Multicolor Dimmable, Conversion Kit,1-Pack","price":"$29.99","saving":"","rating":"4.5","reviews":"63,692 ratings","image":"https://m.media-amazon.com/images/I/61OhjA0V2KL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"Only 9 left in stock (more on the way).","tag":"","description":"From Sengled - Smart Lighting Expert Since 1997.Sengled is committed to bringing automated whole-house smart living to your Alexa devices.R&D is fully focused on smart home lighting -Sengled integrate seamlessly with alexa Smart Home devices to offer beautiful lighting throughout your home.The alexa devices list that support to connect directly with The New - Sengled Auto Paring Technology.Echo Plus / Echo Studio / Echo Show / Echo Dot / Echo Frams.. (all after 2016 support Bluetooth gateway Alexa Devices)"},{"asin":"B07QD2SGDB","title":"Sengled Smart Zigbee Multicolor Light Strip, 2M (6.56ft) Base Kit, Hub Required, Also Works with Alexa & Google Assistant, RGBW, Extendable, High Brightness, 1400Lumens (E1G-G8E)","price":"$39.99","saving":"","rating":"4.3","reviews":"858 ratings","image":"https://m.media-amazon.com/images/I/61mW8AujxnS.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Do more with your lighting. Transform your space with a single tap in the app or a simple voice command. Sengled Smart LEDs fit seamlessly into your existing smart home. Compatible with Alexa and Google Assistant, it's simple to add smart lighting in any room. Create scenes, set schedules, dim or brighten, and more with the Sengled Home app (iOS/Android). With over 16 million colors and tunable whites to pick from, your lights can set the mood for everything from cozy movie nights to party vibes. Brightness: 1500 lumens (100W equivalent), Input: 100-240V AC, wattage: 24W, operating temperature: -4 to 104ºF (-20 to 40ºC), minimum requirements: Compatible Zigbee hub."},{"asin":"B08ML9T8WJ","title":"Smart LED Strip Lights Works with Apple HomeKit, 32.8ft WiFi RGB Strip, Compatible with Siri, Alexa&Google and SmartThings, App Control, Color Changing Light Strip for Bedroom, Upstairs, and Festivals","price":"$38.70","saving":"","rating":"4.2","reviews":"1,595 ratings","image":"https://m.media-amazon.com/images/I/71T7IGJUc+L._AC_SY300_SX300_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"About this item                   Convenient Control: You can manage the led strip lights via voice control and smartphone. Control your light strip with Meross app or Apple Home app .(compatible with iOS 13 or higher, Android 6.0 or later)     DIY Dimming HomeKit Strip: The RGB led strip lights can be DIY cut. Cuttable 32.8ft LED strip lights can be used to decorate your home. Smart strip lights are also a popular choice for holidays like Christmas, Halloween, Parties and New Year etc.     Hey Siri: Smart strip lights can free your hands to control the light. Works with Apple HomeKit/Siri, Amazon Alexa, Google Assistant and SmartThings.     Create Your Ideal Scene: meross strip lights come with 16 million of color options, adjustable and dimming capabilities. Ideal decoration for your bedroom, computer, TV, ceiling, stairs, kitchen cabinet, porch, desk, and living room.     Tips: Create a different atmosphere at festivals or parties with this RGB light, you can set various RGB colors as you like. (Does NOT support color temperature). NOT waterproof and is designed for indoor use.       \n                    ›  See more product details"},{"asin":"B08J83ZC9X","title":"SYLVANIA ECO LED A19 Light Bulb, 60W Equivalent Efficient 9W, 7 Year, 750 Lumens, Medium Base, Frosted, 2700K, Soft White - 24 Count (Pack of 1)(40986)","price":"$24.99","saving":"","rating":"4.7","reviews":"42,999 ratings","image":"https://m.media-amazon.com/images/W/MEDIAX_792452-T1/images/I/71EYuakr6dL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"SYLVANIA provides a complete portfolio of LED products that deliver everyday value without compromising performance. LED Light bulbs are long-lasting way to replace your traditional bulbs while saving both money and energy."},{"asin":"B08FRSS4BF","title":"SYLVANIA ECO LED Light Bulb, A19 60W Equivalent, Efficient 9W, 7 Year, 750 Lumens, 2700K, Non-Dimmable, Frosted, Soft White - 8 Pack (40821)","price":"$12.97","saving":"-7%","rating":"4.7","reviews":"42,999 ratings","image":"https://m.media-amazon.com/images/I/81wKhRO66oL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"#1 Best Seller","description":"Bring modern and best-in-class lighting into your home with the energy-saving SYLVANIA 9W ECO LED A19 soft white bulbs! This 9 watt LED lamp is specifically designed to replace 60-watt incandescent bulbs. At only 9 watts, this SYLVANIA LED lamp can emit a bright 750 lumens, saving you money on your electricity bill. In fact, this bulb’s estimated annual energy cost is just $1.08! With a lifespan of 7 years, this LED lamp emits 750 lumens. What’s more, SYLVANIA LED lights don’t need a warm up, don’t overheat, and don’t emit harmful UV-, IR-, radiation and are mercury-free. You can also safely install them in ceiling light fixtures (not for use with fully enclosed fixtures) or accent lights. If you like modern lighting in your living room or workspace, then this product’s 2700 soft white color is just right for you! See the clear difference SYLVANIA makes; better lighting for better living."},{"asin":"B07H8LZ95Y","title":"SYLVANIA General Lighting 75580 Sylvania Smart+ Bluetooth Enabled Soft White Filament A19 LED Bulb, Works with Apple HomeKit and Siri Voice Control, No Hub Required for Set Up, 4 Pack, 4 Count","price":"$104.05","saving":"","rating":"4.0","reviews":"1,312 ratings","image":"https://m.media-amazon.com/images/W/MEDIAX_792452-T1/images/I/812BdxqvgrL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"Only 1 left in stock - order soon.","tag":"","description":"The SYLVANIA SMART+ Bluetooth Soft White Filament light bulb lets you personalize your living space using the Home app on your iPhone or iPad. The elegant filament design is ideal for pendant fixtures, chandeliers, decorative lamps, and more. You can even control and monitor your SMART+ lights via your iOS device when you're away from home (Home Hub set up required) by easily setting up schedules and automations to make your lights work for you. The HomeKit-enabled SYLVANIA SMART+ light bulb connects directly to Apple HomeKit using Bluetooth on your iPhone or iPad. No additional hardware is needed to start controlling your SMART+ Bluetooth lights. Simply pair them through the Apple Home app and begin creating your own personalized lighting experience.What You Need to Get StartedSMART+ Bluetooth Light BulbCompatible iOS device with Apple Home appOptional: Home Hub setup for away from home control, scheduling, and automations"},{"asin":"B075B8N5GD","title":"SYLVANIA LED A19 Light Bulb, 60W Equivalent, Efficient 8.5, 10 Year, W, 5000K, 800 Lumens, Frosted, Daylight - 24 Pack (74766)","price":"$29.99","saving":"","rating":"4.7","reviews":"63,774 ratings","image":"https://m.media-amazon.com/images/W/MEDIAX_792452-T2/images/I/81qvTR2ASXS.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Brighten your home with the SYLVANIA 8.5W LED A19 light bulbs! This 24 pack of soft white LED lamps are a great replacement for your 60W incandescent lamps. With just 8.5 watts, they will brighten your house with 800 lumens of light. Ideal for use in ceiling lights or floor lamps, the SYLVANIA LED Bulbs illuminate the house and adds dimensions with soft white illumination. Additionally, it will help you save up to 85 percent on your energy costs because it requires less energy and lasts longer than incandescent lamps. In fact, it has a lifespan of 11,000 hours. Unlike other light bulbs, SYLVANIA LED lights do not overheat. Our LED lights are UV, IR, and mercury free. You can also safely install them in ceiling light fixtures or floor lamps (not for use in fully enclosed fixtures). With these bulbs, you can be sure that what’s inside your house is safe to use. Keep your home bright and your electricity bill low with the SYLVANIA 8.5W LED A19 Bulbs; See the clear difference it makes."},{"asin":"B0758GXHQK","title":"SYLVANIA LED A19 Light Bulb, 60W Equivalent, Efficient 8.5W, 10 Year, 2700K, 800 Lumens, Frosted, Soft White - 24 Pack (74765), Packaging may vary.","price":"$40.59","saving":"","rating":"4.7","reviews":"63,774 ratings","image":"https://m.media-amazon.com/images/W/MEDIAX_792452-T2/images/I/81rMt+IZgPS._AC_SX300_SY300_.jpg","availability":"In Stock","tag":"","description":"Brighten your home with the SYLVANIA 8.5W LED A19 light bulbs! This 24 pack of soft white LED lamps are a great replacement for your 60W incandescent lamps. With just 8.5 watts, they will brighten your house with 800 lumens of light. Ideal for use in ceiling lights or floor lamps, the SYLVANIA LED Bulbs illuminate the house and adds dimensions with soft white illumination. Additionally, it will help you save up to 85 percent on your energy costs because it requires less energy and lasts longer than incandescent lamps. In fact, it has a lifespan of 11,000 hours. Unlike other light bulbs, SYLVANIA LED lights do not overheat. Our LED lights are UV, IR, and mercury free. You can also safely install them in ceiling light fixtures or floor lamps (not for use in fully enclosed fixtures). With these bulbs, you can be sure that what’s inside your house is safe to use. Keep your home bright and your electricity bill low with the SYLVANIA 8.5W LED A19 Bulbs; See the clear difference it makes."},{"asin":"B08T9WGV7R","title":"SYLVANIA Smart LED WiFi Full Color Light Strip, 6.5 ft, Dimmable, Compatible with Alexa and Google Home Only - 1 Pack (75704)","price":"$18.24","saving":"","rating":"4.3","reviews":"519 ratings","image":"https://m.media-amazon.com/images/W/MEDIAX_792452-T2/images/I/61gImHAlnyL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"SYLVANIA Smart WiFi products provide dynamic and hands-free home experiences by reimagining lighting with just the sound of your voice – anytime, anywhere. Compatible with Amazon Alexa and Google Home, SYLVANIA offers reliable illumination designed to simplify and color your favorite home spaces directly from your smartphone or voice command. With dimmable features, you can customize the brightness to match your mood, an occasion, or the time of day. Use simple commands to turn the lights on and off, dim or brighten, or cover rooms in your favorite color. It’s as easy as, “Alexa, turn the lights to indigo,” or say, “Hey Google, dim the lights to 50%.” With set-up in minutes, use the free SYLVANIA Smart WiFi App to begin so you can easily start your home experience via voice control and your smart home assistant. Pick from one of the 16 million colors or tune your white lighting temperatures from soothing soft white to an energetic daylight. The flexible light strip kit includes a power supply, controller, and is designed for indoor use only. Please note that this product is not compatible with Apple HomeKit.Rethink, reimagine, and relive your home experience with SYLVANIA Smart lighting."},{"asin":"B08FRPR7K6","title":"SYLVANIA Wifi LED Smart Light Bulb, 65W Equivalent Dimmable Soft White BR30, Compatible with Alexa and Google Home Only - 4 Pack (75689)","price":"$43.25","saving":"","rating":"4.2","reviews":"21,696 ratings","image":"https://m.media-amazon.com/images/I/61k2CIhLn7L.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"SYLVANIA SMART+ WiFi products provide dynamic and hands-free home experiences by reimagining lighting with just the sound of your voice – anytime, anywhere. Compatible with Amazon Alexa, Siri Shortcuts, and Google Home, SYLVANIA offers reliable illumination designed to simplify your favorite home spaces directly from your smartphone or voice command. With dimmable features, you can customize the brightness to match your mood, an occasion, or the time of day. Use simple commands to turn the lights on and off, dim or brighten. With set-up in minutes, use the free SYLVANIA SMART+ WiFi App to begin so you can easily start your home experience via voice control and your smart home assistant. Rethink, reimagine, and relive your home experience with SYLVANIA SMART+ lighting."},{"asin":"B08FRQFZ3B","title":"SYLVANIA Wifi LED Smart Light Bulb, 65W Equivalent Full Color and Tunable White BR30, Dimmable, Compatible with Alexa and Google Home Only - 4 Count (Pack of 1) (75688)","price":"$53.70","saving":"","rating":"4.5","reviews":"6,763 ratings","image":"https://m.media-amazon.com/images/W/MEDIAX_792452-T2/images/I/6152XO5GxQL.__AC_SY445_SX342_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"SYLVANIA SMART+ WiFi products provide dynamic and hands-free home experiences by reimagining lighting with just the sound of your voice – anytime, anywhere. Compatible with Amazon Alexa, Siri Shortcuts, and Google Home, SYLVANIA offers reliable illumination designed to simplify and color your favorite home spaces directly from your smartphone or voice command. With dimmable features, you can customize the brightness to match your mood, an occasion, or the time of day. Use simple commands to turn the lights on and off, dim or brighten, or cover rooms in your favorite color. It’s as easy as, “Alexa, turn the lights to indigo,” or say, “Hey Google, dim the lights to 50%.” With set-up in minutes, use the free SYLVANIA SMART+ WiFi App to begin so you can easily start your home experience via voice control and your smart home assistant. Pick from one of the 16 million colors or tune your white lighting temperatures from soothing soft white to an energetic daylight. Rethink, reimagine, and relive your home experience with SYLVANIA SMART+ lighting."},{"asin":"B0B2KWJLZT","title":"TP-Link Tapo Smart Light Bulbs, 16M Colors RGBW, Dimmable, Compatible with Alexa and Google Home, A19, 60W Equivalent, 800LM CRI>90, 2.4GHz WiFi only, No Hub Required, Tapo L530E(4-Pack)","price":"$25.99","saving":"-35%","rating":"4.5","reviews":"13,491 ratings","image":"https://m.media-amazon.com/images/I/619Djd3XXzL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Buy with Confidence Founded in 1996, TP-Link is a global provider of reliable networking and smart home devices, involved in all aspects of everyday life. With a proven heritage of stability, performance and value, TP-Link has curated a portfolio of products that meet the networking needs of all individuals. Now, as the connected lifestyle continues to evolve, the company is expanding today to exceed the demands of tomorrow. Industry-Leading Support TP-Link offers 24/7 technical support and 2-year warranty for most home products. TP-Link Tapo Smart Light Bulbs, 16M Colors RGBW, Tapo L530E(2-Pack) Choose from 16 millions of colors or set the bulb from warm to cool whites(2500K-6500K) thanks to the RGBW true-white LED. Tapo L530E has 220° beam angle for wider coverage, a color rendering index (CRI) > 90 for truly vibrant colors, and a luminous 800LM brightness level. Fully dim the lights from 1%-100% to match the mood anytime of day. Works with Alexa and Google Home."},{"asin":"B083BRRZ4Y","title":"TREATLIFE Smart Light Bulbs 4 Pack, UL Certified 2.4GHz Color Changing Light Bulb, Works with Alexa Google Home, A19 E26 Dimmable LED Light Bulb 9W 800 Lumen for Party Decoration, Smart Home Lighting","price":"$30.53","saving":"-24%","rating":"4.4","reviews":"17,030 ratings","image":"https://m.media-amazon.com/images/I/71XlG3+OEdL._AC_SX342_SY445_.jpg","availability":"Usually ships within 4 days","tag":"Amazon's  Choice","description":"About this item                   Remote Control with Smart App: Use the free App to control your Alexa light bulb from anywhere, anytime. Set schedules and automate your smart lights to make it seem like someone is home, even when you're away. Requires 2.4GHz Wi-Fi for pairing.     Hands-free Voice Control: Control your smart bulb with your voice via Amazon Alexa and Google Home Assistant. Simply say \"Alexa, turn on my living room lights\" or \"Hey Google, dim the led lights to 80%\". Perfect for when your hands are full or when you enter a dark room.     Multicolor & Tunable White: The Treatlife smart bulbs offer 16 million dimmable colors and warm-to-cool whites (2700K-6500K). Create your favorite lighting effects and adjust the brightness as needed. Ideal for decorating your home during holidays like Halloween, Christmas, and Thanksgiving, etc.     Schedule & Group Control: Use the timer or schedule feature to automatically turn your lights on and off, such as waking up to a soft glow in the morning with sunrise offset. You can also share devices and create groups to control all your lights at once.     Multiscene Purposes: DIY your ideal lighting effects with 8 preset scene modes to achieve the perfect atmosphere for any occasion, including movie night, cocktail party, reading, meeting, and leisure, etc. Make your life more colorful with smart LED light bulbs.       \n                    ›  See more product details"},{"asin":"B086XJ17XV","title":"Twinkly App-Controlled LEDstring Lights with 250 RGB (16 Million Colors) LEDs,65.6 feet, Green Wire, Indoor and Outdoor Smart Lighting Decoration","price":"$79.85","saving":"-11%","rating":"4.6","reviews":"6,050 ratings","image":"https://m.media-amazon.com/images/I/81Yo0KtHB2L.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"Only 1 left in stock - order soon.","tag":"","description":"About this item                   Compatible with Twinkly Music (sold separately), a smart USB-powered sound sensor that interprets ambient music and sounds in your space, synchronizing colors and effects with the rhythm of the music     Features 65.6 ft string lights including 250 RGB multi-color LEDs, offering a wide coverage of vibrant and energy-efficient illumination, for your bedroom, living room, or even outdoor     Weatherproof and versatile LED lights suitable as room lighting, ambient lighting, christmas lights, bedroom decor, or even a year round outdoor lights for house     Effortless setup and control via Bluetooth and Wi-Fi through the free Twinkly app on iOS and Android devices, allowing you to group multiple devices, control power, apply timers, and dim lights     Offers creative freedom with the Twinkly App's FX Wizard that offers preset effects, and crafts personalized animations, all using 16 million available colors for limitless possibilities       \n                    ›  See more product details"},{"asin":"B086XJ1RSY","title":"Twinkly Strings App Controlled 157 Feet Smart Christmas Lights with 600 RGB LEDs and Green Wire for Indoor and Outdoor Decorative Lighting","price":"$148.88","saving":"-11%","rating":"4.6","reviews":"5,977 ratings","image":"https://m.media-amazon.com/images/W/MEDIAX_792452-T2/images/I/71P54zdNxgL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"Only 10 left in stock - order soon.","tag":"","description":"About this item                   Create the ultimate lighting decorations with the smart and customizable Twinkly Strings Series of 600 RGB Lights and explore virtually unlimited ways to transform your space with light and color     Setup in a matter of seconds via the free Twinkly App for iOS and Android; Group multiple devices, set automated playlists, switch on and off, apply timers, adjust their brightness, and much more     Endless preset effects and animations or create your own ones using the FX Wizard on the app, you can also virtually draw effects on your lights with your fingers; Compatible with Google Home products and Amazon Alexa     Easy to use with 1-tap Bluetooth configuration and the ability to sync with up to 4,000 LEDs or 10 separate devices; Ideal for both indoor and outdoor use with the durable weatherproof construction     Plug-in located at the center of the light string but cannot connect multiple sets; Measures 157.5 feet long, 98 inches lead length, and 0.17 inches lamp diameter       \n                    ›  See more product details"},{"asin":"B09VYF5LDH","title":"Westinghouse Lighting 74001B00 Vintage-Style Barnett, Smart WiFi Ceiling Fan Compatible with Amazon Alexa and Google Home with LED Light, Remote Control, 48 Inch, Barnwood Finish, Cage Shade","price":"$162.14","saving":"","rating":"4.6","reviews":"660 ratings","image":"https://m.media-amazon.com/images/I/61opR9sbzDL.__AC_SY300_SX300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"The Westinghouse Barnett Smart ceiling fan easily connects via WiFi to your preferred smart home system, giving you hands-free, voice-activated control at home, or control from anywhere with your smartphone. The distinctive design finished in barnwood, with a cage shade light kit, adapts to various home decor styles, from industrial vintage to rustic. It features filament-style LED bulbs to reinforce the retro-industrial appeal, with reclaimed hickory and pewter ash blade finishes for additional vintage character. Westinghouse is a trusted, global brand. Westinghouse knows lighting products and offers exceptional quality and reliability. Product reference number 74001B."},{"asin":"B09G6TJVVC","title":"WiZ 60W A19 Color LED Smart Bulb - Pack of 1 - E26- Indoor - Connects to Your Existing Wi-Fi - Control with Voice or App + Activate with Motion - Matter Compatible","price":"$10.39","saving":"-20%","rating":"4.4","reviews":"11,878 ratings","image":"https://m.media-amazon.com/images/I/71g+Q+S2xWL._AC_SY300_SX300_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"The WiZ LED A19 full color bulb brings smart lighting for your daily living. Retrofit into any lamp shade to create the ambience of your choice with 16 million colors as well as warm to cool white light. You can set schedules to turn lights on and off according to daily or weekly routines, control with your smartphone or your voice and have remote access to your lights even when you're away. WiZ lights connect to your existing Wi-Fi, no additional hardware is needed."},{"asin":"B091TL3RB4","title":"WiZ 6FT RGB Wi-Fi LED Smart Color Changing Light Strip - Connects to Your Existing 2.4Ghz Wi-Fi - Control with Wiz Connected App - Works with Google Home, Alexa and Siri Shortcuts - No Hub Required","price":"$35.99","saving":"-20%","rating":"4.2","reviews":"421 ratings","image":"https://m.media-amazon.com/images/I/61Z8Lbd9-LL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"PLC 20W 2M LIGHT STRIP WIFI COLOR 1PK"}]}],"date":"January 14, 2024","count":189,"Ads":[{"asin":"B08WJT87Z6","title":"Fire TV Stick (3rd Gen) with Alexa Voice Remote (includes TV controls) + Star Wars The Mandalorian remote cover (Bounty Blue)","price":"$58.98","saving":"","rating":"4.7","reviews":"443,467 ratings","image":"https://m.media-amazon.com/images/I/51ueeNIE4SL._AC_SY300_SX300_.jpg","availability":"In Stock","tag":"","description":"This bundle includes a Fire TV Stick with Alexa Voice Remote and Star Wars The Mandalorian remote cover (Bounty Blue).     Personalize your remote with the cutest bounty in the galaxy.     Latest generation of our best-selling Fire TV device - 50% more powerful than the 2nd generation for fast streaming in Full HD. Includes Alexa Voice Remote with power and volume buttons.     Less clutter, more control - Alexa Voice Remote lets you use your voice to search and launch shows across apps. All-new preset buttons get you to favorite apps quickly. Plus, control power and volume on your TV and soundbar with a single remote.     Home theater audio with Dolby Atmos - Feel scenes come to life with immersive Dolby Atmos audio on select titles with compatible home audio systems.     Tens of thousands of channels, Alexa skills, and apps - Including Netflix, YouTube, Prime Video, Disney+, Apple TV+, and HBO Max. Subscription fees may apply.     Over 1.5 million movies and TV episodes - With thousands included in your Prime membership."},{"asin":"B08C1W5N87","title":"Amazon Fire TV Stick, HD, sharp picture quality, fast streaming, free & live TV, Alexa Voice Remote with TV controls","price":"$39.99","saving":"","rating":"4.7","reviews":"443,467 ratings","image":"https://m.media-amazon.com/images/I/71Wt1thqZEL._AC_SY300_SX300_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"50% more powerful than the previous generation for fast streaming in Full HD. Includes Alexa Voice Remote with power and volume buttons.     Stream more than 1.5 million movies and TV episodes from Netflix, Prime Video, Disney+, Peacock, and more, plus listen to millions of songs. Subscription fees may apply.     Receive a 6-month subscription to MGM+, including access to thousands of Hollywood movies and Original series with your Fire TV purchase. Terms apply.     Watch your favorite live TV, news, and sports with subscriptions to SLING TV, YouTube TV, and others. Use the Guide button to see what's available and when.     Access over 300,000 free movies and TV episodes from popular ad-supported streaming apps like Amazon Freevee, Tubi, Pluto TV and more.     Listen on Amazon Music, Spotify, Pandora, and others. Subscription fees may apply.     Alexa Voice Remote lets you use your voice to search and launch shows across apps. All-new preset buttons get you to favorite apps quickly. Plus, control power and volume on your TV and soundbar with a single remote.       \n                           Feel scenes come to life with immersive Dolby Atmos audio on select titles with compatible home audio systems.  Plug in behind your TV, turn on the TV, and connect to the internet to get set up.      Show more"},{"asin":"B08DJBDG5L","title":"Sengled Alexa Light Bulb, S1 Auto Pairing with Alexa Devices, Warm Smart Light Bulbs, Bluetooth Mesh Smart Home Lighting, E26 60W Equivalent, 800LM, 1-Pack","price":"$7.89","saving":"-21%","rating":"4.4","reviews":"105,046 ratings","image":"https://m.media-amazon.com/images/W/MEDIAX_792452-T2/images/I/61h2NO0RajL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"From Sengled - Smart Lighting Expert Since 1997.Sengled is committed to bringing automated whole-house smart living to your Alexa devices.R&D is fully focused on smart home lighting -Sengled integrate seamlessly with alexa Smart Home devices to offer beautiful lighting throughout your home.The alexa devices list that support to connect directly with The New - Sengled Auto Paring Technology.Echo Plus / Echo Studio / Echo Show / Echo Dot / Echo Frams.. (all after 2016 support Bluetooth gateway Alexa Devices)"},{"asin":"B0C3DV1KZJ","title":"Echo Dot (5th Gen) | Glacier White with Echo Buds (2023 Release) | Black","price":"$84.98","saving":"","rating":"4.7","reviews":"75,473 ratings","image":"https://m.media-amazon.com/images/I/71QVmDb6KlL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"This bundle contains Echo Dot (5th Gen) and Echo Buds (2023 Release).     ECHO BUDS + ECHO - Seamlessly move your music, podcasts, and radio from your Echo Buds to any compatible Alexa-enabled device and continue listening exactly where you left off.     OUR BEST SOUNDING ECHO DOT YET – Enjoy an improved audio experience compared to any previous Echo Dot with Alexa for clearer vocals, deeper bass and vibrant sound in any room.     YOUR FAVORITE MUSIC AND CONTENT – Play music, audiobooks, and podcasts from Amazon Music, Apple Music, Spotify and others or via Bluetooth throughout your home.     ALEXA IS HAPPY TO HELP – Ask Alexa for weather updates and to set hands-free timers, get answers to your questions and even hear jokes. Need a few extra minutes in the morning? Just tap your Echo Dot to snooze your alarm.     KEEP YOUR HOME COMFORTABLE – Control compatible smart home devices with your voice and routines triggered by built-in motion or indoor temperature sensors. Create routines to automatically turn on lights when you walk into a room, or start a fan if the inside temperature goes above your comfort zone.     DESIGNED TO PROTECT YOUR PRIVACY – Amazon is not in the business of selling your personal information to others. Built with multiple layers of privacy controls, including a mic off button on Echo Dot."},{"asin":"B0C3537ZLB","title":"Star Wars Bundle. Bundle Includes: Echo Dot (5th Gen, 2022 release) | Glacier White & the Limited Edition, Star Wars Stormtrooper Stand","price":"$89.98","saving":"","rating":"4.7","reviews":"75,473 ratings","image":"https://m.media-amazon.com/images/W/MEDIAX_792452-T1/images/I/51hdcQKY-VL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"This bundle Includes: Echo Dot (5th Gen, 2022 release) | Glacier White & the Limited Edition, Star Wars Stormtrooper Stand     OUR BEST SOUNDING ECHO DOT YET – Enjoy an improved audio experience compared to any previous Echo Dot with Alexa for clearer vocals, deeper bass and vibrant sound in any room.     YOUR FAVORITE MUSIC AND CONTENT – Play music, audiobooks, and podcasts from Amazon Music, Apple Music, Spotify and others or via Bluetooth throughout your home.     ALEXA IS HAPPY TO HELP – Ask Alexa for weather updates and to set hands-free timers, get answers to your questions and even hear jokes. Need a few extra minutes in the morning? Just tap your Echo Dot to snooze your alarm.     The Stormtrooper stand eyes will light up when the Echo Dot is placed in the stand, and Alexa’s name is called.     Can be easily placed on a table, desk, or nightstand."},{"asin":"B0C5K1FNP2","title":"Ring Video Doorbell Wired bundle with Echo Pop","price":"$82.98","saving":"","rating":"4.5","reviews":"74,248 ratings","image":"https://m.media-amazon.com/images/I/31LrQqisU7L._SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"Amazon's  Choice","description":"This bundle contains Ring Video Doorbell Wired bundle with Echo Pop.     1080p HD wired video doorbell with two-way talk, advanced motion detection, standard 2.4 GHz connectivity and customizable privacy settings     Get real-time notifications sent straight to your phone. To hear audio notifications in your home, pair with a Ring Chime, compatible Alexa device, or select the Video Doorbell Wired + Chime bundle. Note: the doorbell will not sound your existing chime.     Advanced motion detection helps you know when someone’s at your front door before they ring your doorbell.     Night vision with sharp contrast ensures you’ll never miss a detail – even in the dark.     Hardwire Video Doorbell Wired using your existing doorbell wiring and the included tool kit for around-the-clock power and peace of mind.     With a Ring Protect Plan (subscription sold separately), record all your videos, review what you missed for up to 180 days, and share videos and photos.     For added peace of mind, pair with Alexa to help you keep an eye on your home. Connect with Alexa to hear motion alerts on your compatible Echo device or see a Live View with an Echo Show, Fire TV, or Fire Tablet. Talk to visitors by saying, “Alexa, talk to the front door.” With a Ring Protect plan (subscription sold separately), Alexa can also make voice announcements and automatically show live video feed on an Echo Show, Fire TV, or Fire Tablet when your Ring Video Doorbell detects a person."},{"asin":"B075B8N5GD","title":"SYLVANIA LED A19 Light Bulb, 60W Equivalent, Efficient 8.5, 10 Year, W, 5000K, 800 Lumens, Frosted, Daylight - 24 Pack (74766)","price":"$29.99","saving":"","rating":"4.7","reviews":"63,774 ratings","image":"https://m.media-amazon.com/images/W/MEDIAX_792452-T2/images/I/81qvTR2ASXS.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"In Stock","tag":"","description":"Brighten your home with the SYLVANIA 8.5W LED A19 light bulbs! This 24 pack of soft white LED lamps are a great replacement for your 60W incandescent lamps. With just 8.5 watts, they will brighten your house with 800 lumens of light. Ideal for use in ceiling lights or floor lamps, the SYLVANIA LED Bulbs illuminate the house and adds dimensions with soft white illumination. Additionally, it will help you save up to 85 percent on your energy costs because it requires less energy and lasts longer than incandescent lamps. In fact, it has a lifespan of 11,000 hours. Unlike other light bulbs, SYLVANIA LED lights do not overheat. Our LED lights are UV, IR, and mercury free. You can also safely install them in ceiling light fixtures or floor lamps (not for use in fully enclosed fixtures). With these bulbs, you can be sure that what’s inside your house is safe to use. Keep your home bright and your electricity bill low with the SYLVANIA 8.5W LED A19 Bulbs; See the clear difference it makes."},{"asin":"B0758GXHQK","title":"SYLVANIA LED A19 Light Bulb, 60W Equivalent, Efficient 8.5W, 10 Year, 2700K, 800 Lumens, Frosted, Soft White - 24 Pack (74765), Packaging may vary.","price":"$40.59","saving":"","rating":"4.7","reviews":"63,774 ratings","image":"https://m.media-amazon.com/images/W/MEDIAX_792452-T2/images/I/81rMt+IZgPS._AC_SX300_SY300_.jpg","availability":"In Stock","tag":"","description":"Brighten your home with the SYLVANIA 8.5W LED A19 light bulbs! This 24 pack of soft white LED lamps are a great replacement for your 60W incandescent lamps. With just 8.5 watts, they will brighten your house with 800 lumens of light. Ideal for use in ceiling lights or floor lamps, the SYLVANIA LED Bulbs illuminate the house and adds dimensions with soft white illumination. Additionally, it will help you save up to 85 percent on your energy costs because it requires less energy and lasts longer than incandescent lamps. In fact, it has a lifespan of 11,000 hours. Unlike other light bulbs, SYLVANIA LED lights do not overheat. Our LED lights are UV, IR, and mercury free. You can also safely install them in ceiling light fixtures or floor lamps (not for use in fully enclosed fixtures). With these bulbs, you can be sure that what’s inside your house is safe to use. Keep your home bright and your electricity bill low with the SYLVANIA 8.5W LED A19 Bulbs; See the clear difference it makes."},{"asin":"B09FPQLMNK","title":"Sengled Smart Recessed Lighting, 5/6 inch, S1 Auto Pairing with Alexa Devices, Led Lights, Smart Can Lights Retrofit Work with Alexa, Smart LED Downlight, ‎Multicolor Dimmable, Conversion Kit,1-Pack","price":"$29.99","saving":"","rating":"4.5","reviews":"63,692 ratings","image":"https://m.media-amazon.com/images/I/61OhjA0V2KL.__AC_SX300_SY300_QL70_ML2_.jpg","availability":"Only 9 left in stock (more on the way).","tag":"","description":"From Sengled - Smart Lighting Expert Since 1997.Sengled is committed to bringing automated whole-house smart living to your Alexa devices.R&D is fully focused on smart home lighting -Sengled integrate seamlessly with alexa Smart Home devices to offer beautiful lighting throughout your home.The alexa devices list that support to connect directly with The New - Sengled Auto Paring Technology.Echo Plus / Echo Studio / Echo Show / Echo Dot / Echo Frams.. (all after 2016 support Bluetooth gateway Alexa Devices)"},{"asin":"B09KVZH4K7","title":"Amazon Fire TV Stick Lite Essentials Bundle with USB Power Cable","price":"$49.98","saving":"","rating":"4.7","reviews":"54,191 ratings","image":"https://m.media-amazon.com/images/I/51Zid3TxqmL._AC_SY300_SX300_.jpg","availability":"In Stock","tag":"","description":"This bundle contains Amazon Fire TV Stick Lite and Mission USB Power Cable.     The USB power cable eliminates the need to find an AC outlet near your TV by powering Amazon Fire TV directly from your TV's USB port.     Includes special power management circuitry that enhances the peak power capability of the USB port by storing excess energy and then releasing it as needed.     Press and ask Alexa - Use your voice to easily search and launch shows across multiple apps.     Endless entertainment - Stream more than 1.5 million movies and TV episodes from Netflix, Prime Video, Disney+, Peacock, and more, plus listen to millions of songs. Subscription fees may apply.     Live TV - Watch your favorite live TV, news, and sports with subscriptions to SLING TV, YouTube TV, and others."}]}